{"version":"https://jsonfeed.org/version/1.1","id":"3ffcd46","title":"GigaBlog","description":"Data driven blogging from the GigaScience editors","language":"en-GB","license":"https://creativecommons.org/licenses/by/4.0/legalcode","category":"Natural Sciences","homePageUrl":"http://gigasciencejournal.com/blog","feedUrl":"http://gigasciencejournal.com/blog/feed/","favicon":null,"generator":"https://wordpress.org/?v=6.2","items":[{"id":"http://gigasciencejournal.com/blog/?p=4893","title":"Announcing the GigaScience T2T Series: Closing the Gaps from Telomere-to-Telomere","link":"http://gigasciencejournal.com/blog/t2t-series/","published":"Sun, 02 Apr 2023 19:11:16 +0000","description":"An announcement on the GigaScience T2T (Telomere to Telomere) Series: Closing the Gaps from Telomere-to-Telomere The post Announcing the GigaScience T2T Series: Closing the Gaps from Telomere-to-Telomere...","isPermalink":false,"tags":["Technology","genomics","open science","T2T","T2T Series"],"authors":[{"name":"Scott Edmunds","url":null}],"image":null,"modified":null,"contentHtml":"\n<figure class=\"wp-block-image size-large is-resized\"><img decoding=\"async\" src=\"http://gigasciencejournal.com/blog/wp-content/uploads/2023/04/t2t-instagram-square-1-1024x1024.png\" alt=\"T2T series\" class=\"wp-image-4895\" width=\"768\" height=\"768\" srcset=\"http://gigasciencejournal.com/blog/wp-content/uploads/2023/04/t2t-instagram-square-1-1024x1024.png 1024w, http://gigasciencejournal.com/blog/wp-content/uploads/2023/04/t2t-instagram-square-1-300x300.png 300w, http://gigasciencejournal.com/blog/wp-content/uploads/2023/04/t2t-instagram-square-1-150x150.png 150w, http://gigasciencejournal.com/blog/wp-content/uploads/2023/04/t2t-instagram-square-1-768x768.png 768w, http://gigasciencejournal.com/blog/wp-content/uploads/2023/04/t2t-instagram-square-1.png 1080w\" sizes=\"(max-width: 768px) 100vw, 768px\" /></figure>\n\n\n\n<p><em>Series Editors: Jue Ruan (Agricultural Genomics Institute at Shenzhen, Chinese Academy of Agricultural Sciences) and Fritz J Sedlazeck (Human Genome Sequencing Center, Baylor College of Medicine)&nbsp;</em></p>\n\n\n\n<p>&nbsp;<br>While the first draft of the Human Genome was announced back in June 2000 and declared complete in April 2003, it took 20 years for the <a href=\"http://doi.org/10.1126/science.abj6987\">publication</a> of the first complete, gapless sequence of a human genome in March 2022. The work was done by the <a href=\"https://sites.google.com/ucsc.edu/t2tworkinggroup?pli=1\">Telomere to Telomere (T2T) consortium</a>, which was a years-long global collaboration led by geneticists at UC Santa Cruz, University of Washington, and the National Institutes of Health. This T2T approach has now rolled out to other species’ genomes, and has become a bit of a badge for a certain level of quality that enables new understanding of biology and improvements in genome annotation. At <em>GigaScience</em> we’ve already seen fully-resolved genomes coming in, for example that of the protozoal agent<a href=\"https://doi.org/10.1093/gigascience/giac010\"> <em>Cryptosporidium parvum</em></a>; however, given the current uncertainty within the broader community on what constitutes a “true” T2T sequence, completely defined standards remain unclear.</p>\n\n\n\n<p>With the interest in this new level of genome sequence, the data and tools, and the evolving nature of accepted cutoffs, <em>GigaScience </em>is pleased to announce a new <a href=\"https://academic.oup.com/gigascience/pages/collections\">thematic series</a>. This series is focused on T2T papers to provide a home for these discussions, updated datasets, including new technologies and methods that have driven this new standard in genomics.&nbsp;</p>\n\n\n\n<p>Working on the definition of what T2T standards are (and to aid potential submitters on what is suitable for submission), our Guest Editors <a href=\"https://agis.caas.cn/en/research/principalinvestigator/237653.htm\">Jue Ruan</a> and <a href=\"https://www.hgsc.bcm.edu/people/sedlazeck-f\">Fritz J Sedlazeck</a> both have hands-on involvement in this rapidly moving field and have helped draw up guidelines of what can be called a T2T genome and considered for the series. Feeling these should be gap-free assemblies (although a few gaps can potentially be allowed, especially in rRNA regions and sex chromosomes), have very high Q and BUSCO scores, and with minimal structural artefacts (in the raw data vs assembly). Nevertheless, in such a rapidly moving area of research especially across multiple phylums these requirements need some adaptations depending on ploidy, repetitiveness and other factors given a . particularly complicated or&nbsp; insightful findings.</p>\n\n\n\n<p>On top of defining thresholds the Guest Editors have interesting frontline insight in the field as a whole, and there is a lot that can potentially be discussed and shared. There is much biological information to be gleaned from newly resolved regions, annotations/genes, etc. As Dr. Sedlazeck highlighted “The access in these novel regions will enable new insights for biology and evolution, but demand novel analytical approaches”. Exploratory articles highlighting the importance of these new regions or improving the annotations are particularly encouraged, especially as the latter is still a huge pain point.&nbsp;</p>\n\n\n\n<p>Please <a href=\"editorial@gigasciencejournal.com\">contact us</a> if you have work of interest you would like to discuss, or you can submit through our submission and make a note of this series in the covering letter.</p>\n\n\n\n<p><strong>Further Reading:</strong><br>Nurk S, et al. The complete sequence of a human genome. <em>Science</em>. 2022 Apr;376(6588):44-53. doi: <a href=\"http://doi.org/10.1126/science.abj6987\">10.1126/science.abj6987</a>.</p>\n\n\n\n<p>Menon VK, et al. Fully resolved assembly of <em>Cryptosporidium parvum</em>. <em>Gigascience</em>. 2022 Feb 15;11:giac010.<a href=\"https://doi.org/10.1093/gigascience/giac010\"> https://doi.org/10.1093/gigascience/giac010</a></p>\n<p>The post <a rel=\"nofollow\" href=\"http://gigasciencejournal.com/blog/t2t-series/\">Announcing the GigaScience T2T Series: Closing the Gaps from Telomere-to-Telomere</a> appeared first on <a rel=\"nofollow\" href=\"http://gigasciencejournal.com/blog\">GigaBlog</a>.</p>\n"},{"id":"http://gigasciencejournal.com/blog/?p=4850","title":"RDA20 Plenary: A Decade of Data 2013-2023. Celebrating 10 years of the Research Data Alliance (RDA)","link":"http://gigasciencejournal.com/blog/rda20-a-decade-of-data-2013-2023/","published":"Thu, 30 Mar 2023 10:57:06 +0000","description":"In one of our conference write-ups, GigaDB provides perspectives and summary of the RDA20 plenary- A decade of data. 5 days of discussions and working groups all about research data. The post RDA20 Plenary: A...","isPermalink":false,"tags":["Open Access","conference","conferences","data publishing","data usage tracking"],"authors":[{"name":"Chris Hunter","url":null}],"image":null,"modified":null,"contentHtml":"\n<p>Gothenburg, Sweden played host to the Research Data Alliance (RDA) <a href=\"https://www.google.com/url?q=https://www.rd-alliance.org/plenaries/rda-20th-plenary-meeting-gothenburg-hybrid&sa=D&source=docs&ust=1680112038610413&usg=AOvVaw32tRTexPWk7lMdW6Rntxym\">RDA20 plenary</a> from March 20th to 24th 2023. A hybrid event with most sessions recorded and made available via the <a href=\"https://rdap20.events.whova.com/\">Whova app for registered participants</a>. Recordings will be made available on Monday, 1 May 2023 to the wider community.</p>\n\n\n\n<p>For the first in-person plenary since lockdown, the RDA celebrated its 10th year anniversary (<a href=\"http://gigasciencejournal.com/blog/birthday-at-ismb2022/\">this being a good 12 months</a> for 10-year anniversaries). The RDA20 plenary promised to be something special. It delivered!&nbsp;</p>\n\n\n\n<figure class=\"wp-block-image size-large is-resized\"><img decoding=\"async\" loading=\"lazy\" src=\"http://gigasciencejournal.com/blog/wp-content/uploads/2023/03/Hilary-rda20-1024x513.jpg\" alt=\"RDA020 Plenary\" class=\"wp-image-4853\" width=\"580\" height=\"257\"/><figcaption>580Fig1: Hilary Hanahoe (Secretary General, RDA) presenting the number of attendees at RDA20</figcaption></figure>\n\n\n\n<p>The day before the actual plenary started (Monday 20th) as well as the day after (Friday 24th), there were several co-located meetings being held, so effectively it was a 5 day meeting. For many of the attendees it was their first F2F meeting in 3 years due to the pandemic, so those people found it particularly hard work staying actively engaged.&nbsp;</p>\n\n\n\n<p>We reconnected with our colleagues at DataCite on Monday at the <a href=\"https://datacite.org/datacite-connect-2023.html\">DataCite connect meeting</a>.&nbsp;Readers of t<a href=\"http://gigasciencejournal.com/blog/tag/datacite/\">his blog should know</a> of our long-term membership and use of their identifiers in GigaDB.</p>\n\n\n\n<p>The main plenary days followed a schedule of keynotes in the morning followed by parallel breakout sessions from mid-morning through to the end of the day. The organisers had helpfully provided a set of suggested <a href=\"https://www.rd-alliance.org/rdas-20th-plenary-pathways\">pathways</a> for attendees to use based on the theme(s) of interest; one suggestion I have to further improve this would be to include the days/times and rooms of the suggested sessions to aid navigation at the event</p>\n\n\n\n<p>Here I highlight a small selection of the presentation that I found informative and interesting. <a href=\"https://www.google.com/url?q=https://www.rd-alliance.org/practical-approaches-tracking-and-communicating-use-research-data&sa=D&source=docs&ust=1680112038611713&usg=AOvVaw2A6a4_z37JWKbZ223WIbQd\">The Practical Approaches to Tracking and Communicating the use of Research Data</a> session provided a summary of the <a href=\"https://doi.org/10.15497/RDA00062\">Data Usage Working Group output</a> which recommends 5 things :&nbsp;</p>\n\n\n\n<p class=\"has-small-font-size\">1: Data usage is complicated, while these complex areas will need to be resolved, the focus should remain on the adoption of minimal frameworks for counting data usage.&nbsp;</p>\n\n\n\n<p class=\"has-small-font-size\">2: Utilizing the <a href=\"https://www.google.com/url?q=https://www.projectcounter.org/code-practice-research-data/&sa=D&source=docs&ust=1680112038612683&usg=AOvVaw0uoTE9HfDb0ueMAFN0mqDw\">COUNTER Code of Practice for Research Data</a>, and utilizing DataCite for aggregations.</p>\n\n\n\n<p class=\"has-small-font-size\">3: There should be caution against defaulting to data metrics like a data impact factor.</p>\n\n\n\n<p class=\"has-small-font-size\">4: Consider potential shortcomings, mitigations that can be made, and broader use cases for implementation to better understand usage types.</p>\n\n\n\n<p class=\"has-small-font-size\">5: Close coordination with <a href=\"https://www.google.com/url?q=http://www.scholix.org/&sa=D&source=docs&ust=1680112038613139&usg=AOvVaw2sXCoPnoJ3oDdLYKuhhgno\">Scholix</a> is recommended as usage and citation are closely tied together.&nbsp;</p>\n\n\n\n<p><a href=\"https://www.google.com/url?q=https://orcid.org/0000-0001-7234-3684&sa=D&source=docs&ust=1680112038613800&usg=AOvVaw261ZLXsioHVggyZ26lx68J\">Matt Buys</a> from DataCite followed with an update on the <a href=\"https://makedatacount.org/\">Make Data Count Initiative</a>, of which our team member Scott Edmunds is on the <a href=\"https://makedatacount.org/team/\">Advisory Board of</a>. Which is a stable framework, but requires a broader adoption to make it useful. Currently, we are in a slight chicken-and-egg situation with repositories reluctant to offer the data metrics until someone provides the specifications of what exactly should be provided. The funders are not pushing for anything specific about data usage partly because they don&#8217;t know what is possible. Authors still focussed on journal citation as a mechanism of reward, meaning they aren’t particularly motivated to push for data usage measuring. </p>\n\n\n\n<p>One effort to jump-start the process is the Wellcome initiative to create a global corpus of data citations and data mentions. The initiative is gathering a corpus of references to published data within <a href=\"https://doi.org/10.5438/vjz9-kx84\">journal articles and pre-prints</a>. It aims to provide a global set of measurable links that can be used to explore what is possible and what is useful in terms of data usage tracking.</p>\n\n\n\n<p><a href=\"https://www.google.com/url?q=https://orcid.org/0000-0001-6133-4045&sa=D&source=docs&ust=1680112038614614&usg=AOvVaw0A3cWgfOweZUt3W4Uf4jYZ\">Kelly Stathis</a> (DataCite) presented the <a href=\"https://www.google.com/url?q=https://support.datacite.org/docs/datacite-usage-tracker&sa=D&source=docs&ust=1680112038615188&usg=AOvVaw2Kr07i33Mn6pXLgCZ7QcPQ\">DataCite Usage Tracker</a> (beta release). The goal of the tracker is to reduce the burden of implementing usage tracking on repositories. The general idea is that a repository embeds a small javascript in the landing page of the dataset. This sends a message to the DataCite usage tracker every time someone visits the page. In addition, another javascript can be embedded in a download confirmation page which then counts the number of downloads of that dataset. &nbsp;This is a beta service at the moment, and one that GigaDB intends to implement, so watch this space!</p>\n\n\n\n<p>There were a number of sessions discussing software as research objects. Including presentations from FAIR4RS and DOME-ML, as well as CodeMeta. The latter is an attempt to standardise the way in which developers can share the metadata about their software and code. Essentially it is a JSON-LD schema that includes holders for all the important bits of information that a potential user (either human or computer) may require to use the software, e.g. the citation details, version number, dependencies, environment, the status of code, community links, etc&#8230;</p>\n\n\n\n<p>It wasn’t all just presentation after presentation. Many of the sessions included panel discussions to engage with the audiences. The co-located workshops book-ending the meeting all included collaborative working sessions to move the groups forward towards their respective goals.&nbsp;</p>\n\n\n\n<figure class=\"wp-block-image size-large is-resized\"><img decoding=\"async\" loading=\"lazy\" src=\"http://gigasciencejournal.com/blog/wp-content/uploads/2023/03/RDA20-town-hall-1024x768.jpg\" alt=\"\" class=\"wp-image-4852\" width=\"580\" height=\"435\" srcset=\"http://gigasciencejournal.com/blog/wp-content/uploads/2023/03/RDA20-town-hall-1024x768.jpg 1024w, http://gigasciencejournal.com/blog/wp-content/uploads/2023/03/RDA20-town-hall-300x225.jpg 300w, http://gigasciencejournal.com/blog/wp-content/uploads/2023/03/RDA20-town-hall-768x576.jpg 768w, http://gigasciencejournal.com/blog/wp-content/uploads/2023/03/RDA20-town-hall-1536x1152.jpg 1536w, http://gigasciencejournal.com/blog/wp-content/uploads/2023/03/RDA20-town-hall.jpg 2048w\" sizes=\"(max-width: 580px) 100vw, 580px\" /><figcaption>Gothenburg town hall, just before the RDA20 participants arrived.</figcaption></figure>\n\n\n\n<p>No meeting would be complete without networking events. RDA20 provided two such opportunities. First was the birthday celebration in the fabulous town hall (see Fig2). As well as the conference dinner which included live entertainment from the Chalmers University band-cum-circus act!? Think big brass band meets circus clowns, you had to see it to believe it.<br>All-in-all the meeting was a great success, a tribute to all those involved organising and participating in it. The next RDA installment will be <a href=\"https://www.rd-alliance.org/plenaries/international-data-week-2023-salzburg\">International Data Week</a> in Salzburg 23-26 October 2023.</p>\n<p>The post <a rel=\"nofollow\" href=\"http://gigasciencejournal.com/blog/rda20-a-decade-of-data-2013-2023/\">RDA20 Plenary: A Decade of Data 2013-2023. Celebrating 10 years of the Research Data Alliance (RDA)</a> appeared first on <a rel=\"nofollow\" href=\"http://gigasciencejournal.com/blog\">GigaBlog</a>.</p>\n"},{"id":"http://gigasciencejournal.com/blog/?p=4863","title":"Multi-dimensional data for Cooinda the dingo","link":"http://gigasciencejournal.com/blog/dingo-coinda-genome/","published":"Wed, 29 Mar 2023 16:14:32 +0000","description":"A new GigaScience article presents rich multi-dimensional data on a female dingo, Cooinda, including a whole genome sequence. The post Multi-dimensional data for Cooinda the dingo appeared first on GigaBlog.","isPermalink":false,"tags":["Biology","epigenomics","genomics","imaging"],"authors":[{"name":"Hans Zauner","url":null}],"image":null,"modified":null,"contentHtml":"\n<p><strong> <a href=\"https://doi.org/10.1093/gigascience/giad018\">A new <em>GigaScience</em> article</a> presents <strong>rich multi-dimensional</strong> data for one Alpine dingo named Cooinda</strong>. <strong>The high-quality genome sequence, other molecular biology data, and magnetic resonance imaging of brain tissue will  serve as a point of reference for exploring the evolutionary history of dingoes. The goal is to better understand how and when humans influenced the breed’s anatomy, genetics and behavior.</strong></p>\n\n\n\n<p>What exactly is a dingo? A dog? A wolf? Something in between? What we know: They came to Australia several thousand years ago. When they first arrived on the continent— probably in the company of sailors — they likely already had a history of interactions with humans that shaped their behavior, their anatomy and their genes.</p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter size-large\"><a href=\"https://doi.org/10.1093/gigascience/giad018\"><img decoding=\"async\" loading=\"lazy\" width=\"437\" height=\"458\" src=\"http://gigasciencejournal.com/blog/wp-content/uploads/2023/03/DingoPups.jpg\" alt=\"dingo pups\" class=\"wp-image-4875\" srcset=\"http://gigasciencejournal.com/blog/wp-content/uploads/2023/03/DingoPups.jpg 437w, http://gigasciencejournal.com/blog/wp-content/uploads/2023/03/DingoPups-286x300.jpg 286w\" sizes=\"(max-width: 437px) 100vw, 437px\" /></a><figcaption>Cooinda the dingo and her brother as pups. photo from Ballard et al.  (CC-BY).</figcaption></figure></div>\n\n\n\n<p><br>                                                                                                                                                                        <a href=\"https://www.science.org/doi/10.1126/sciadv.abm5944\">Earlier work</a>, including a whole genome sequence,  has confirmed that dingoes are indeed an early offshoot of modern dog, between the wild wolf and today’s domesticated dogs. However, domestication is a long process, and maybe the dingo is indeed somewhat marking an intermediate stage of domestication. In that sense the breed is distinct from what we usually consider a dog (<em>&#8220;Canis familiaris</em>&#8220;) &#8211; and indeed, some scientists have proposed to give the dingo its own taxonomic name, setting it apart from the dog.</p>\n\n\n\n<h3 class=\"has-text-align-center wp-block-heading\"><strong>A reference point to study the dingo&#8217;s origin</strong></h3>\n\n\n\n<p>What complicated the debate about the dingo&#8217;s origin so far was the absence of an example specimen  that researchers could use as a reference point for detailed comparisons at all levels  &#8211; including  morphology, genetics and molecular biology. </p>\n\n\n\n<p>That&#8217;s where the team led by Bill Ballard (University of Melbourne) and <a href=\"https://doi.org/10.1093/gigascience/giad018\">their new <em>GigaScience</em> paper</a> come in: They propose one taxidermally prepared specimen, an alpine dingo named Cooinda, as the model specimen to represent a typical dingo that they call an “archetype”. This designated type specimen &#8211; and the data collected on it &#8211; will help to better understand the unique placement of the dingo between a wild and a fully domesticated species.</p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter size-large\"><img decoding=\"async\" loading=\"lazy\" width=\"406\" height=\"457\" src=\"http://gigasciencejournal.com/blog/wp-content/uploads/2023/03/Cooinda.jpg\" alt=\"Cooinda the dingo\" class=\"wp-image-4876\" srcset=\"http://gigasciencejournal.com/blog/wp-content/uploads/2023/03/Cooinda.jpg 406w, http://gigasciencejournal.com/blog/wp-content/uploads/2023/03/Cooinda-267x300.jpg 267w\" sizes=\"(max-width: 406px) 100vw, 406px\" /><figcaption>Cooinda the dingo. photo from Ballard et al. (CC-BY)</figcaption></figure></div>\n\n\n\n<p><br>                                                                                                                                  Charles Darwin was fascinated by domestication of animals, and in fact observations on domesticated animals were a departure point when laying out the theory of evolution ( he was particularly obsessed with pigeon breeds, as every reader of his &#8220;Origin of species&#8221; will soon realize).</p>\n\n\n\n<h3 class=\"has-text-align-center wp-block-heading\"><strong>Are dingoes tamed but not domesticated?</strong></h3>\n\n\n\n<p> Darwin proposed a two-step model of domestication: According to this idea, the first step is characterized by “unconscious” selection, leading to merely <em>tamed </em>rather than <em>domesticated</em> animals; followed in a second step by what biologists today call artificial selection. The hallmark of the second stage is that humans deliberately interfere in mating and reproduction.</p>\n\n\n\n<p> Is the Dingo an example of a population that only made it to the first step in Darwin’s model, but not the second? Maybe the dingo is not a &#8220;feralized&#8221; dog, but was never really selectively bred by humans in the first place.</p>\n\n\n\n<p><br>Prof. Bill Ballard, first author of the new GigaScience study, explains: <em>“Unfortunately, the absence of a dingo reference specimen impedes our ability to definitively determine whether dingoes are a tamed intermediate or a feral canid, because we do not have a single reference point that links the scientific name to a specific specimen.”</em></p>\n\n\n\n<figure class=\"wp-block-image size-large is-resized\"><img decoding=\"async\" loading=\"lazy\" src=\"http://gigasciencejournal.com/blog/wp-content/uploads/2023/03/dingografik.jpg\" alt=\"\" class=\"wp-image-4874\" width=\"510\" height=\"463\" srcset=\"http://gigasciencejournal.com/blog/wp-content/uploads/2023/03/dingografik.jpg 856w, http://gigasciencejournal.com/blog/wp-content/uploads/2023/03/dingografik-300x273.jpg 300w, http://gigasciencejournal.com/blog/wp-content/uploads/2023/03/dingografik-768x698.jpg 768w\" sizes=\"(max-width: 510px) 100vw, 510px\" /><figcaption>Circos plot comparing Alpine and Desert dingo genomes. from Ballard et al. (CC-BY)</figcaption></figure>\n\n\n\n<p><br>The genomic and morphological data in the new study is based upon an Alpine Dingo named Cooinda from Dingo Sanctuary Bargo in New South Wales, Australia. The previously published Dingo genome was based on another animal, <a href=\"https://newsroom.unsw.edu.au/news/science-tech/sandy-dingo-wins-world%E2%80%99s-most-interesting-genome-competition\">Sandy, a Desert Dingo</a>, and the new data also allow comparisons between the Alpine and Desert ecological types.</p>\n\n\n\n<h3 class=\"has-text-align-center wp-block-heading\"><strong>Dingoes come in two varieties: Alpine and desert</strong></h3>\n\n\n\n<p><br>In addition to the high quality genome data, the Australian team also collected mitochondrial DNA sequences and DNA methylome data, and linked this molecular information with morphological analyses of head shape and magnetic resonance imaging of Cooinda’s brain.</p>\n\n\n\n<p>Along with other morphological changes, “<em>domesticated animals often show reduced brain size compared to their wild relatives”</em> notes study co-author Assoc. Prof. Laura Wilson (ANU). The brain analyses show that Cooinda had a larger cranial capacity than a similar-sized domestic dog.<br>Having such a data-rich and diverse characterization of a single individual makes Cooinda an ideal candidate to be considered the “archetype” for Dingo. She is now on display at the <a href=\"https://australian.museum/\">Australia Museum</a> in Sydney.</p>\n\n\n\n<p><strong>Further Reading:</strong></p>\n\n\n\n<p>Ballard JWO, Field MA, Edwards RJ, Wilson LAB, Koungoulos L, Rosen BD et al. <strong>The Australasian dingo archetype: De novo chromosome-length genome assembly, DNA methylome, and cranial morphology</strong><br><em>GigaScience</em>,2023, giad018 <a href=\"https://doi.org/10.1093/gigascience/giad018\">https://doi.org/10.1093/gigascience/giad018 </a></p>\n\n\n\n<p><strong>Data Availability:</strong></p>\n\n\n\n<p>Ballard JWO, Field MA, Edwards RJ, Wilson LAB, Koungoulos L, Rosen BD et al. <strong>Supporting data for &#8220;The Australasian dingo archetype: De novo chromosome-length genome assembly, DNA methylome, and cranial morphology&#8221;</strong> GigaScience Database. 2023. <a href=\"http://dx.doi.org/10.5524/102356\">http://dx.doi.org/10.5524/102356</a></p>\n\n\n\n<p>MRI Alpine dingo and domestic dog brain. Figshare repository. 2022.<br><a href=\"https://doi.org/10.6084/m9.figshare.20514693.v2\">https://doi.org/10.6084/m9.figshare.20514693.v2</a></p>\n\n\n\n<p></p>\n<p>The post <a rel=\"nofollow\" href=\"http://gigasciencejournal.com/blog/dingo-coinda-genome/\">Multi-dimensional data for Cooinda the dingo</a> appeared first on <a rel=\"nofollow\" href=\"http://gigasciencejournal.com/blog\">GigaBlog</a>.</p>\n"},{"id":"http://gigasciencejournal.com/blog/?p=4838","title":"Addressing the challenges of sharing computational workflows with Yevis. Q&A with Tazro Ohta.","link":"http://gigasciencejournal.com/blog/yevis-qa-with-tazro-ohta/","published":"Mon, 06 Mar 2023 13:01:33 +0000","description":"We have an author Q&#038;A and video abstract with Tazro Ohta where he gives some insight into archiving workflows and his new Yevis platform. The post Addressing the challenges of sharing computational...","isPermalink":false,"tags":["Technology","Q&A","reproducibility","reproducible research","workflows"],"authors":[{"name":"Scott Edmunds","url":null}],"image":null,"modified":null,"contentHtml":"\n<p></p>\n\n\n\n<p>At <em>GigaScience</em> we see more and more of our published papers use computational workflows, as they provides researchers easy access to high-quality analysis methods without the requirement of computational expertise. However, systems are needed to enable the sharing of these workflows in a reusable form. To fill that gap we have a <a href=\"https://doi.org/10.1093/gigascience/giad006\">recently published paper on Yevi</a>s, a system to build a workflow registry that automatically validates and tests published workflows. This new system particularly useful to those that want to share workflows but lack the specific technical expertise to build and maintain a workflow registry from scratch. Yevis was started by Hirotaka Suetake and Tazro Ohta at the Database Center for Life Science in Shizuoka Japan, Hiro being the main developer of the implementations and Tazro the lead of the project.  Following our long running series of <a href=\"http://gigasciencejournal.com/blog/tag/qa/\">author Q&A’s</a> (and <a href=\"https://www.youtube.com/@GigaScienceJournal\">videos</a>) we present a Q&A and <a href=\"https://youtu.be/Yr7UUw_lqGE\">video abstract</a> (see below) with Tazro where he gives some insight into archiving workflows and his new platform.</p>\n\n\n\n<figure class=\"wp-block-image size-large is-style-rounded\"><img decoding=\"async\" loading=\"lazy\" width=\"705\" height=\"705\" src=\"http://gigasciencejournal.com/blog/wp-content/uploads/2023/03/Tazro_crop-1.jpeg\" alt=\"Yevis author Tazro Ohta\" class=\"wp-image-4844\" srcset=\"http://gigasciencejournal.com/blog/wp-content/uploads/2023/03/Tazro_crop-1.jpeg 705w, http://gigasciencejournal.com/blog/wp-content/uploads/2023/03/Tazro_crop-1-300x300.jpeg 300w, http://gigasciencejournal.com/blog/wp-content/uploads/2023/03/Tazro_crop-1-150x150.jpeg 150w\" sizes=\"(max-width: 705px) 100vw, 705px\" /><figcaption>Dr Tazro Ohta from the Database Center for Life Science in Shizuoka Japan</figcaption></figure>\n\n\n\n<p><br><strong>What are the challenges in sharing computational workflows, and how does Yevis help address these?</strong><br><br>If you want just to make your workflows public, it won&#8217;t be a difficult task. Many public web services like GitHub can help you to upload your resources, and some are free of charge. Sharing your workflow has a huge potential to help researchers who want to perform similar analyses. However, published workflows may stop working for many reasons; for example due to an update in dependent software or an unexpected change to data it relies on. To keep your workflow usable, you need to maintain it. But this takes valuable cost and time. Therefore, we wanted to help researchers by providing a platform that automatically performs workflow testing.</p>\n\n\n\n<figure class=\"wp-block-image size-large is-resized\"><img decoding=\"async\" loading=\"lazy\" src=\"http://gigasciencejournal.com/blog/wp-content/uploads/2023/03/giad006fig7-1024x417.jpeg\" alt=\"Yevis screenshot\" class=\"wp-image-4839\" width=\"768\" height=\"313\" srcset=\"http://gigasciencejournal.com/blog/wp-content/uploads/2023/03/giad006fig7-1024x417.jpeg 1024w, http://gigasciencejournal.com/blog/wp-content/uploads/2023/03/giad006fig7-300x122.jpeg 300w, http://gigasciencejournal.com/blog/wp-content/uploads/2023/03/giad006fig7-768x313.jpeg 768w, http://gigasciencejournal.com/blog/wp-content/uploads/2023/03/giad006fig7.jpeg 1371w\" sizes=\"(max-width: 768px) 100vw, 768px\" /><figcaption>Screenshot of Yevis-web, a browser-based application showing both published and under-review workflows to help maintainers in organizing the registry.</figcaption></figure>\n\n\n\n<p><br><br><strong>Why should people wanting to share workflows use this platform? What are the advantages for users?</strong><br><br>With Yevis, you can create your own workflow registry. The platform runs using GitHub and Zenodo, so you don&#8217;t need to have your own server. Yevis&#8217;s most significant feature is to help you maintain the uploaded workflows automatically. Once you register your workflow with your test data, the platform takes care of the test execution.<br><br>It would sound great to you if you ever had an experience in that someone told you that your published resources are not working anymore and you need to fix it. And this is absolutely why we started to do this.<br><br><br><strong>Can you tell us what is the backstory on the name “Yevis”?</strong><br><br>Naming a project or software has been the most time-consuming phase in my research. I was always trying to think of a name that is meaningful or full of humor as much as the other popular bioinformatics databases or software. Then one day I realized that this is just a waste of time &#8211; at least for me. I realized that this is something I have to automate to make my life easier. Then I invented a method to name a project, and the name &#8216;Yevis&#8217; came from it. I hope I can publish the method one day. But you may notice something in common with the names of our projects.<br><br><br><strong>What are your future development plans?</strong><br><br>I believe the idea of automated workflow testing is beneficial to many, and our implementation is ready to use. My team is already using it for its own registry and it is working perfectly. However, I see some limitations in testing. For example, if a workflow requires a large volume of test data, it may fail because of the storage limit of GitHub. Designing feasible workflow testing with small datasets may also not be an easy task for users who don&#8217;t usually think about testing, which we want to help with by automation techniques. Therefore, I would like to work on a method to automate the testing phase in workflow development, which saves a lot of time to make researchers more productive. I believe it can also contribute to improving the reproducibility of science.<br></p>\n\n\n\n<figure class=\"wp-block-embed-youtube wp-block-embed is-type-video is-provider-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Tazro Ohta on sharing reusable workflows with Yevis\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/Yr7UUw_lqGE?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p></p>\n\n\n\n<p><em>Workflows have been a long-running area of interest for the journal, and since our launch we have tried to keep on top of the start of the art in this area (e.g. see </em><a href=\"http://gigasciencejournal.com/blog/gigascience-special-session-at-iscb-asia-on-workflows-cloud-for-reproducible-bioinformatics/\"><em>the previous workshops</em></a><em> we have organised on the topic and our </em><a href=\"https://academic.oup.com/gigascience/pages/galaxy_series_data_intensive_reproducible_research\"><em>Galaxy series</em></a><em>). On top of promoting best practice the use of registries like Yevis and </em><a href=\"https://workflowhub.eu/\"><em>workflowhub.eu</em></a><em>, we encourage submissions covering this important area of computational research.</em></p>\n\n\n\n<p><strong>Further Reading</strong><br>Suetake H et al., Workflow sharing with automated metadata validation and test execution to improve the reusability of published workflows, <em>GigaScience</em>, Volume 12, 2023, giad006, <a href=\"https://doi.org/10.1093/gigascience/giad006\">https://doi.org/10.1093/gigascience/giad006</a></p>\n<p>The post <a rel=\"nofollow\" href=\"http://gigasciencejournal.com/blog/yevis-qa-with-tazro-ohta/\">Addressing the challenges of sharing computational workflows with Yevis. Q&#038;A with Tazro Ohta.</a> appeared first on <a rel=\"nofollow\" href=\"http://gigasciencejournal.com/blog\">GigaBlog</a>.</p>\n"},{"id":"http://gigasciencejournal.com/blog/?p=4830","title":"GigaByte now indexed in PubMed and PubMed Central (PMC)","link":"http://gigasciencejournal.com/blog/indexed-in-pubmed/","published":"Tue, 28 Feb 2023 12:10:05 +0000","description":"GigaScience Press is pleased to announce GigaByte journal is now indexed in the NLM PubMed and PubMed Central (PMC) databases. The post GigaByte now indexed in PubMed and PubMed Central (PMC) appeared first...","isPermalink":false,"tags":["Open Access","GigaByte","Indexing","open access","pubmed"],"authors":[{"name":"Scott Edmunds","url":null}],"image":null,"modified":null,"contentHtml":"\n<figure class=\"wp-block-image size-large is-resized\"><img decoding=\"async\" loading=\"lazy\" src=\"http://gigasciencejournal.com/blog/wp-content/uploads/2023/02/1-1024x1024.png\" alt=\"indexed in pubmed\" class=\"wp-image-4831\" width=\"768\" height=\"768\" srcset=\"http://gigasciencejournal.com/blog/wp-content/uploads/2023/02/1-1024x1024.png 1024w, http://gigasciencejournal.com/blog/wp-content/uploads/2023/02/1-300x300.png 300w, http://gigasciencejournal.com/blog/wp-content/uploads/2023/02/1-150x150.png 150w, http://gigasciencejournal.com/blog/wp-content/uploads/2023/02/1-768x768.png 768w, http://gigasciencejournal.com/blog/wp-content/uploads/2023/02/1-1536x1536.png 1536w, http://gigasciencejournal.com/blog/wp-content/uploads/2023/02/1.png 1620w\" sizes=\"(max-width: 768px) 100vw, 768px\" /></figure>\n\n\n\n<p></p>\n\n\n\n<p>GigaScience Press is pleased to announce <em>GigaByte</em> journal is now indexed in PubMed and <a href=\"https://www.ncbi.nlm.nih.gov/pmc/journals/4281/\">PubMed Central (PMC)</a> databases run by the US National Library of Medicine. PubMed being a searchable database of biomedical citations and abstracts, and PMC being a free digital archive of the full-text of Open Access articles. While both increase the discoverability of our published papers, our now automatic inclusion into PMC is also necessary for many researchers to meet their research funders policies and mandates on Open Access. As Open Access advocates, now this has been added to our publication workflow our authors do not need to worry about depositing their publications themselves. We <a href=\"https://clockss.org/clockss-announces-the-support-of-additional-libraries-and-publishers-2/\">use CLOCKSS</a> for the long-term digital preservation of our scholarly content, and archiving in PMC also provides an additional level of protection and survival of preserved digital content.</p>\n\n\n\n<p>PubMed and PMC join googlescholar, <a href=\"https://scholar.cnki.net/home/search?region=db&val=SQHE&resType=Journal\">CNKI</a>, <a href=\"https://jgateplus.com/home/j-gate/\">JGate</a> and the <a href=\"https://doaj.org/toc/2709-4715\">Directory of Open Access Journals (DOAJ)</a> as indexes to discover and browse our content. Our partners at River Valley Technologies have worked hard to produce the highest quality XML for our human and machine readers (see our <a href=\"https://gigabytejournal.com/text-and-data-mining\">text and data mining portal</a>), and this has made the process of indexing easier. PMC, <a href=\"https://doaj.org/toc/2709-4715\">DOAJ</a> and JGate using converted versions of our XML to mirror our Open Access content. The DOAJ awarding us their seal for journals that demonstrate best practice in open access publishing, and CrossRef giving us a near-100% score in their <a href=\"https://www.crossref.org/members/prep/23445\">Participation Reports</a> for the richness of our metadata (only being let down on the funding categories as our <a href=\"https://gigabytejournal.com/open-access-and-apc\">cost-effective APCs</a> and waivers mean we publish quite a lot of number of papers without external funding).</p>\n\n\n\n<p></p>\n\n\n\n<figure class=\"wp-block-image size-large is-resized\"><img decoding=\"async\" loading=\"lazy\" src=\"http://gigasciencejournal.com/blog/wp-content/uploads/2023/02/Screenshot-2023-02-28-at-5.57.33-PM-1024x972.png\" alt=\"indexing in PubMed\" class=\"wp-image-4833\" width=\"768\" height=\"729\" srcset=\"http://gigasciencejournal.com/blog/wp-content/uploads/2023/02/Screenshot-2023-02-28-at-5.57.33-PM-1024x972.png 1024w, http://gigasciencejournal.com/blog/wp-content/uploads/2023/02/Screenshot-2023-02-28-at-5.57.33-PM-300x285.png 300w, http://gigasciencejournal.com/blog/wp-content/uploads/2023/02/Screenshot-2023-02-28-at-5.57.33-PM-768x729.png 768w, http://gigasciencejournal.com/blog/wp-content/uploads/2023/02/Screenshot-2023-02-28-at-5.57.33-PM.png 1342w\" sizes=\"(max-width: 768px) 100vw, 768px\" /></figure>\n\n\n\n<p></p>\n\n\n\n<p>Not only is our XML rich with this metadata, but we’ve been using it to capture <a href=\"http://gigasciencejournal.com/blog/how-to-publish-multilingual-articles/\">multilingual versions of our content</a>, and this also displays in the PMC versions of our papers (see our recent English/Spanish/Ukrainian paper in <em><a href=\"https://doi.org/10.46471/gigabyte.73\">GigaByte</a></em> and <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC9693923/\">PMC</a>). Further increasing the accessibility and global reach of our papers.</p>\n\n\n\n<figure class=\"wp-block-image size-large is-resized\"><img decoding=\"async\" loading=\"lazy\" src=\"http://gigasciencejournal.com/blog/wp-content/uploads/2023/02/Screenshot-2023-02-28-at-5.47.47-PM-1024x704.png\" alt=\"\" class=\"wp-image-4834\" width=\"768\" height=\"528\" srcset=\"http://gigasciencejournal.com/blog/wp-content/uploads/2023/02/Screenshot-2023-02-28-at-5.47.47-PM-1024x704.png 1024w, http://gigasciencejournal.com/blog/wp-content/uploads/2023/02/Screenshot-2023-02-28-at-5.47.47-PM-300x206.png 300w, http://gigasciencejournal.com/blog/wp-content/uploads/2023/02/Screenshot-2023-02-28-at-5.47.47-PM-768x528.png 768w, http://gigasciencejournal.com/blog/wp-content/uploads/2023/02/Screenshot-2023-02-28-at-5.47.47-PM-1536x1056.png 1536w, http://gigasciencejournal.com/blog/wp-content/uploads/2023/02/Screenshot-2023-02-28-at-5.47.47-PM.png 1644w\" sizes=\"(max-width: 768px) 100vw, 768px\" /></figure>\n\n\n\n<p></p>\n\n\n\n<p>Now we have sufficient quantity and quality of publishing data for many other indexes we are continuing the process of submitting to these databases, so watch this space for updates on how that process goes.</p>\n<p>The post <a rel=\"nofollow\" href=\"http://gigasciencejournal.com/blog/indexed-in-pubmed/\">GigaByte now indexed in PubMed and PubMed Central (PMC)</a> appeared first on <a rel=\"nofollow\" href=\"http://gigasciencejournal.com/blog\">GigaBlog</a>.</p>\n"},{"id":"http://gigasciencejournal.com/blog/?p=4786","title":"Plant and Animal Genomes (PAG) Comes Storming Back!","link":"http://gigasciencejournal.com/blog/plant-and-animal-genomes/","published":"Mon, 06 Feb 2023 10:41:16 +0000","description":"After 2 cancellations due to the pandemic, the Plant and Animal Genomes conference returned to its in-person format in January with its 30th edition. A number of the talks focused on the effects of climate...","isPermalink":false,"tags":["Biology","Open Access","animal genomics","conferences","PAG"],"authors":[{"name":"Chris Hunter","url":null}],"image":null,"modified":null,"contentHtml":"\n<figure class=\"wp-block-image size-large is-resized\"><img decoding=\"async\" loading=\"lazy\" src=\"http://gigasciencejournal.com/blog/wp-content/uploads/2023/01/PAG30-showcase_program.png\" alt=\"\" class=\"wp-image-4795\" width=\"546\" height=\"294\" srcset=\"http://gigasciencejournal.com/blog/wp-content/uploads/2023/01/PAG30-showcase_program.png 413w, http://gigasciencejournal.com/blog/wp-content/uploads/2023/01/PAG30-showcase_program-300x162.png 300w\" sizes=\"(max-width: 546px) 100vw, 546px\" /><figcaption>PAG30 flyer</figcaption></figure>\n\n\n\n<p></p>\n\n\n\n<p>After 2 cancellations due to the pandemic, the <a rel=\"noreferrer noopener\" href=\"https://www.intlpag.org/30/\" target=\"_blank\">Plant and Animal Genomes conference</a> returned to its in-person format in January with its 30th edition. A number of the talks focused on the effects of climate change either on biodiversity or crop development. It seems only fitting then, that the weather provided a suitable demonstration with California experiencing one of the longest periods of sustained rainfall in many years. The river running just behind the Town and Country conference centre burst its banks and flooded the surrounding area, including some of the lower level rooms at the <a rel=\"noreferrer noopener\" href=\"http://gigasciencejournal.com/blog/plant-and-animal-genome/\" target=\"_blank\">newly refurbished</a> hotel! Luckily it did not reach the conference center itself so the Plant and Animal Genomes meeting continued as planned.</p>\n\n\n\n<figure class=\"wp-block-image size-large is-resized is-style-default\"><img decoding=\"async\" loading=\"lazy\" src=\"http://gigasciencejournal.com/blog/wp-content/uploads/2023/01/TnC-flooded-carpark-1-1024x576.jpg\" alt=\"Town and Country hotel car park flooded by storm during Plant and Animal Genome conference.\" class=\"wp-image-4796\" width=\"512\" height=\"288\" srcset=\"http://gigasciencejournal.com/blog/wp-content/uploads/2023/01/TnC-flooded-carpark-1-1024x576.jpg 1024w, http://gigasciencejournal.com/blog/wp-content/uploads/2023/01/TnC-flooded-carpark-1-300x169.jpg 300w, http://gigasciencejournal.com/blog/wp-content/uploads/2023/01/TnC-flooded-carpark-1-768x432.jpg 768w, http://gigasciencejournal.com/blog/wp-content/uploads/2023/01/TnC-flooded-carpark-1.jpg 1472w\" sizes=\"(max-width: 512px) 100vw, 512px\" /><figcaption>Town and Country hotel car park flooded by storm during PAG30.</figcaption></figure>\n\n\n\n<p></p>\n\n\n\n<p>Over 3,200 participants from 66 different countries were in attendance, which resulted in a vibrant and exciting conference. Presentations spanned the entire taxonomic scope of life on earth, including some extinct species! A total of 2,351 presentations (including 7 plenary lectures) in over 200 sessions, with as many as 15 concurrent sessions at any one time. As always at PAG, one of the hardest things to do is decide which sessions to attend. Inevitably there are many great talks that one has to miss due to overlaps, so this blog only covers a small fraction of what there was, there were many more things that I was unable to see.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Day 1</h4>\n\n\n\n<p>I started my 4th PAG experience on Friday at the <a rel=\"noreferrer noopener\" href=\"https://vertebrategenomesproject.org/\" target=\"_blank\">Vertebrate Genomes Project</a> (VGP) community workshop hosted by <a rel=\"noreferrer noopener\" href=\"https://www.rockefeller.edu/our-scientists/heads-of-laboratories/1159-erich-d-jarvis/\" target=\"_blank\">Erich Jarvis</a> (Rockefeller University). It featured talks from Erich himself, Guilio Formenti (Rockefeller University), <a rel=\"noreferrer noopener\" href=\"https://twitter.com/benedictpaten\" target=\"_blank\">Benedict Paten</a> (UC Santa Cruz), <a rel=\"noreferrer noopener\" href=\"https://www.embl.org/news/lab-matters/fergal-martin-eukaryotic-annotation-team-leader/\" target=\"_blank\">Fergal Martin</a> (EMBL-EBI), <a rel=\"noreferrer noopener\" href=\"https://begendiv.de/team-member-camila-mazzoni/\" target=\"_blank\">Camila Mazzoni</a> (BeGenDiv), <a rel=\"noreferrer noopener\" href=\"https://www.sanger.ac.uk/person/howe-kerstin/\" target=\"_blank\">Kerstin Howe</a> (Wellcome Sanger- talking about <a href=\"https://doi.org/10.1093/gigascience/giaa153\" target=\"_blank\" rel=\"noreferrer noopener\">genome curation</a>), <a rel=\"noreferrer noopener\" href=\"https://www.unisa.ac.za/sites/corporate/default/Colleges/Agriculture-&-Environmental-Sciences/Schools,-departments,-centres-&-units/School-of-Agriculture-and-Life-Sciences/Department-of-Agriculture-and-Animal-Health/Staff-members/Prof.-NO-Mapholi\" target=\"_blank\">Ntanga Mapholi</a> (University of South Africa), <a rel=\"noreferrer noopener\" href=\"https://www.linkedin.com/in/max-k%C3%A4ller-9144a94/\" target=\"_blank\">Max Kaller</a> (Stanford University), <a rel=\"noreferrer noopener\" href=\"https://physiogn.hms.harvard.edu/church-lab-member/eriona-hysolli\" target=\"_blank\">Eriona Hysolli</a> (Harvard Medical School). The VGP is a sub-project of the <a rel=\"noreferrer noopener\" href=\"https://www.earthbiogenome.org/\" target=\"_blank\">Earth Biogenomes Project</a> (EBP), and a collaboration of a number of slightly smaller projects including but not limited to; <a rel=\"noreferrer noopener\" href=\"https://www.darwintreeoflife.org/\" target=\"_blank\">Darwin Tree of Life</a> (focused on UK species); <a rel=\"noreferrer noopener\" href=\"https://www.erga-biodiversity.eu/\" target=\"_blank\">European Reference Genome Atlas</a> (ERGA &#8211; focused on European species) and <a rel=\"noreferrer noopener\" href=\"https://africanbiogenome.org/\" target=\"_blank\">African Biogenome Project</a> (ABP-focused on African species), all of which provided updates to their projects in the session. Those projects all aim to cover a broader taxonomic scope determined by the geographic location rather than the taxonomy, but all do include vertebrate species.</p>\n\n\n\n<p>Also on Friday was the <a href=\"https://www.agbiodata.org/\" target=\"_blank\" rel=\"noreferrer noopener\">AgBioData</a> workshop, a collaborative group of researchers all dealing with sharing of agricultural data as a common thread. Some of the working groups&#8217; recommendations after surveying the 32 collaborating databases were that they need to:</p>\n\n\n\n<ul><li>Identify solutions to funding issues for data sharing</li><li>Data sharing training for database personnel</li><li>Stakeholder education on the benefits of data sharing</li><li>Focus on improvements to phenotypic data sharing</li><li>Continue working on relevant data standards</li></ul>\n\n\n\n<h4 class=\"wp-block-heading\">Day 2</h4>\n\n\n\n<p>One day down, 4 and a half more to go! Day 2 (Saturday) kicked off at 8am with a bamboozling choice of 15 different workshops to choose from. With 10 more sessions in the second time slot, then lunch, followed by 13 more concurrent workshops, then another 9. Just when you thought the day was done at 6 pm, BAM! one more 2 hour session with a choice of another dozen options! As you may be able to tell, planning is key when attending PAG, you need to know what you want to see and when so that you don&#8217;t spend the entire day looking at the <a rel=\"noreferrer noopener\" href=\"https://plan.core-apps.com/pag_2023/customScreen/aboutShow\" target=\"_blank\">conference app</a> trying to work out where to go next.</p>\n\n\n\n<p>My pre-selected route through the day consisted of <a rel=\"noreferrer noopener\" href=\"https://plan.core-apps.com/pag_2023/event/3cee484866e6d00c5e492240c4d34970\" target=\"_blank\">Bioenergy Grass Biology</a>; <a rel=\"noreferrer noopener\" href=\"https://plan.core-apps.com/pag_2023/event/74e145f2-e4ed-49e8-a509-9da752b17b59\" target=\"_blank\">Microbiome and Plant Health</a>; <a rel=\"noreferrer noopener\" href=\"https://plan.core-apps.com/pag_2023/event/3cee484866e6d00c5e492240c4d38d40\" target=\"_blank\">Single-Cell Genomics</a>; <a rel=\"noreferrer noopener\" href=\"https://plan.core-apps.com/pag_2023/event/3cee484866e6d00c5e492240c4d4383b\" target=\"_blank\">Tripal Database Network</a>; and The <a rel=\"noreferrer noopener\" href=\"https://plan.core-apps.com/pag_2023/event/3cee484866e6d00c5e492240c4d32751\" target=\"_blank\">UCSC genome browser</a> sessions. All excellent choices if I may say so. One highlight from the day for me was <a rel=\"noreferrer noopener\" href=\"https://sites.psu.edu/labcrandallsharifa/\" target=\"_blank\">Sharifa Crandall</a> (Penn State) talking about &#8220;Full Steam ahead- understanding microbiome recovery after steam disinfection&#8221;. Steam disinfection is routinely being used in nursery settings to sterilise the soil before planting, but what effects does it have on the microbiome development? Currently, there is no baseline metagenomics data available on steamed soil microbiome. Unfortunately, this study didn&#8217;t fully address that, as they only performed amplicon microbiome sequence analysis, but noted that the full metagenomics sequencing is required, fingers crossed they carry out that study and publish it in <a href=\"https://academic.oup.com/gigascience/pages/functional_metagenomics_series\">our functional metagenomics series</a>.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Day 3</h4>\n\n\n\n<p>The conference eventually “opened” on the Sunday with the opening reception in the evening in the exhibition hall with drinks, nibbles, posters and the exhibitors. But before we even got to that, there was another full day with a packed agenda to navigate.&nbsp;</p>\n\n\n\n<p>Honey bees are not endemic to the American continent. Over the last two hundred years a relatively small number of seed colonies have been brought in to provide basis of the honey provision in the continent.&nbsp;&nbsp;</p>\n\n\n\n<p>In Canada, honey bees have an estimated annual value of 5.5b dollars, but last year alone there was a 50% loss of colonies over winter in Ontario, ~half of those losses are from unknown causes. With funding from the Canadian Genome Project, <a href=\"https://biology.gradstudies.yorku.ca/faculty/a-zayed/\" target=\"_blank\" rel=\"noreferrer noopener\">Amro Zayed</a> (York Uni, Toronto) presented a project using Biomarkers of stress in honeybees. By comparing the responses to induced stress in controlled experiments on drone bees to identify the causes of those unknowns. There is evidence that there is a distinct pattern in response determined by the type of stress. Further studies are required to find more and better biomarkers to fine-tune the tool for commercial use for early identification, which it is hoped could lead to appropriate interventions to save colonies in the future.</p>\n\n\n\n<figure class=\"wp-block-image size-large is-resized\"><img decoding=\"async\" loading=\"lazy\" src=\"http://gigasciencejournal.com/blog/wp-content/uploads/2023/01/Beekeeper_Tending_to_Bees-1024x683.jpg\" alt=\"A Beekeeper in protective equipment tending to bees in an apiary. Author: U.S. Department of Agriculture.  License: Public Domain\" class=\"wp-image-4798\" width=\"512\" height=\"342\" srcset=\"http://gigasciencejournal.com/blog/wp-content/uploads/2023/01/Beekeeper_Tending_to_Bees-1024x683.jpg 1024w, http://gigasciencejournal.com/blog/wp-content/uploads/2023/01/Beekeeper_Tending_to_Bees-300x200.jpg 300w, http://gigasciencejournal.com/blog/wp-content/uploads/2023/01/Beekeeper_Tending_to_Bees-768x512.jpg 768w, http://gigasciencejournal.com/blog/wp-content/uploads/2023/01/Beekeeper_Tending_to_Bees-1536x1024.jpg 1536w, http://gigasciencejournal.com/blog/wp-content/uploads/2023/01/Beekeeper_Tending_to_Bees-2048x1366.jpg 2048w\" sizes=\"(max-width: 512px) 100vw, 512px\" /><figcaption>A Beekeeper in protective equipment tending to bees in an apiary at Wynn Farm in North Salem, Aug. 2, 2021.  (NRCS photo by Brandon O&#8217;Connor. <em>License</em>: Public Domain)</figcaption></figure>\n\n\n\n<p></p>\n\n\n\n<p>Also on the Sunday afternoon, there was a hands-on workshop all about the new <a rel=\"noreferrer noopener\" href=\"https://jbrowse.org/jb2/\" target=\"_blank\">JBrowse2</a> genome browser. They introduced a plethora of new features as well as the ability for users to write their own plug-ins. I rounded out the day in the Big Data session, dramatically sub-titled “<a rel=\"noreferrer noopener\" href=\"https://plan.core-apps.com/pag_2023/event/3cee484866e6d00c5e492240c4d5637f\" target=\"_blank\">Manage your data before your data kills you</a>”! Where <a rel=\"noreferrer noopener\" href=\"https://profiles.arizona.edu/person/fionamcc\" target=\"_blank\">Fiona McCarthy</a> (University of Arizona) gave an impassioned presentation outlining eight things <strong>not </strong>to do (when dealing with Big Data). Anyone who deals with data on a daily basis will be familiar with most of these, but I&#8217;ll summarise them here anyway:</p>\n\n\n\n<ol><li>Treat your data unequally.  Why do some researchers think that their own Data Management Plan (DMP) only applies to certain parts of their project? For example; sequence data yes, but the analysis results, no. Data is data, and it all deserves to be treated equally.</li><li>The “file.unicorn” problem. Using the incorrect or inappropriate file formats and/or file extensions causes everyone (including your future self) a headache when trying to decipher them. </li><li>Think that context is less important than data &#8211; Actually, most data is pretty useless without its metadata, so include all the relevant metadata WITH the data. This can often be seen in the SRA with sequence data completely devoid of sample metadata! </li><li>Short-term hires for long-term solutions.  Don&#8217;t get the grad student to deal with the data that will outlive them, when they’re gone you’ll have no idea where the data is.</li><li>One more thing before I finish&#8230;  Don&#8217;t put off the data submission until the very end! No one is going to steal it, but if you&#8217;re worried then just set an embargo on the release.</li><li>Its complicated. Well try using file names with a suitable convention that is EASY to understand and meaningful, and include a README file so that your future self can remember the convention.</li><li>It&#8217;s not the destination, it&#8217;s the journey. The &#8220;how&#8221; you arrived at your results is important, so include software versions, parameters and all the input filenames in your methods.</li><li>Keep your Data Management Plan (DMP) a secret. The PI writes the DMP, but no one else in the team ever sees it, so the grad student doing the data management doesn&#8217;t follow the plan because they don&#8217;t know it!</li></ol>\n\n\n\n<h4 class=\"wp-block-heading\">Day 4</h4>\n\n\n\n<p>For me, the highlight of the Monday talks was saved until the end, with the <a href=\"https://plan.core-apps.com/pag_2023/event/3cee484866e6d00c5e492240c4d4ee3a\" target=\"_blank\" rel=\"noreferrer noopener\">Genomics and Biodiversity</a> session hosted by <a href=\"https://research-repository.uwa.edu.au/en/persons/parwinder-kaur\" target=\"_blank\" rel=\"noreferrer noopener\">Parwinder Kaur</a> (University of Western Australia). It started off with a whirlwind presentation of the entire history of HiC and its applications for understanding chromosome structures across the entire tree of life, I think <a href=\"https://www.bcm.edu/people-search/erez-lieberman-aiden-25411\" target=\"_blank\" rel=\"noreferrer noopener\">Erez Lieberman-Aiden</a> (Baylor College) managed to successfully cram two hours&#8217; worth of lectures into 20 minutes! Starting with “Noahs Ark a Critique” which was apt given the levels of rainfall seen in San Diego recently, right through to the use of Hi-C in the <a href=\"https://www.dnazoo.org/\" target=\"_blank\" rel=\"noreferrer noopener\">DNA Zoo</a> project where they are creating reference genome assemblies for as many species as possible as quickly as possible.</p>\n\n\n\n<p>The pace barely slowed for the rest of the session with 5 more great talks covering; GeneBanks and the cost of sequencing thousands of lines of a single species; ancient DNA assembly, how HiC improved the Mammoth genome to a chromosomal scaffold; the differences between Black and White swan genomes; finding symbiont genomes within single species datasets; examining the genomes in largest Genus of trees; and ending with the session chair talking about the West Australian genome atlas. The aim of which is to sequence every native species dead or alive.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Day 5</h4>\n\n\n\n<p>Two plenary speakers started the day on Tuesday; <a href=\"https://researchers.uq.edu.au/researcher/79\" target=\"_blank\" rel=\"noreferrer noopener\">Ian Godwin</a> (University of Queensland) “New breeding technologies to deliver better sorghums: What could possibly go wrong?”, and <a href=\"https://english.tau.ac.il/profile/viviane\" target=\"_blank\" rel=\"noreferrer noopener\">Viviane Slon</a> (Tel Aviv University) “Digging for DNA”. Ians&#8217; opening gambit was you can&#8217;t have a good title without a colon, which set the tone of his talk with a great deal of humour. Unfortunately, this did mean I slightly lost the details of the content, but the general idea was that they can now produce sorghums with more protein content or more oil, or larger grain sizes etc, but that field trials of the product as a feed led to some unexpected results.&nbsp;</p>\n\n\n\n<p>Dr Viviane Slon gave a fascinating talk showing how recent advances in sequencing technology have enabled the ability to sequence ancient hominid DNA from sediment, even in places where there is no visual evidence of hominid remains. For example, a typical excavation of a prehistoric site will generally have lots of tools and animal bones, but rarely do the hominid remains appear in those digs, but the sediment in those digs might hold the key&#8230; maybe you can identify hominid DNA from the sediment? Using extreme precautions to avoid modern-day human DNA contamination they took sediment samples from archeological sites known to contain hominid remains to see if they could find evidence of them in the sediment. Using an amplicon approach looking for mtDNA worked, but how to be sure it was ancient and not recent DNA? The observation that ancient DNA has changes of cytosine to uracil at the ends of fragments provided the means to distinguish between ancient and modern DNA sequences.</p>\n\n\n\n<p>The application of this technique could massively increase the knowledge of both hominids and other ancient species if applied to a wide range of sampling sites, watch this space!</p>\n\n\n\n<p>The <a rel=\"noreferrer noopener\" href=\"https://plan.core-apps.com/pag_2023/event/3cee484866e6d00c5e492240c4d2aaf8\" target=\"_blank\">Bioinformatics</a> session featured several GigaScience Press authors including the session chair <a rel=\"noreferrer noopener\" href=\"http://ccb.jhu.edu/people/alekseyz/\" target=\"_blank\">Aleksey Zimin</a> (Johns Hopkins University) and speakers Benedict Paten and <a rel=\"noreferrer noopener\" href=\"https://www.hgsc.bcm.edu/people/sedlazeck-f\" target=\"_blank\">Fritz Sedlazeck</a> (Baylor College), as well as Katie Jenike ( of the <a rel=\"noreferrer noopener\" href=\"https://schatz-lab.org/people/\" target=\"_blank\">Schatz lab</a>). Katie presented the tool <a rel=\"noreferrer noopener\" href=\"https://github.com/kjenike/panagram\" target=\"_blank\">PANAGRAM</a> , which is an interactive, alignment-free pangenome browser, i.e. it can visualise the alignments across multiple closely related genomes both at the global scale and in detail at the gene level. Everything is pre-computed so the end product is very fast and can run on a small local desktop or laptop. Fasta plus annotation files are used as input. They are processed to identify Kmer mappings which can then be quickly mapped onto the genome in the browser using a tabix index.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Day 6</h4>\n\n\n\n<p>The final day of PAG30 was opened by another friend of <em>GigaScience</em>, <a rel=\"noreferrer noopener\" href=\"https://biology.ucsd.edu/research/faculty/oryder\" target=\"_blank\">Oliver Ryder</a> (San Diego Zoo Institute for Conservation Research). His plenary entitled “Emerging options for conserving biodiversity” highlighted a number of success stories in conservation that have already benefited from genome sequencing efforts. It also brings hope to other efforts by shedding light on the presence of genetic diversity in remaining populations or even in cryobanks such as the <a rel=\"noreferrer noopener\" href=\"https://science.sandiegozoo.org/resources/frozen-zoo%C2%AE\" target=\"_blank\">FrozenZoo.</a>&nbsp;</p>\n\n\n\n<p>Many of the topics touched on during Dr Ryders&#8217; keynote were followed up in the session <a href=\"https://plan.core-apps.com/pag_2023/event/3cee484866e6d00c5e492240c4d0fb84\" target=\"_blank\" rel=\"noreferrer noopener\">Wildlife Genomics</a> later that day, including the work presented by <a href=\"https://science.sandiegozoo.org/marisa-korody-phd\" target=\"_blank\" rel=\"noreferrer noopener\">Marisa Korody</a> (San Diego Zoo Wildlife Alliance) on the efforts to bring the Northern White Rhino back from the brink of extinction.&nbsp;</p>\n\n\n\n<p>The <a rel=\"noreferrer noopener\" href=\"https://plan.core-apps.com/pag_2023/event/3cee484866e6d00c5e492240c4d2e0b9\" target=\"_blank\">International Rice Informatics Consortium</a> (IRIC) was the last session I attended. It was chaired by another friend of GigaScience <a rel=\"noreferrer noopener\" href=\"https://www.irri.org/about-us/our-people/kenneth-mcnally\" target=\"_blank\">Ken McNally</a> (IRIC). Speakers brought the audience up to speed with the tools and data being made available, including a tantalising glimpse of the soon to be released version 2 of the Rice <a rel=\"noreferrer noopener\" href=\"https://snp-seek.irri.org/\" target=\"_blank\">SNPSeek</a> platform which already includes <a href=\"https://doi.org/10.1093/gigascience/giz028\">Rice Galaxy</a>, and will also have JBrowse2 integration among other features.</p>\n\n\n\n<p>The final day as always ended with a chance for everyone to let their hair down and party the night away on the dancefloor, see for example the <a href=\"https://twitter.com/bluessherpa/status/1615951141682155521/photo/1\" target=\"_blank\" rel=\"noreferrer noopener\">tweet</a> by fellow PAG goer <a href=\"https://twitter.com/bluessherpa\" target=\"_blank\" rel=\"noreferrer noopener\">@bluesherpa</a>. It never disappoints seeing normally reserved senior scientists showing off their dance moves from yesteryear along with the younger rising stars of the field.&nbsp;</p>\n\n\n\n<figure class=\"wp-block-embed-twitter wp-block-embed is-type-rich is-provider-twitter\"><div class=\"wp-block-embed__wrapper\">\n<blockquote class=\"twitter-tweet\" data-width=\"500\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">After a two year hiatus, the world’s plant and animal genomic brain trust is once again gettin jiggy with it! <a href=\"https://twitter.com/hashtag/PAG30?src=hash&ref_src=twsrc%5Etfw\">#PAG30</a> <a href=\"https://t.co/vt7dwffhOh\">pic.twitter.com/vt7dwffhOh</a></p>&mdash; John Fellers (@bluessherpa) <a href=\"https://twitter.com/bluessherpa/status/1615951141682155521?ref_src=twsrc%5Etfw\">January 19, 2023</a></blockquote><script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n</div></figure>\n\n\n\n<p></p>\n<p>The post <a rel=\"nofollow\" href=\"http://gigasciencejournal.com/blog/plant-and-animal-genomes/\">Plant and Animal Genomes (PAG) Comes Storming Back!</a> appeared first on <a rel=\"nofollow\" href=\"http://gigasciencejournal.com/blog\">GigaBlog</a>.</p>\n"},{"id":"http://gigasciencejournal.com/blog/?p=4743","title":"Cell Biology in Washington DC: GigaScience at ASCB/EMBO Cell Bio 2022","link":"http://gigasciencejournal.com/blog/cell-biology-2022/","published":"Sun, 29 Jan 2023 03:07:30 +0000","description":"Write-up of the American Society for Cell Biology (ASCB) and European Molecular Biology Organization (EMBO) 2022 Meeting The post Cell Biology in Washington DC: GigaScience at ASCB/EMBO Cell Bio 2022 appeared...","isPermalink":false,"tags":["Biology","cell biology","citizen science","conferences","imaging"],"authors":[{"name":"Chris Armit","url":null}],"image":null,"modified":null,"contentHtml":"\n<figure class=\"wp-block-image size-large is-resized\"><img decoding=\"async\" loading=\"lazy\" src=\"http://gigasciencejournal.com/blog/wp-content/uploads/2023/01/cellbio2022-1024x576.png\" alt=\"American Society for Cell Biology (ASCB) and European Molecular Biology Organization (EMBO) Meeting 2022\" class=\"wp-image-4752\" width=\"512\" height=\"288\" srcset=\"http://gigasciencejournal.com/blog/wp-content/uploads/2023/01/cellbio2022-1024x576.png 1024w, http://gigasciencejournal.com/blog/wp-content/uploads/2023/01/cellbio2022-300x169.png 300w, http://gigasciencejournal.com/blog/wp-content/uploads/2023/01/cellbio2022-768x432.png 768w, http://gigasciencejournal.com/blog/wp-content/uploads/2023/01/cellbio2022.png 1356w\" sizes=\"(max-width: 512px) 100vw, 512px\" /></figure>\n\n\n\n<p></p>\n\n\n\n<p>The Washington DC Walter E. Washington Convention Center was the venue for the recent <a href=\"https://www.ascb.org/cellbio2022/\" target=\"_blank\" rel=\"noreferrer noopener\">Cell Bio 2022 Meeting</a> that took place on 3-7 December 2022.&nbsp; Cell Bio 2022, the joint meeting of the American Society for Cell Biology (ASCB) and European Molecular Biology Organization (EMBO), is the largest yearly gathering for the Cell Biology community. <em>GigaScience</em> Data Scientist Chris Armit is a regular attendee of this event (see <a href=\"http://gigasciencejournal.com/blog/gigascience-at-ascbembo-2019-meeting-washington-dc/\" target=\"_blank\" rel=\"noreferrer noopener\">2019</a> and <a href=\"http://gigasciencejournal.com/blog/cell-biology-2020/\" target=\"_blank\" rel=\"noreferrer noopener\">2020</a> write-ups) and reports on the impact of Cell Biology research in expanding our understanding of living systems.</p>\n\n\n\n<p></p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>The Challenge of Proteomics in Living Cells</strong></h4>\n\n\n\n<p></p>\n\n\n\n<p>In a Keynote talk entitled “<em>Chemogenetic and optogenetic technologies for probing molecular and cellular networks</em>”, <a rel=\"noreferrer noopener\" href=\"http://www.tinglab.org/\" target=\"_blank\">Alice Ting</a> (Stanford University) highlighted the use of proximity labelling for the study of endogenous proteins and RNA in living cells with high spatial and temporal accuracy. A focus of this work is the study of endogenous untagged proteins that is scalable to entire proteomes. Towards this end, Alice and colleagues have developed various “spray painting” methods that utilise enzymes to tag proteins with biotin labels in the neighbourhood of specific organelles.&nbsp;</p>\n\n\n\n<figure class=\"wp-block-embed-youtube wp-block-embed is-type-video is-provider-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Alice Ting ASCB keynote 2022\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/HjVBFifZIvQ?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen></iframe>\n</div><figcaption><em>Keynote lecture by <a href=\"http://www.tinglab.org/resources\" target=\"_blank\" rel=\"noreferrer noopener\">Alice Ting at ASCB/EMBO Cell Bio 2022</a></em>.</figcaption></figure>\n\n\n\n<p></p>\n\n\n\n<p>Proximity labeling was followed by mass spectrometry to identify the biotinylated tagged proteins. Alice was swift to point out that the reducing environment of the cytosol did represent a challenge for proximate-dependent tagging. For example, the reducing environment is problematic for horseradish peroxidase, which is a frequently used enzyme for fixed samples.</p>\n\n\n\n<p>The enzyme ascorbate peroxidase is far superior for living cells, but as with horseradish peroxidase this enzyme still requires hydrogen peroxide as a substrate, which is notoriously toxic for cells. Alice and colleagues are currently exploring the utility of laccase, which is an enzyme that uses oxygen rather than hydrogen peroxide as a substrate, and is potentially non-toxic. As Alice explains in her Keynote talk, one of the key advantages of laccase is that “it has the potential to be much more <em>in vivo</em> compatible”.</p>\n\n\n\n<p></p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Mini-guts as a model of Symmetry Breaking</strong></h4>\n\n\n\n<p></p>\n\n\n\n<p>EMBO Gold Medal 2022 winner <a rel=\"noreferrer noopener\" href=\"https://liberalilab.org/\" target=\"_blank\">Prisca Liberali</a> (Friedrich Miescher Institute for Biomedical Research, Basel, Switzerland) gave a talk entitled “<em>Decoding the design principles of tissue organisation</em>”. Prisca explained that tissues are not constructed machines, but are built up from short and long range interactions. Using intestinal organoids as a model system – or as Prisca refers to them ‘mini-guts’ – an imaging approach was used for feature extraction and the ability to explore the changing geometry of specific enterocyte cells in each and every organoid.</p>\n\n\n\n<figure class=\"wp-block-embed-youtube wp-block-embed is-type-video is-provider-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Seeing is believing: Meet Prisca Liberali\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/iS2kQyU_kZY?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen></iframe>\n</div><figcaption><em>Seeing is believing: Meet Prisca Liberali who explains how self-organisation is key to understanding the development of complex tissues, such as the intestine</em>.</figcaption></figure>\n\n\n\n<p></p>\n\n\n\n<p>The derivation of organoid lines is, in itself, intriguing. Single cell isolation using FACS is used to isolate Lgr5 positive cells. Lgr5 is a known stem cell marker of the intestine, and the Lgr5 positive cell is the ancestor of all cell types in the intestine. Lgr5 positive cells are then seeded to matrigel cultures in 96-well plates, and the enterocysts that develop share some of the hallmarks of the intestine <em>in vivo</em>,<em> </em>including a constellation of different cell types with distinct geometry.</p>\n\n\n\n<h5 class=\"wp-block-heading\">Mini-gut self-organisation of a stem cell niche</h5>\n\n\n\n<p>Interestingly, Lgr5 expression is lost early during organoid development, but returns as the organoid enterocyst begins to differentiate. This is interpreted as the cultured mini-guts activating a regenerative response. The mechanism of symmetry breaking &#8211; whereby distinct cell types differentiate from a uniform population of cells &#8211; is partially understood, and it is known that the Hippo pathway activates Yap1 as a sensor of cellular states. Specifically, Yap1 triggers activation of Notch/Delta lateral inhibition, with the Yap1 positive cell also expressing Dll1 (Delta). </p>\n\n\n\n<p>Symmetry breaking occurs at the 16-32 cell stage, at which point Lgr5 positive cells are also appearing in the organoid enterocyst. Consequently, the creation of the Lgr5 positive stem cell niche is a regenerative response that can be explored in intestinal organoid culture. This technology may offer invaluable insights for understanding tissue injury and repair.</p>\n\n\n\n<p>For more on Organoids and Organogenesis, see our recent Blog of <a href=\"http://gigasciencejournal.com/blog/vizbi-2022/\" target=\"_blank\" rel=\"noreferrer noopener\">VIZBI 2022</a>.</p>\n\n\n\n<p></p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Making waves: Scaling up hexagonal arrays in Zebrafish</strong></h4>\n\n\n\n<p></p>\n\n\n\n<p>Continuing the focus on the importance of short and long range interactions, <a rel=\"noreferrer noopener\" href=\"https://sites.duke.edu/ditalialab/73-2/\" target=\"_blank\">Maya Evanitsky</a> (Di Talia lab, Duke University) gave an interesting talk on zebrafish scale development. Zebrafish scales are made of calcified matrix and are highly organised in a hexagonal array. So how can cellular signalling accomplish such a feat? There are certain mutant strains of zebrafish &#8211; such as the <em>Ectodysplasin</em> mutant &#8211; that have no scales, and this is a clue to understanding how scale formation is coordinated.</p>\n\n\n\n<figure class=\"wp-block-image size-large is-resized\"><img decoding=\"async\" loading=\"lazy\" src=\"http://gigasciencejournal.com/blog/wp-content/uploads/2023/01/fish1_scale1_3dpp_merged-1024x454.jpg\" alt=\"Cell Biology image of NF-κB signalling through the integument of the zebrafish embryo\" class=\"wp-image-4776\" width=\"512\" height=\"227\" srcset=\"http://gigasciencejournal.com/blog/wp-content/uploads/2023/01/fish1_scale1_3dpp_merged-1024x454.jpg 1024w, http://gigasciencejournal.com/blog/wp-content/uploads/2023/01/fish1_scale1_3dpp_merged-300x133.jpg 300w, http://gigasciencejournal.com/blog/wp-content/uploads/2023/01/fish1_scale1_3dpp_merged-768x341.jpg 768w, http://gigasciencejournal.com/blog/wp-content/uploads/2023/01/fish1_scale1_3dpp_merged-1536x681.jpg 1536w, http://gigasciencejournal.com/blog/wp-content/uploads/2023/01/fish1_scale1_3dpp_merged-2048x908.jpg 2048w\" sizes=\"(max-width: 512px) 100vw, 512px\" /><figcaption>NF-κB signalling propagates as a travelling wave through the integument of the zebrafish embryo. NF-κB-GFP reporter is shown in cyan, and a scale marker is shown in magenta. Image courtesy of Maya Evanitsky and used with permission.</figcaption></figure>\n\n\n\n<p></p>\n\n\n\n<p>Ectodysplasin protein<em> </em>signals through the NF-κB pathway and induces nuclear translocation of the transcription factor NF-κB. Through use of videomicroscopy, Maya showed that NF-κB signalling is propagated as a travelling wave through a primordial population of osteoblast-like scale-forming cells.</p>\n\n\n\n<p>Interestingly, cuts in scale tissue block propagation of this wave, and create a delay in scale growth. As Maya explains, through wave initiation and wave propagation, NF-κB signalling regulates scale patterning through a positive feedback loop.</p>\n\n\n\n<figure class=\"wp-block-image size-large is-resized\"><img decoding=\"async\" loading=\"lazy\" src=\"http://gigasciencejournal.com/blog/wp-content/uploads/2023/01/Nfkb_Wave_Cartoon.png\" alt=\"Cell Biology diagram of NF-κB wave initiation and wave propagation in zebrafish scale formation\" class=\"wp-image-4777\" width=\"357\" height=\"331\" srcset=\"http://gigasciencejournal.com/blog/wp-content/uploads/2023/01/Nfkb_Wave_Cartoon.png 356w, http://gigasciencejournal.com/blog/wp-content/uploads/2023/01/Nfkb_Wave_Cartoon-300x278.png 300w\" sizes=\"(max-width: 357px) 100vw, 357px\" /><figcaption>Diagram of NF-κB wave initiation and wave propagation in zebrafish scale formation. Image courtesy of Maya Evanitsky and used with permission.</figcaption></figure>\n\n\n\n<p></p>\n\n\n\n<p>For more on zebrafish embryogenesis, see Life Unfolding inside the Cell in our recent Blog of <a rel=\"noreferrer noopener\" href=\"http://gigasciencejournal.com/blog/vizbi-2022/\" target=\"_blank\">VIZBI 2022</a>.</p>\n\n\n\n<p></p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Nature’s Toughest Bug: Radioresistance in the Tardigrade</strong></h4>\n\n\n\n<p></p>\n\n\n\n<p>Ionising radiation is directly genotoxic and causes single strand and double strand DNA breaks. In addition, ionising radiation generates reactive oxygen species that create apurinic / apyrimidinic sites in DNA that require Base Excision Repair (BER). </p>\n\n\n\n<p>The tardigrade is an eight-legged, segmented micro-animal that has the extraordinary ability to withstand what for other animals are lethal doses of ionising radiation. <a href=\"https://goldsteinlab.weebly.com/courtney-clark-hachtel.html\" target=\"_blank\" rel=\"noreferrer noopener\">Courtney Clark-Hachtel</a> (UNC Chapel Hill) gave a fascinating talk on the secrets of radiation resistance in this tiny creature, and highlighted that a 100 Gray dose of ionising radiation does not affect reproduction and survival in nature’s toughest bug.</p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https://lh6.googleusercontent.com/iij03YRmA-GGV9W0wpDJFu0TxGi_tKbqYnKNwjdCrsD6Ajbeqc1yYSUDUAQCOxllSwbUY9Um5F7qylRVwhPKojyUiDTu6Y5aA_sQuKQ0mXHJcWQNIOwwuekHxaGvJ1cEifDa-ihQ1eGPjlVAi62XPUlk6Rkag5vJwZwm1UAwS6h9inAwmrwfVUcVNMc0qA\" alt=\"Radiation Resistance in the Tardigrade\"/><figcaption><em>The tardigrade can survive what is a lethal dose of radiation for other animal species. Image Source: </em><a href=\"https://commons.wikimedia.org/wiki/File:Adult_tardigrade.jpg\"><em>https://commons.wikimedia.org/wiki/File:Adult_tardigrade.jpg</em></a> <br><em>Attribution: Goldstein lab &#8211; tardigrades, CC BY-SA 2.0, via Wikimedia Commons</em></figcaption></figure>\n\n\n\n<p></p>\n\n\n\n<p>Through use of TUNEL labelling, which is more commonly used as a method to detect double strand breaks in apoptotic cells, Courtney was able to demonstrate that tardigrades do show extensive DNA damage in the form of double strand DNA breaks immediately following ionising radiation insult, but that these are repaired swiftly. </p>\n\n\n\n<p>Through use of RNA-seq, Courtney further demonstrated that the tardigrade showed a robust transcriptional stress response with an incredible >250-fold upregulation in DNA repair pathway genes following genotoxic insult. To provide some necessary context, in mammals a 4-8-fold upregulation in DNA repair pathway genes is what a researcher would normally observe.</p>\n\n\n\n<h5 class=\"wp-block-heading\">The critical role of DNA repair in surviving radiation damage</h5>\n\n\n\n<p>To further investigate the role of individual DNA repair pathway genes, Courtney used RNAi to knockdown candidate genes, and to explore the effect on survival to ionising radiation insult. In this way, Courtney was able to demonstrate that the double strand DNA repair pathway gene <em>Ku80</em> was critical for the survival of tardigrades in response to radiation damage.</p>\n\n\n\n<p>What I find especially puzzling about the tardigrade is its very short lifespan. Courtney highlighted that these micro-animals only live to about 3 months, and I do wonder whether there is an evolutionary trade-off between a super-charged DNA damage response and longevity. Whether there are longer-term detrimental effects to physiology in radiation-resistant micro-animals is a question that remains unanswered.</p>\n\n\n\n<p>For more on Evolutionary Genomics, see our Blog on <a rel=\"noreferrer noopener\" href=\"http://gigasciencejournal.com/blog/biodiversity-genomics-2021/\" target=\"_blank\">Biodiversity Genomics 2021</a>.</p>\n\n\n\n<p></p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Combating Neurodegenerative Disease and Genome instability in Cancer</strong></h4>\n\n\n\n<p></p>\n\n\n\n<h5 class=\"wp-block-heading\">“&#8230;<em>it turns out that cells of the nervous system hadn’t read the textbooks</em>” &#8211; Don Cleveland</h5>\n\n\n\n<p></p>\n\n\n\n<p><a rel=\"noreferrer noopener\" href=\"https://cmm.ucsd.edu/research/labs/don-cleveland/index.html\" target=\"_blank\">Don Cleveland</a> (Ludwig Institute, University of California, San Diego) delivered the E.B. Wilson Medal Lecture entitled “<em>From Tau to evolution of genome instability in cancer</em>”. It is the 45th anniversary of the discovery of Tau, which causes neurofibrillary tangles associated with Alzheimer’s Disease. Misfolded Tau protein is also observed in Chronic Traumatic Encephalopathy, which is linked to repeated head injuries and is an additional cause of dementia.</p>\n\n\n\n<p>Don highlighted the controversy surrounding early attempts to deliver DNA into the nervous system as treatments for neurodegenerative disease. The consensus at the time was that this was impossible, and Don quips that “<em>it turns out that cells of the nervous system hadn’t read the textbooks</em>”. </p>\n\n\n\n<p>In a pioneering study, Don and colleagues used gene silencing as a treatment for Amyotrophic Lateral Sclerosis (ALS), a neurodegenerative disease that leads to loss of muscle control. The strategy was to use catalytic mRNA degradation and altered RNA splicing polyadenylation to regulate transcriptional levels of disease-associated genes. Don highlighted that his treatment had 3-4 months efficacy. </p>\n\n\n\n<p>Similar gene silencing approaches were used for Spinal Muscular Atrophy through targeting <em>SMN2</em> splicing, and Parkinson’s Disease via lowering of levels of <em>SNCA,<em> </em></em>which encodes the presynaptic neuronal protein α-Synuclein linked to Parkinson&#8217;s disease.</p>\n\n\n\n<h5 class=\"wp-block-heading\">Understanding aneuploidy</h5>\n\n\n\n<figure class=\"wp-block-embed-youtube wp-block-embed is-type-video is-provider-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"CSHL Keynote; Dr. Don Cleveland, University of California, San Diego\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/nnctQOgAy2Q?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen></iframe>\n</div><figcaption><em>Don Cleveland on the story of chromothripsis and its role in human cancer</em>.</figcaption></figure>\n\n\n\n<p></p>\n\n\n\n<p>On the subject of genome instability, Don additionally focused on chromothripsis, which is the shattering of chromosomes leading to aneuploidy and large-scale chromosomal rearrangement. </p>\n\n\n\n<p>In experimental chromothripsis, centromere inactivation induces micronucleation and chromosome shattering, and this leads to intra- and inter-chromosomal rearrangements but also circularised extrachromosomal DNA (ecDNA). I was intrigued to find out that chromothripsis drives ecDNA formation in methotrexate resistance, and that the ecDNA evolves through continuing chromothripsis. This means that, over time, ecDNA becomes massively rearranged.</p>\n\n\n\n<p>In an effort to suppress gene amplification – a phenomenon often observed in human cancer &#8211; Don questions whether we can target chromothripsis and ecDNA evolution. Towards this end, Don highlighted the dominant role of the endonuclease N4BP2 in chromothripsis. N4BP2 has 5&#8242;-polynucleotide kinase and nicking endonuclease activity, and induces DNA damage in ruptured micronuclei. In addition, the absence of N4BP2 strongly inhibits fragmentation of a micronucleated Y chromosome. This is an excellent candidate gene for augmenting genome instability in cancer.</p>\n\n\n\n<p></p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Open Data and Tools in Education</strong></h4>\n\n\n\n<p>At GigaScience Press we see immense value in Citizen Science (see recent Blog on the <a href=\"http://gigasciencejournal.com/blog/publishing-mosquito-alert-data/\" target=\"_blank\" rel=\"noreferrer noopener\">fight against mosquito borne disease</a>), and the “<em>Open Data and Tools in Education</em>” Workshop as presented by the Allen Institute was of immense interest. As panelist <a href=\"https://alleninstitute.org/about/team/staff-profiles/kaitlyn-casimo/\" target=\"_blank\" rel=\"noreferrer noopener\">Kaitlyn Casimo</a>, who leads the Allen Institute education program explained, the Allen Institute for Brain Science is “<em>developing a parts list</em>” of cell types in the brain. Panelist <a href=\"https://alleninstitute.org/what-we-do/cell-science/about/team/staff-profiles/gideon-dunster/\" target=\"_blank\" rel=\"noreferrer noopener\">Gideon Dunster</a> additionally highlighted that a focus of the Allen Institute for Cell Science is “<em>recognising patterns in large-scale complex data</em>”.</p>\n\n\n\n<p>As an important Cell Biology resource, the Allen Institute has made a library of <a rel=\"noreferrer noopener\" href=\"https://alleninstitute.org/what-we-do/cell-science/news-press/articles/interior-design-our-cells\" target=\"_blank\">3D images of 200,000 cells</a> publicly available. In addition, educators have used Allen Institute online image analysis tools to ask questions such as ‘<em>What happens when cell division goes wrong?</em>’ by inviting school students to add and subtract cell structures to study their relationships during specific cell divisions.</p>\n\n\n\n<p></p>\n\n\n\n<h5 class=\"wp-block-heading\">Gaming interface for Citizen Scientists</h5>\n\n\n\n<p>For budding Neuroscientists, <a href=\"https://www.mozak.science/landing\" target=\"_blank\" rel=\"noreferrer noopener\">Mozak Brainbuillder</a> uses a gaming interface to allow school students to annotate very large neuronal images. This tool can be used in the classroom to help understand neuron diversity ‘<em>beyond the textbook</em>’ through generation of 3D reconstructions from open-source data.</p>\n\n\n\n<figure class=\"wp-block-embed-youtube wp-block-embed is-type-video is-provider-youtube wp-embed-aspect-4-3 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Welcome to Mozak: Brainbuilder (beta)\" width=\"500\" height=\"375\" src=\"https://www.youtube.com/embed/92uDJu6-9-A?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen></iframe>\n</div><figcaption><em>Mozak is a scientific discovery game developed by The Center for Game Science at the University of Washington and the Allen Institute for Brain Science that harnesses Citizen Science to trace neurons in open-source image data</em></figcaption></figure>\n\n\n\n<p></p>\n\n\n\n<p>Of key importance here is familiarising school-level students with real-life data. Illinois high school teacher <a rel=\"noreferrer noopener\" href=\"http://studentdnabarcoding.org/featured-participants/perspectives/teacher-spotlight.html\" target=\"_blank\">Tom Martinez</a> &#8211; who was one of the panelists &#8211; highlighted how these online tools are of immense benefit to his students through “<em>correcting misconceptions with cell-specific imagery</em>”. As Tom further explained, “<em>the imagery is different from what they’re used to from textbooks</em>”. </p>\n\n\n\n<p>Tom has the impressive career achievement of successfully campaigning for a cell culture lab in his school, where students from the age of 13 are educated in cell culture technology. Tom’s is the only school in Illinois with this facility, and this is a pioneering approach for inspiring future Cell Biologists.&nbsp;</p>\n\n\n\n<p>For more on Citizen Science, see our <a rel=\"noreferrer noopener\" href=\"http://gigasciencejournal.com/blog/tag/citizen-science/\" target=\"_blank\">GigaBlog series</a>.  <em>GigaScience</em> is also <a href=\"https://academic.oup.com/gigascience/pages/gigascience-highlights-3d-imaging\">highlighting studies</a> taking imaging into the 3rd Dimension</p>\n\n\n\n<p><a href=\"https://www.ascb.org/cellbio2023/\">ASCB/EMBO Cell Bio</a><a href=\"https://www.ascb.org/cellbio2023/\" rel=\"noreferrer noopener\" target=\"_blank\"> </a><a href=\"https://www.ascb.org/cellbio2023/\">2023</a> is scheduled for December 2-6, 2023, in Boston, MA.</p>\n<p>The post <a rel=\"nofollow\" href=\"http://gigasciencejournal.com/blog/cell-biology-2022/\">Cell Biology in Washington DC: GigaScience at ASCB/EMBO Cell Bio 2022</a> appeared first on <a rel=\"nofollow\" href=\"http://gigasciencejournal.com/blog\">GigaBlog</a>.</p>\n"},{"id":"http://gigasciencejournal.com/blog/?p=4726","title":"1,600 plant extracts reveal their secrets","link":"http://gigasciencejournal.com/blog/1600-plant-extracts/","published":"Wed, 18 Jan 2023 15:14:07 +0000","description":"A GigaScience Data Note presents a searchable library of spectra and molecules found in a collection of 1,600 plant extracts. The post 1,600 plant extracts reveal their secrets appeared first on GigaBlog.","isPermalink":false,"tags":["Medicine","Uncategorized","biochemistry","database","drug development"],"authors":[{"name":"Hans Zauner","url":null}],"image":null,"modified":null,"contentHtml":"\n<p><strong>Plants are full of biochemical potential. Today in <em>GigaScience, </em>we publish an article that presents a searchable library of spectra and molecules found in a collection of 1,600 plant extracts. This open resource will be useful for research ranging from drug discovery to the large-scale exploration of plants&#8217; chemical diversity</strong> <strong>(Read and share the article <a href=\"https://doi.org/10.1093/gigascience/giac124\">here</a> and the press release<a href=\"https://www.eurekalert.org/news-releases/976904\"> here</a>)</strong>.</p>\n\n\n\n<p>Plant metabolites can have potent biological activities.  For example, the anti-malarial artemisinin or the anti-cancer drug taxol have both been discovered as natural products. Sometimes, a plant compound is also the starting point for a research & development process, and the drug that comes out in the end is derived from raw material that was provided by nature. </p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter size-large is-resized\"><img decoding=\"async\" loading=\"lazy\" src=\"http://gigasciencejournal.com/blog/wp-content/uploads/2023/01/plant.jpg\" alt=\"\" class=\"wp-image-4733\" width=\"536\" height=\"460\" srcset=\"http://gigasciencejournal.com/blog/wp-content/uploads/2023/01/plant.jpg 922w, http://gigasciencejournal.com/blog/wp-content/uploads/2023/01/plant-300x257.jpg 300w, http://gigasciencejournal.com/blog/wp-content/uploads/2023/01/plant-768x657.jpg 768w\" sizes=\"(max-width: 536px) 100vw, 536px\" /></figure></div>\n\n\n\n<h3 class=\"wp-block-heading\">                                                                                   One of the largest collections of plant extracts in the world</h3>\n\n\n\n<p>With the potential of plant metabolites in mind, Pierre Fabre Laboratories, a French pharmaceutical and cosmetics company, constituted a collection of botanical samples over the years 1995 to 2015.  This collection is one of the largest private plant libraries in the world. It contains over 17,000 unique samples, including some rare species and covering a diverse range of botanical families. Since 2015, Pierre Fabre Laboratories have opened access to their private plant samples collection for interested partners.</p>\n\n\n\n<p><a href=\"https://doi.org/10.1093/gigascience/giac124\">The new study published in<em> GigaScience</em></a><em> </em>reports the chemical characterization of around 10% of the plant extracts in the Pierre Fabre Laboratories collection. This is an important step towards making the chemical diversity of the full collection accessible to researchers around the world. </p>\n\n\n\n<h3 class=\"wp-block-heading\">Open data</h3>\n\n\n\n<p>The researchers at the University of Geneva used high-resolution mass spectrometry combined with advanced computational pipelines to acquire over two million spectra and associated chemical information. The data are now publicly available (The mass spectrometry profiles and associated metadata  through the <a href=\"https://massive.ucsd.edu/ProteoSAFe/static/massive.jsp\">MassIVE repository</a>, accession number MSV000087728; supporting data are also available via the <a href=\"http://dx.doi.org/10.5524/102323\">GigaScience database GigaDB</a>).</p>\n\n\n\n<h3 class=\"wp-block-heading\">An exceptional resource</h3>\n\n\n\n<p>The Data Note provides demonstrations on how to query this extensive curated resource and shares both the resulting data and the employed methods. In summary, this is an exceptional resource for advancing the field of large-scale chemodiversity digitization and also an example of a fruitful partnership between academia and industry.</p>\n\n\n\n<p></p>\n\n\n\n<p><strong>Read the GigaScience article:</strong></p>\n\n\n\n<p>Pierre-Marie Allard, Arnaud Gaudry, Luis-Manuel Quirós-Guerrero, Adriano Rutz, Miwa Dounoue-Kubo, Tom W N Walker, Emmanuel Defossez, Christophe Long, Antonio Grondin, Bruno David, Jean-Luc Wolfender <strong>Open and reusable annotated mass spectrometry dataset of a chemodiverse collection of 1,600 plant extracts</strong>,&nbsp;<em>GigaScience</em> 2023 giac124,&nbsp;<a href=\"https://doi.org/10.1093/gigascience/giac124\">https://doi.org/10.1093/gigascience/giac124</a></p>\n\n\n\n<p><strong>Read and share the  Press Release:</strong></p>\n\n\n\n<p><a href=\"https://www.eurekalert.org/news-releases/976904\">https://www.eurekalert.org/news-releases/976904</a></p>\n\n\n\n<p><strong>Supporting data in GigaDB:</strong></p>\n\n\n\n<p><a href=\"http://dx.doi.org/10.5524/102323\">http://dx.doi.org/10.5524/102323</a></p>\n\n\n\n<p></p>\n\n\n\n<p></p>\n<p>The post <a rel=\"nofollow\" href=\"http://gigasciencejournal.com/blog/1600-plant-extracts/\">1,600 plant extracts reveal their secrets</a> appeared first on <a rel=\"nofollow\" href=\"http://gigasciencejournal.com/blog\">GigaBlog</a>.</p>\n"},{"id":"http://gigasciencejournal.com/blog/?p=4676","title":"Celebrating and innovating: This was 2022 at GigaScience Press","link":"http://gigasciencejournal.com/blog/gigascience-2022/","published":"Tue, 20 Dec 2022 09:13:59 +0000","description":"It was a year to remember, for more than one reason: 2022 marked the 10th anniversary of GigaScience&#8216;s launch. The journal&#8217;s younger sibling GigaByte got an award and continued to innovate with...","isPermalink":false,"tags":["Open Access","FAIR","open science","publishing"],"authors":[{"name":"Hans Zauner","url":null}],"image":null,"modified":null,"contentHtml":"\n<p><strong>It was a year to remember, for more than one reason: 2022 marked the 10th anniversary of <em>GigaScience</em>&#8216;s launch. The journal&#8217;s younger sibling <em>GigaByte</em> got an award and continued to innovate with living documents and its first trilingual article. And we published lots of memorable research,  featuring, for example, a giant tortoise and 26 deadly snakes. Before some of the editorial team take a short break to celebrate Christmas and New Year, let&#8217;s have a look back.</strong></p>\n\n\n\n<p> To mark the occasion of our two-digit birthday, we threw <a href=\"http://gigasciencejournal.com/blog/birthday-at-ismb2022/\">a <em>GigaScience</em> party at the ISMB meeting</a> &#8211; no, not via Zoom this time.  Finally, after the long COVID disruption, we could celebrate in a real-world pub, sharing panda-themed birthday cake and drinks with conference participants in Madison.</p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter size-large is-resized\"><img decoding=\"async\" loading=\"lazy\" src=\"http://gigasciencejournal.com/blog/wp-content/uploads/2022/07/IMG_5964-1024x768.jpeg\" alt=\"GigaScience birthday party\" class=\"wp-image-4508\" width=\"512\" height=\"384\" srcset=\"http://gigasciencejournal.com/blog/wp-content/uploads/2022/07/IMG_5964-1024x768.jpeg 1024w, http://gigasciencejournal.com/blog/wp-content/uploads/2022/07/IMG_5964-300x225.jpeg 300w, http://gigasciencejournal.com/blog/wp-content/uploads/2022/07/IMG_5964-768x576.jpeg 768w, http://gigasciencejournal.com/blog/wp-content/uploads/2022/07/IMG_5964-1536x1152.jpeg 1536w, http://gigasciencejournal.com/blog/wp-content/uploads/2022/07/IMG_5964-2048x1536.jpeg 2048w\" sizes=\"(max-width: 512px) 100vw, 512px\" /></figure></div>\n\n\n\n<p>                                                                                                                                             </p>\n\n\n\n<p>                                                                                                                                     The milestone birthday was also an opportunity to look back at what we have achieved in our first ten years, and we wrote that up in the form of an <a href=\"https://academic.oup.com/gigascience/article/doi/10.1093/gigascience/giac067/6619296\">editorial</a>.  To briefly recap, during our first decade of publishing we step by step pushed for ever more open science and open data.  We created our own data repository GigaDB, managed by a team of curators and integrated in the publication process. We embraced the FAIR principles, promoted preprints and implemented mandatory open peer review. Together with other platforms, we  experimented with various tool integrations. </p>\n\n\n\n<h3 class=\"wp-block-heading\"><em>GigaByte </em>pushed boundaries and got an award</h3>\n\n\n\n<p>With <em>GigaScience</em>&#8216;s data-centric sister <em>GigaByte</em>, and together with our partner RiverValley Technologies, we are taking this even further. Articles can now be &#8220;<a href=\"https://www.youtube.com/watch?v=ltlZ4HdJ1qY\">living documents</a>&#8220;, we introduced &#8220;update&#8221; articles, a simplified review process using check lists, and recently even published a <a href=\"http://gigasciencejournal.com/blog/how-to-publish-multilingual-articles/\">trilingual article</a>: readers can easily switch between English, Spanish and Ukrainian versions.</p>\n\n\n\n<p> Our efforts to innovate have been noted in the publishing world. In October, <a href=\"https://rivervalley.io/gigabyte-wins-the-alpsp-scholarly-publishing-innovation-award-using-river-valleys-publishing-technology/\"><em>GigaByte</em> and RiverValley received the ALPSP Innovation in Publishing Award</a>, recognizing our efforts to push the boundaries in academic publishing. </p>\n\n\n\n<figure class=\"wp-block-image size-large is-resized\"><img decoding=\"async\" loading=\"lazy\" src=\"http://gigasciencejournal.com/blog/wp-content/uploads/2022/09/00F6AA4B-9383-482B-AC8D-DE3F178EC9F4-1024x762.jpeg\" alt=\"GigaByte and GigaScience Press received an award\" class=\"wp-image-4571\" width=\"512\" height=\"381\" srcset=\"http://gigasciencejournal.com/blog/wp-content/uploads/2022/09/00F6AA4B-9383-482B-AC8D-DE3F178EC9F4-1024x762.jpeg 1024w, http://gigasciencejournal.com/blog/wp-content/uploads/2022/09/00F6AA4B-9383-482B-AC8D-DE3F178EC9F4-300x223.jpeg 300w, http://gigasciencejournal.com/blog/wp-content/uploads/2022/09/00F6AA4B-9383-482B-AC8D-DE3F178EC9F4-768x571.jpeg 768w, http://gigasciencejournal.com/blog/wp-content/uploads/2022/09/00F6AA4B-9383-482B-AC8D-DE3F178EC9F4.jpeg 1218w\" sizes=\"(max-width: 512px) 100vw, 512px\" /></figure>\n\n\n\n<p>                                                                                                                                                    </p>\n\n\n\n<p>                                                                                                                                 Almost 10 years after <em>GigaScience</em> was launched, UNESCO in 2022 published its <a href=\"https://en.unesco.org/science-sustainable-future/open-science/recommendation\">Open Science Recommendations</a>  to <em>“foster a culture of Open Science and aligning incentives for Open Science</em>”. This is a significant document, because it shows that Open Science practices &#8211; advocated by <em>GigaScience</em> over the last decade &#8211; are finally becoming the mainstream expectation of how research should be done all over the world. </p>\n\n\n\n<h3 class=\"wp-block-heading\">Commentaries on a decade of progress</h3>\n\n\n\n<p>As a birthday gift to <em>GigaScience</em> readers, we also invited a series of commentaries, taking a look back a decade of progress in large-scale research. Open Science has gained momentum &#8211; as evidenced by the UNESCO recommendations &#8211; and the commentaries reflect what has been achieved and what lies ahead in the future of various fields. Topics cover, for example, <a href=\"https://academic.oup.com/gigascience/article/doi/10.1093/gigascience/giac055/6608501\">conservation genetics</a>, open and FAIR efforts in <a href=\"https://academic.oup.com/gigascience/article/doi/10.1093/gigascience/giac060/6608500\">neuroinformatics</a>, or the challenges of &nbsp;<a href=\"https://academic.oup.com/gigascience/article/doi/10.1093/gigascience/giac056/6608502\">computational pathology</a>.</p>\n\n\n\n<p>Our data curation team (Chris Armit, Mary Ann Tuli, Christ Hunter) also contributed to this celebratory series. They report a<a href=\"https://academic.oup.com/gigascience/article/doi/10.1093/gigascience/giac053/6608504\"> consistent growth of our GigaDB ressource in terms of data volume, data discoverability and data re-use</a> and discuss the role of Data Curation in enhancing the user experience.  </p>\n\n\n\n<p> We handed the collection of commentaries out in the form of a glamorous one-off print issue, but of course the entire <a href=\"https://academic.oup.com/gigascience/pages/a-decade-of-gigascience?login=false\">series is available online and open-access</a>, like all our content.</p>\n\n\n\n<p>One of the main reasons why data should be open is to give other researchers the opportunity to re-use the information for new projects, often in completely different and surprising contexts. The<a href=\"https://researchparasite.com/\"> “Research Parasite Awards”</a> (jokingly named after a controversial editorial in a medical journal)  recognize scientist who make outstanding contributions by using existing datasets. We were very happy to learn this year that the <a href=\"http://gigasciencejournal.com/blog/vectors-of-data-awards/\">Junior Parasite Award went to Jack Pilgrim</a> at Liverpool University for his work published in&nbsp;<em>GigaScience</em>&nbsp;(read the&nbsp;<a href=\"https://doi.org/10.1093/gigascience/giab021\">paper</a>&nbsp;and&nbsp;<a href=\"http://gigasciencejournal.com/blog/rickettsia-bacteria-to-rule-them-all/\">blog</a>).</p>\n\n\n\n<h3 class=\"wp-block-heading\"><em>GigaByte</em> mobilized more than 500,000 biodiversity records</h3>\n\n\n\n<p>Another highlight of the past year was a series of <a href=\"https://gigabytejournal.com/articles/series/GIGABYTE_SERIES_0002\">Data Release papers on vectors of human disease</a>, published in <em>GigaByte</em> in collaboration with the Global Biodiversity Information Facility (<a href=\"https://www.gbif.org/\">GBIF</a>). This series of papers was supported the<em> Special Programme for Research and Training in Tropical Diseases</em>, hosted at the World Health Organization.</p>\n\n\n\n<p>Vector-borne diseases are responsible for more than 17% of human cases of infectious diseases, but&#8230;</p>\n\n\n\n<p><em>&#8221;&nbsp;&#8230; huge gaps exist in the information related to these vectors, creating an essential need for campaigns to mobilise and share data. </em></p>\n\n\n\n<p><em>The publication of data papers is an effective tool for overcoming this challenge. These peer-reviewed articles provide scholarly credit for researchers whose vital work of assembling and publishing well-described, properly-formatted datasets often fails to receive appropriate recognition.&#8221;</em> (see <a href=\"https://doi.org/10.1093/gigascience/giac114\">this article</a> to read on)</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" loading=\"lazy\" width=\"700\" height=\"402\" src=\"http://gigasciencejournal.com/blog/wp-content/uploads/2022/11/giac114fig1.jpeg\" alt=\"second call and umbrella image\" class=\"wp-image-4659\" srcset=\"http://gigasciencejournal.com/blog/wp-content/uploads/2022/11/giac114fig1.jpeg 700w, http://gigasciencejournal.com/blog/wp-content/uploads/2022/11/giac114fig1-300x172.jpeg 300w\" sizes=\"(max-width: 700px) 100vw, 700px\" /></figure>\n\n\n\n<p></p>\n\n\n\n<p>                                                                                                                                      The first set of <em>GigaByte</em> papers in this article collection mobilized more than 500,000 occurrence records, and 675,000 specimens from more than 50 countries.<strong><a href=\"http://gigasciencejournal.com/blog/second-call-vector-papers/\"> The series now goes into a second round, read the announcement here.</a></strong></p>\n\n\n\n<p>No summary of the year is complete without highlighting at least some of the  science we published in 2021.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Highlights of <em>GigaScience</em> 2022: Giant tortoise, deadly snakes et al.</h3>\n\n\n\n<p>Recently, Gözde Çilingir and colleagues published a high-quality, <a href=\"https://doi.org/10.1093/gigascience/giac090\">chromosome scale genome sequence of the Aldabra giant tortoise</a>. The Aldabra is one of only two giant tortoise species left in the world. Conservation efforts are underway,  and high-quality genomic and genetic information will improve the chance of long-term success of these efforts. Watch the first author explaining her research, in the presence of a rather stoic live Aldabra tortoise.</p>\n\n\n\n<figure class=\"wp-block-embed-youtube wp-block-embed is-type-video is-provider-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Gözde Çilingir on the Aldabra giant tortoise genome\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/Hak1xO-H8bM?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>Similarly, also the new <a href=\"https://doi.org/10.1093/gigascience/giac025\">genomic resources for the helmeted honeyeater</a>, a highly  endangered bird, will be crucial for genetic rescue efforts. Also the first author of this <em>GigaScience</em> paper, Diana Robledo-Ruiz, has produced an explainer video that you should not miss:</p>\n\n\n\n<figure class=\"wp-block-embed-youtube wp-block-embed is-type-video is-provider-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Diana Robledo-Ruiz on the HeHo genome\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/s0hXv85snEY?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p>And with this blog post turning into a science video watch party under the Christmas tree, here&#8217;s another special one. Czech scientists Jozef Kaiser and Marketa Tesarova used X-ray computed microtomography to produce stunning<a href=\"https://doi.org/10.1093/gigascience/giac030\"> 3D reconstructions of the soft tissue in the head of the proteus</a>, a cave dwelling blind salamander. Enjoy live footage of the proteus, 3D reconstructions of soft tissue, and soothing music: </p>\n\n\n\n<figure class=\"wp-block-embed-youtube wp-block-embed is-type-video is-provider-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Visualizing a sightless world: 3D Imaging of the Proteus reveals adaptation for life in the dark\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/OJYafv5lzSk?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n</div></figure>\n\n\n\n<p></p>\n\n\n\n<p>On a less soothing note, just this week the Center for Antibody Technologies headed by Professor Andreas Laustsen-Kiel presented <a href=\"https://doi.org/10.1093/gigascience/giac121\">proteomic and functional data on the venoms of 26 deadly African snakes</a>, including fearded species such as the green and black mambas. Whereas previous studies examined usually only one or a handful of species, this new <em>GigaScience </em>work relied on a a high-throughput pipeline to produce the largest largest proteomics dataset on snake venoms so far.</p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter size-large is-resized\"><img decoding=\"async\" loading=\"lazy\" src=\"http://gigasciencejournal.com/blog/wp-content/uploads/2022/12/Mamba.jpg\" alt=\"green mamba\" class=\"wp-image-4679\" width=\"525\" height=\"359\" srcset=\"http://gigasciencejournal.com/blog/wp-content/uploads/2022/12/Mamba.jpg 700w, http://gigasciencejournal.com/blog/wp-content/uploads/2022/12/Mamba-300x205.jpg 300w\" sizes=\"(max-width: 525px) 100vw, 525px\" /><figcaption>green mamba. photo credit: H. Krisp wikimedia, CC-BY </figcaption></figure></div>\n\n\n\n<h2 class=\"wp-block-heading\">The machines are coming</h2>\n\n\n\n<p>One area that is gaining more and more prominence in our inbox for new submissions is Machine Learning in all its shapes and forms &#8211; unsurprisingly. As an example how Machine Learning methodology is conquering all areas of biology, <em>GigaScience</em> this year published research aimed at profiling the &nbsp;capabilities of&nbsp; <a href=\"https://doi.org/10.1093/gigascience/giac046\">Machine Learning models in an immunology context</a> &#8211; specifically, to analyse the adaptive immune receptor repertoire.</p>\n\n\n\n<p>With the growing volume of machine learning papers we also continued to sharpen our criteria for this article type. Our goal is to focus on Machine Learning work that follows best practice in terms of reproducibility and transparency; this of course means sharing data and code and being transparent about all methodological aspects. In addition to the <a href=\"https://www.go-fair.org/fair-principles/\">FAIR principles</a>, which are always on our mind when assessing new submissions, we also increasingly have an eye on recommendations that are specific for the machine learning domain, such as the <a href=\"https://dome-ml.org/guidelines\">DOME-ML guidelines</a>.</p>\n\n\n\n<p><em>Gigascience</em> and <em>GigaByte</em> are journals with a specific expertise in transparent and open data publishing, and we are excited to see which new applications the Machine Learning community will find for the data presented in our journals. The speed of progres in this field is breathtaking, and as I finish this blog post I start to wonder if next year I will still have to do this end-of-year job in a traditional way, sitting at a keyboard with three cups of coffee and a plate of christmas cookies. Or if an AI will draft this yearly summary in a fraction of the time, and without the need to supply copious amounts of sugar and caffeine. In science and also in science publishing the AI revolution has begun &#8211; with effects good and bad.  </p>\n\n\n\n<p><strong>We thank our readers and authors for their continued interest in <em>GigaScience</em> and <em>GigaByte</em>, and most of all our reviewers and editorial board members for their tremendous support during our 10th year.</strong></p>\n\n\n\n<p><strong>Merry Christmas , happy holidays, and happy new year! </strong></p>\n\n\n\n<figure class=\"wp-block-image size-large is-resized\"><img decoding=\"async\" loading=\"lazy\" src=\"http://gigasciencejournal.com/blog/wp-content/uploads/2022/12/Unbenannt.jpg\" alt=\"tortoise with Santa hat.\" class=\"wp-image-4716\" width=\"461\" height=\"455\" srcset=\"http://gigasciencejournal.com/blog/wp-content/uploads/2022/12/Unbenannt.jpg 922w, http://gigasciencejournal.com/blog/wp-content/uploads/2022/12/Unbenannt-300x296.jpg 300w, http://gigasciencejournal.com/blog/wp-content/uploads/2022/12/Unbenannt-768x758.jpg 768w\" sizes=\"(max-width: 461px) 100vw, 461px\" /></figure>\n\n\n\n<p> </p>\n<p>The post <a rel=\"nofollow\" href=\"http://gigasciencejournal.com/blog/gigascience-2022/\">Celebrating and innovating: This was 2022 at GigaScience Press</a> appeared first on <a rel=\"nofollow\" href=\"http://gigasciencejournal.com/blog\">GigaBlog</a>.</p>\n"},{"id":"http://gigasciencejournal.com/blog/?p=4674","title":"What’s your poison? Venom composition of 26 deadly snakes","link":"http://gigasciencejournal.com/blog/snake-venom/","published":"Wed, 14 Dec 2022 13:46:58 +0000","description":"The Center for Antibody Technologies headed by Professor Andreas Laustsen-Kiel (Technical University of Denmark) used high-throughput methods to systematically analyze the venoms of the 26 most deadly snakes...","isPermalink":false,"tags":["Biology","Developing World","Medicine","proteomics","snakes"],"authors":[{"name":"Hans Zauner","url":null}],"image":null,"modified":null,"contentHtml":"\n<p><strong>The Center for Antibody Technologies headed by Professor Andreas Laustsen-Kiel (Technical University of Denmark) used high-throughput methods to systematically analyze the venoms of the 26 most deadly snakes in sub-Saharan Africa. The results are now <a href=\"https://doi.org/10.1093/gigascience/giac121\">published in <em>Gigascience</em></a>.</strong></p>\n\n\n\n<p>Each year, around 500,000 people in sub-Saharan Africa suffer from snake bites, causing an estimated 7,000 to 20,000 deaths. Many snake species native to the region, such as the feared black mamba, are classified as species of the highest medical importance by the World Health Organization. Using systematic approaches and state of-the-art methods to better understand the composition and function of these snakes’ venoms is a medical priority (see also <a href=\"https://doi.org/10.1093/gigascience/giac024\">this recent Review Article</a> in <em>Gigascience</em>, focusing on the role of genomics in this effort, and <a href=\"https://doi.org/10.1093/gigascience/giac048\">this article</a> for a general  perspective on modern venomics).</p>\n\n\n\n<h4 class=\"wp-block-heading\">Proteomics of 26 deadly African snakes </h4>\n\n\n\n<p>The snakes investigated in the new proteomic and functional study belong to two families, elapids – including, among others, the black and green mambas and the ring-necked spitting cobra, also called the rinkhals – and vipers such as the Puff adder and the Gaboon viper. </p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter size-large\"><img decoding=\"async\" loading=\"lazy\" width=\"700\" height=\"479\" src=\"http://gigasciencejournal.com/blog/wp-content/uploads/2022/12/Mamba.jpg\" alt=\"\" class=\"wp-image-4679\" srcset=\"http://gigasciencejournal.com/blog/wp-content/uploads/2022/12/Mamba.jpg 700w, http://gigasciencejournal.com/blog/wp-content/uploads/2022/12/Mamba-300x205.jpg 300w\" sizes=\"(max-width: 700px) 100vw, 700px\" /><figcaption>The green mamba. photo: <a href=\"https://commons.wikimedia.org/wiki/File:Mamba_Dendroaspis_angusticeps.jpg\">Holger Krisp, CC-BY</a> </figcaption></figure></div>\n\n\n\n<p></p>\n\n\n\n<p>The composition and function of snake venoms is complex and varies a lot from species to species. </p>\n\n\n\n<p> The authors describe a general pattern with elapid venoms containing large amounts of a class of proteins called “three finger toxins”, which act by blocking neuronal transmission or by killing cells; as well as phospholipases A<sub>2</sub> (PLA<sub>2</sub>s), a class of enzymes that is found in many animal venoms. The viper venoms, on the other hand, are dominated by a different protein mix, including PLA<sub>2</sub>s, but also substantial quantities of other enzymes such as Snake Venom Metalloproteinases and Snake Venom Serine Proteinases.</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" loading=\"lazy\" width=\"642\" height=\"463\" src=\"http://gigasciencejournal.com/blog/wp-content/uploads/2022/12/Fig1_SnakeVenomics.jpg\" alt=\"\" class=\"wp-image-4680\" srcset=\"http://gigasciencejournal.com/blog/wp-content/uploads/2022/12/Fig1_SnakeVenomics.jpg 642w, http://gigasciencejournal.com/blog/wp-content/uploads/2022/12/Fig1_SnakeVenomics-300x216.jpg 300w\" sizes=\"(max-width: 642px) 100vw, 642px\" /><figcaption>Venom composition differs substantially between elapids and vipers. Fig. from<a href=\"https://doi.org/10.1093/gigascience/giac121\"> Nguyen et al.</a></figcaption></figure>\n\n\n\n<p></p>\n\n\n\n<p>                                                                                                                               Venom compositions of most of these snakes have been described before, but the venoms of two species – of Anchieta’s cobra (<em>Naja anchietae</em>) and of the white-bellied carpet viper (<em>Echis leucogaster</em>) – are characterized for the first time in the new <em>GigaScience</em> study. </p>\n\n\n\n<h4 class=\"wp-block-heading\">An integrate approach to understand venom composition and function</h4>\n\n\n\n<p>The major advance of the work, however, is the parallel processing of samples from 26 snakes in the same high-throughput pipeline; combined with a range of experimental approaches to functionally characterize many venoms in parallel, in a standardized setting. In contrast, previous studies on the venom compositions of snakes from sub-Sahara Africa have typically been performed in separate studies with only one or a handful of species each, and often with little or no data on functional aspects. The previous studies also used variable protocols, making it difficult to reconcile and compare data from different origins.</p>\n\n\n\n<p>The new integrated approach demonstrated in the <em>Gigascience</em> article, including 26 snake species and a range of functional assays, provides a solid foundation for further studies of snake biology and the development of new antivenoms.</p>\n\n\n\n<p><strong>Read the GigaScience article:</strong></p>\n\n\n\n<p>Nguyen GTT; O&#8217;Brien C; Wouters Y; Seneci L; Gallissa-Calzado A; Campos-Pinto I; Ahmadi S; Laustsen AH; Ljungars A  <strong>High-throughput proteomics and in vitro functional characterization of the 26 medically most important elapids and vipers from sub-Saharan Africa</strong>. GigaScience  2022. <a href=\"https://doi.org/10.1093/gigascience/giac121\">https://doi.org/10.1093/gigascience/giac121</a></p>\n\n\n\n<p>Supporting data in GigaDB: <a href=\"http://dx.doi.org/10.5524/102333\">http://dx.doi.org/10.5524/102333</a></p>\n\n\n\n<p><strong>Read related posts on GigaBlog:</strong></p>\n\n\n\n<figure class=\"wp-block-embed-wordpress wp-block-embed is-type-wp-embed is-provider-gigablog\"><div class=\"wp-block-embed__wrapper\">\n<blockquote class=\"wp-embedded-content\" data-secret=\"11AHQiudUG\"><a href=\"http://gigasciencejournal.com/blog/cone-snail-genome-sheds-light-on-venom-evolution/\">Cone snail genome sheds light on venom evolution</a></blockquote><iframe class=\"wp-embedded-content\" sandbox=\"allow-scripts\" security=\"restricted\" title=\"&#8220;Cone snail genome sheds light on venom evolution&#8221; &#8212; GigaBlog\" src=\"http://gigasciencejournal.com/blog/cone-snail-genome-sheds-light-on-venom-evolution/embed/#?secret=11AHQiudUG\" data-secret=\"11AHQiudUG\" width=\"500\" height=\"282\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\"></iframe>\n</div></figure>\n\n\n\n<figure class=\"wp-block-embed-wordpress wp-block-embed is-type-wp-embed is-provider-gigablog\"><div class=\"wp-block-embed__wrapper\">\n<blockquote class=\"wp-embedded-content\" data-secret=\"ytahVwLug6\"><a href=\"http://gigasciencejournal.com/blog/jellyfish-genomes/\">Genomic Warning Flag Just in Time for Beach Season: Jellyfish Toxins</a></blockquote><iframe class=\"wp-embedded-content\" sandbox=\"allow-scripts\" security=\"restricted\" title=\"&#8220;Genomic Warning Flag Just in Time for Beach Season: Jellyfish Toxins&#8221; &#8212; GigaBlog\" src=\"http://gigasciencejournal.com/blog/jellyfish-genomes/embed/#?secret=ytahVwLug6\" data-secret=\"ytahVwLug6\" width=\"500\" height=\"282\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\"></iframe>\n</div></figure>\n<p>The post <a rel=\"nofollow\" href=\"http://gigasciencejournal.com/blog/snake-venom/\">What&#8217;s your poison? Venom composition of 26 deadly snakes</a> appeared first on <a rel=\"nofollow\" href=\"http://gigasciencejournal.com/blog\">GigaBlog</a>.</p>\n"}]}