{"version":"https://jsonfeed.org/version/1.1","id":"gr1by89","title":"Samuel Moore","description":"publishing, technology, commons","homePageUrl":"https://www.samuelmoore.org/","feedUrl":"https://www.samuelmoore.org/feed/","favicon":"https://www.samuelmoore.org/wp-content/uploads/2019/02/cropped-cropped-cropped-roAorange-icon-2-32x32.png","items":[{"id":"https://www.samuelmoore.org/?p=1357","title":"The curious internal logic of open access policymaking","link":"https://www.samuelmoore.org/2023/01/12/the-curious-internal-logic-of-open-access-policymaking/","published":"Thu, 12 Jan 2023 12:10:47 +0000","description":"This week, the White House Office of Science and Technology Policy (OSTP) declared 2023 its &#8216;Year of Open Science&#8216;, announcing &#8216;new grant funding, improvements in research infrastructure,...","isPermalink":false,"tags":["Open access"],"authors":[{"name":"samoore_","url":null}],"image":null,"modified":null,"contentHtml":"\n<p>This week, the White House Office of Science and Technology Policy (OSTP) declared 2023 its &#8216;<a href=\"https://www.whitehouse.gov/ostp/news-updates/2023/01/11/fact-sheet-biden-harris-administration-announces-new-actions-to-advance-open-and-equitable-research/\">Year of Open Science</a>&#8216;, announcing &#8216;new grant funding, improvements in research infrastructure, broadened research participation for emerging scholars, and expanded opportunities for public engagement&#8217;. This announcement builds on the OSTP&#8217;s <a href=\"https://www.whitehouse.gov/ostp/news-updates/2022/08/25/ostp-issues-guidance-to-make-federally-funded-research-freely-available-without-delay/\">open access policy announcement </a>last year that will require immediate open access to federally-funded research from 2025. Given the state of the academic publishing market, and the tendency for US institutions to look towards market-based solutions, such a policy change will result in more article-processing charge payments and, most likely, publishing agreements between libraries and academic publishers (as I have <a href=\"https://unlockingresearch-blog.lib.cam.ac.uk/?p=3271\">written about elsewhere</a>). The OSTP&#8217;s policy interventions will therefore hasten the marketisation of open access publishing by further cementing the business models of large commercial publishers &#8212; having similar effects to the policy initiatives of European funders. </p>\n\n\n\n<p>As the US becomes more centralised and maximalist in its approach to open access policymaking, European institutions are taking a leaf out of the North American book by <a href=\"https://blogs.lse.ac.uk/impactofsocialsciences/2022/10/26/reviewing-the-rights-retention-strategy-a-pathway-to-wider-open-access/\">implementing rights retention policies</a> &#8212; of the kind implemented by Harvard in 2008 and adopted widely in North America thereafter. If 2023 will be the &#8216;year of open science&#8217; in the USA, it will surely be the year of rights retention in Europe. This is largely in response to funders now refusing to pay APCs for hybrid journals &#8212; a form of profiteering initially permitted by many funders who now realise the errors of their ways. With APC payments prohibited, researchers need rights retention to continue publishing in hybrid journals while meeting their funder requirements. </p>\n\n\n\n<p>There is a curious internal logic here: the USA following the market-making of Europe, while Europe locking horns with the market and adopting US-style rights retention policies. Maybe this means that we&#8217;re heading towards a stable middle ground between the models of these two separate (but equally neoliberal) approaches, or maybe one of the hegemonic blocs is further along the road that both are travelling (not to mention the impact these shifts and market impacts have on Global South countries, or simply those outside Europe and North America).</p>\n\n\n\n<p>Clearly I&#8217;m being too binary and eliding a great deal of complexity in this very short post, but it struck me that there is a curious internal logic at work here. The push for open access has forced a shift in the business models of academic publishers, but this very same shift causes more of the profiteering that open access was responding to in the first place. Policymakers dance back and forth trying to make open access workable for researchers and affordable for universities, but neither of these aims will be possible to achieve while researchers are required to publish in journals owned by a publishing industry more answerable to shareholders than research communities.  </p>\n\n\n\n<p></p>\n\n\n\n<p></p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.samuelmoore.org/2023/01/12/the-curious-internal-logic-of-open-access-policymaking/\">The curious internal logic of open access policymaking</a> appeared first on <a rel=\"nofollow\" href=\"https://www.samuelmoore.org\">Samuel Moore</a>.</p>\n"},{"id":"https://www.samuelmoore.org/?p=1335","title":"Research assessment in the university without condition","link":"https://www.samuelmoore.org/2022/10/11/research-assessment-in-the-university-without-condition/","published":"Tue, 11 Oct 2022 07:37:08 +0000","description":"Cross-posted on the Dariah Open blog as part of their series on research assessment in the humanities and social sciences In his lecture entitled ‘The future of the profession or the university without...","isPermalink":false,"tags":["Open access"],"authors":[{"name":"samoore_","url":null}],"image":null,"modified":null,"contentHtml":"\n<p><em>Cross-posted on the <a href=\"https://dariahopen.hypotheses.org/1527\">Dariah Open blog</a> as part of their series on research assessment in the humanities and social sciences</em></p>\n\n\n\n<p>In his lecture entitled ‘The future of the profession or the university without condition’, Jacques Derrida makes the case for a university dedicated to the ‘principle right to say everything, whether it be under the heading of fiction and the experimentation of knowledge, and the right to say it publicly, to publish it.’ (Derrida 2001). Beyond mere academic freedom, Derrida is arguing for the importance not just of the right to say and publish, but to question the very institutions and practices upon which such freedom is based – those performative structures, repertoires and boundaries that make up what we call (and do not call) ‘the humanities’.</p>\n\n\n\n<p>One such structure – implicit in much of what Derrida writes – relates to the material conditions of the university, or the relationship between ‘professing’ and being ‘a professor’ tasked with the creation of singular works representing their thought (‘oeuvres’). Derrida identifies a gulf between the unconditional university he is arguing for and the material conditions that work against the realisation of such a university. Academics are conditioned to publish work in certain ways, not in the service of this unconditional university but in order to simply earn a living. Integral to this situation are the ways in which humanities research and researchers are assessed and valued by universities and funders. We publish in prestigious books and journals so that we might continue to ‘profess’ in the university for a while longer.</p>\n\n\n\n<p>For the most part, research assessment reform promises to tinker with these structures and propose new ‘fairer’ ways to evaluate research. For example, the recent European <a href=\"https://research-and-innovation.ec.europa.eu/system/files/2022-07/rra-agreement-2022.pdf\">agreement on reforming research assessment</a> seeks to eradicate journal markers and inappropriate quantitative measures, while promoting qualitative measures that reward a plurality of roles and ways that academics can contribute to research. These recommendations are made in the service of recognising those ‘diverse outputs, practices and activities that maximise the quality and impact of research’ (p. 2). The implication is that good research is being done, but it is not possible to learn this from current approaches to research assessment. Assessment is conceived primarily as an epistemological issue that more accurately rewards those doing the best work.</p>\n\n\n\n<p>Absent from these reforms is a thoroughgoing consideration of the fact that research assessment is, more than anything else, a labour issue. It is about the material conditions that allow participation and progression with higher education institutions. The mere fact that researchers chase prestige at every turn is because this is the path to being rewarded in such a brutally competitive academic job market. Without a greater push to end precarity and ease workloads, changing evaluative criteria will have no impact on the labour conditions within the contemporary university. This is why such reforms need to be coupled with a real commitment to improving labour conditions that will in turn have their own epistemological benefits in the form of less pressure to publish and a greater freedom to experiment.&nbsp;&nbsp;</p>\n\n\n\n<p>I’m not here to propose alternatives to the European reforms. Instead, I want to us to consider whether Derrida’s university without condition – though no more than a theoretical construct – also requires us to refuse the conditions of external research and especially research<em>er</em> assessment. Abandoning assessment could be undertaken in favour of careful and collectivising appreciation by the communities that create and sustain research. We should therefore take as our starting point that the assessment of research for the distribution of scarce resources <em>is not strictly necessary to the pursuit of research</em>. Clearly, financial resources have to be distributed, but a more equitable alternative would be to offer greater democratic governance by all members of the university over how resources are distributed: randomly, communally, through basic income or however else. This is the more urgent work of research assessment reform, not tinkering at the margins.</p>\n\n\n\n<p>These more experimental approaches, although <a href=\"https://www.nature.com/articles/d41586-022-02959-3\">gaining traction</a>, presuppose that the university should not be beholden to liberal ideas of meritocracy or individual excellence. Assessment reform should instead lower barriers to participation and facilitate experimental, diverse and collective approaches to knowledge production <em>for their own sake</em>. But it is this connection to the material conditions of labour that is most important to recognise and support: the university without condition requires it.</p>\n\n\n\n<p><strong>Work cited</strong></p>\n\n\n\n<p>Derrida, Jacques. 2001. ‘The Future of the Profession or the Unconditional University (Thanks to the Humanities That Could Take Place Tomorrow)’. In <em>Jacques Derrida and the Humanities: A Critical Reader</em>, edited by Tom Cohen. Cambridge: Cambridge University Press.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.samuelmoore.org/2022/10/11/research-assessment-in-the-university-without-condition/\">Research assessment in the university without condition</a> appeared first on <a rel=\"nofollow\" href=\"https://www.samuelmoore.org\">Samuel Moore</a>.</p>\n"},{"id":"https://www.samuelmoore.org/?p=1325","title":"New Horizons in Open Access Publishing: upcoming Open Access Week talk","link":"https://www.samuelmoore.org/2022/09/08/new-horizons-in-open-access-publishing-upcoming-open-access-week-talk/","published":"Thu, 08 Sep 2022 09:16:27 +0000","description":"On October 25th I&#8217;ll be giving an online talk at University College Cork for their event on New Horizons in Open Access Publishing. Details below: &#8216;Scaling small&#8217;, or why there are no BIG...","isPermalink":false,"tags":["Open access"],"authors":[{"name":"samoore_","url":null}],"image":null,"modified":null,"contentHtml":"\n<p>On October 25th I&#8217;ll be giving an online talk at University College Cork for their event on <a href=\"https://libcal.ucc.ie/event/3912450\">New Horizons in Open Access Publishing</a>. Details below:</p>\n\n\n\n<p><strong>&#8216;Scaling small&#8217;, or why there are no BIG solutions to the problem of ethical open access</strong></p>\n\n\n\n<p>As Plan S gains steam in Europe and the US mandates public access to all research published from 2026, subscription publishing seems likely to be an increasingly unviable business model in the near future. We are rapidly moving to a time in which all academic research articles – and increasing amounts of books – will be available to access and share without payment. Yet although open access has won the day, it is worth considering why this victory also feels like something of a defeat. Publishing is still largely controlled by a handful of profiteering companies who are rapidly expanding into areas beyond research articles, such as research data, user data and other elements in the knowledge production workflow. At the same time, many researchers remain unengaged and motivated by regressive research cultures that promote competition over collaboration, seeing open access as an imposition or something to be ignored entirely. But what is to be done here, and why are there no easy or big solutions? This talk will argue that the all-encompassing solutions promised by open access mandates, funder platforms and transformative agreements are part of the problem. Instead, open access practitioners need to consider the necessity of ‘smallness’ and local solutions in nurturing a diverse and ethical diamond open access publishing ecosystem.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.samuelmoore.org/2022/09/08/new-horizons-in-open-access-publishing-upcoming-open-access-week-talk/\">New Horizons in Open Access Publishing: upcoming Open Access Week talk</a> appeared first on <a rel=\"nofollow\" href=\"https://www.samuelmoore.org\">Samuel Moore</a>.</p>\n"},{"id":"https://www.samuelmoore.org/?p=1321","title":"Thoughts on the new White House OSTP open access memo","link":"https://www.samuelmoore.org/2022/08/31/thoughts-on-the-new-white-house-ostp-open-access-memo/","published":"Wed, 31 Aug 2022 14:02:10 +0000","description":"Cross-posted on the University of Cambridge&#8217;s Unlocking Research blog. In the USA last Thursday, the White House Office of Science and Technology Policy announced its decision to mandate public access...","isPermalink":false,"tags":["Open access"],"authors":[{"name":"samoore_","url":null}],"image":null,"modified":null,"contentHtml":"\n<p><em>Cross-posted on the University of Cambridge&#8217;s Unlocking Research blog.</em></p>\n\n\n\n<p>In the USA last Thursday, the White House Office of Science and Technology Policy <a href=\"https://www.whitehouse.gov/ostp/news-updates/2022/08/25/ostp-issues-guidance-to-make-federally-funded-research-freely-available-without-delay/\">announced its decision</a> to mandate public access to all federally funded research articles and data. From 2026, the permitted embargo period of one year for funded publications will be removed and all publications arising from federal funding will have to be immediately accessible through a repository. Although more details are to be announced, my colleague Niamh Tumelty, the OSC’s Head of Open Research Services, shared a <a href=\"https://unlockingresearch-blog.lib.cam.ac.uk/?p=3208\">helpful summary of the policy and some initial reaction here</a>. I want to offer my own personal assessment of what the new policy might mean from the perspective of open access to research articles, something we are working hard to promote and support throughout the university.</p>\n\n\n\n<p>To be sure, the new OSTP memo is big news: the US produces a huge amount of research that will now be made immediately available without payment to the world at large. Following in the footsteps of Plan S in Europe, the open access policy landscape is rapidly evolving away from embargo periods and towards immediate access to research across all disciplines. Publishing industry consultants Clarke & Esposito have even <a href=\"https://www.ce-strategy.com/the-brief/zero-embargo/\">argued</a> that this intervention will make the subscription journal all the more unviable, eventually leading to its demise.</p>\n\n\n\n<p>Indeed, responses from the publishing industry have been mixed. The STM Association, for example, offer a muted <a href=\"https://www.stm-assoc.org/stm-statement-ostp/\">one-paragraph response </a>claiming tepid support for the memo, while organisations such as the AAP were more <a href=\"https://publishers.org/news/statement-from-shelley-husband-senior-vice-president-government-affairs-association-of-american-publishers-on-decision-by-white-house-office-of-science-and-technology-policy-to-make-private-se/\">vocally against</a> what they see as a lack of ‘formal, meaningful consultation or public input’ on the memo, despite the fact that many more details are still to be announced (presumably, following consultation). A similar sense of frustration was displayed by some of the authors of the industry-supported <em><a href=\"https://scholarlykitchen.sspnet.org/2022/08/30/ask-the-chefs-ostp-policy-i/\">Scholarly Kitchen</a> </em>blog. It’s fair to say that the publishing industry itself – at least the part of it that makes money from journal subscriptions – has not welcomed the new memo with open arms.</p>\n\n\n\n<p>Understandably, funders and advocacy organisations have welcomed the news. Johan Rooryck from Coalition S <a href=\"https://www.coalition-s.org/coalition-s-welcomes-the-updated-open-access-policy-guidance-from-the-white-house-office-of-science-technology-and-policy/\">called the memo</a> a ‘game changer for scholarly publishing’, while the <a href=\"https://www.orfg.org/news/2022/8/29/open-research-funders-group-applauds-bold-ostp-action\">Open Research Funders Group</a> ‘applauds bold OSTP action’ in its response. Open access advocates SPARC <a href=\"https://sparcopen.org/news/2022/in-an-historic-win-for-open-access-u-s-publicly-funded-research-will-be-freely-and-immediately-available-to-all/\">described the memo</a> as a ‘historic win’ for open access and a ‘giant step towards realizing our collective goal of ensuring that sharing knowledge is a human right – for everyone’. Certainly, for those arguing in favour of greater public access to research, the memo will indeed result in just this. But I still have my reservations.</p>\n\n\n\n<p>My PhD thesis analysed and assessed the creation and implementation of open access policy in the UK. As Cambridge researchers no doubt know, the open access policy landscape is composed of a number of mandates, with varying degrees of complexity, and affects the vast majority of UK researchers in one way or another. This is for better and for worse: there is an increase in bureaucracy associated with open access policy (particularly through repositories), even though it results in greater access to research. However, when you remove this bureaucracy through more seamless approaches to OA like transformative agreements, there is a risk of consolidating the power of large commercial publishers who dominate this space and make obscene profits (a <a href=\"https://www.jeffpooley.com/2022/08/the-big-apc-question-mark-hovering-over-the-ostp-announcement/\">fear also shared by Jeff Pooley</a> in his write-up of the policy). There is therefore a delicate balance to be struck between simply throwing money at market-based solutions and requiring researchers and librarians to take on more of the burden of compliance.</p>\n\n\n\n<p>The problem with indiscriminate policy mandates for public access to research, such as the OSTP’s memo, is that they shore up the idea that publishing has to be provided by a private industry that is not especially accountable to research communities or the university more broadly. This is precisely because these policies are indiscriminate and therefore apply to everyone equally, which for academic publishing means benefitting those already in a good position to profit. Larger commercial publishers have worked out better than anyone else how to monetise open access through a range of different business models. As long as researchers need to continue publishing with the bigger publishers, which they do for career reasons, these publishers will always be in a better position to benefit from open access policies. It is hard to imagine how the individual funding bodies could implement the OSTP memo in a way that does foreground a more bibliodiverse publishing system at the expense of commercialism (not least because this goal does not appear to be the target of the memo). &nbsp;</p>\n\n\n\n<p>I do not mean to overplay the pessimism here: it is great that we are heading for a world of much more open access research. The point now is to couple this policy with funding and support to continue building the capacity of an ethical and accountable publishing ecosystem, all while trying to embed these ethical alternatives within the mainstream. This kind of culture change cannot be achieved by mandates like the OSTP is proposing, but it can be achieved by the harder work of raising awareness of alternatives and highlighting the downsides of current approaches to publishing. It is also important to reveal the ways in which research cultures shape how researchers decide to publish their work – often at the expense of experimentation and openness – and how they can be changed for the better.</p>\n\n\n\n<p>So I am interested to see how the memo is implemented in practice, especially how it is funded and the conditions set on immediate access to research. I am also keen to see what role, if any, <a href=\"https://www.openaccess.cam.ac.uk/funder-open-access-policies/rights-retention/rights-retention-pilot\">rights retention</a> plays in the implementation and how US libraries decide to support the policy and the changing environment more broadly. Ultimately, however, the move to a more scholar-led and scholar-governed ecosystem will not occur on an open/closed binary, nor on a top-down/bottom-up one, and so we must find a range of ways to support new cultures of knowledge production and dissemination in the university and beyond.</p>\n\n\n\n<p></p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.samuelmoore.org/2022/08/31/thoughts-on-the-new-white-house-ostp-open-access-memo/\">Thoughts on the new White House OSTP open access memo</a> appeared first on <a rel=\"nofollow\" href=\"https://www.samuelmoore.org\">Samuel Moore</a>.</p>\n"},{"id":"https://www.samuelmoore.org/?p=1304","title":"Why open science is primarily a labour issue","link":"https://www.samuelmoore.org/2022/06/18/why-open-science-is-primarily-a-labour-issue/","published":"Sat, 18 Jun 2022 19:24:54 +0000","description":"Reforming research assessment and culture is a hot topic in higher education, particularly how these issues relate to research funding. I discussed the HELIOS initiative in my last post, which is a funder-led...","isPermalink":false,"tags":["Open access"],"authors":[{"name":"samoore_","url":null}],"image":null,"modified":null,"contentHtml":"\n<p>Reforming research assessment and culture is a hot topic in higher education, particularly how these issues relate to research funding. I discussed the HELIOS initiative in my last post, which is a funder-led approach to incentivising open science practices in North American tenure and promotion guidelines. Now, in the past week, EU science ministers have agreed on a plan to facilitate<a href=\"https://sciencebusiness.net/news/eu-science-ministers-agree-research-assessment-reform\"> coordinated reform</a> of research assessment processes. </p>\n\n\n\n<p>As I noted last week, research assessment reform is often predicated upon nurturing cultures of open science based on encouraging researchers to share the materials and underlying processes behind their research. In doing this, the argument goes, research becomes &#8216;democratised&#8217; and &#8216;collectivised&#8217; by its ability to bring more people into the scientific conversation through the removal of price and permission barriers to the reuse of materials. Open science, I argue, is an overly resource-focused approach to the knowledge commons (free code, data and publications), rather than one focused on the relationalities and different possible forms of organisation in how these knowledge resources are produced. In addition to freely available resources, these alternative relationalities are vital for a more emancipatory university.  </p>\n\n\n\n<p>But emancipatory from what? Underpinning all these approaches to assessment reform is the <a href=\"https://undark.org/2022/06/16/why-wont-academia-let-go-of-publish-or-perish/\">brutally competitive</a> nature of marketised higher education and the fact that precarious and exploited labour props up so much of what the university does. To this extent, <em>open science is primarily a labour issue, not an epistemological one</em>, although it is rarely approached by policymakers in this way. Knowledge production does not benefit from precarity or poor working conditions, not least due to the way they turn researchers into individuals competing with one another at every turn for scarce resources. If open science is to have any meaning, then, it must be grounded in a politics that is emancipatory from capital and the problems of researchers being oriented around capital at every point.</p>\n\n\n\n<p>So despite there being an often touted association between open science and collectivity, or the democratisation of higher education, this association is weak at best, but especially when promoted by senior managers and policymakers &#8212; i.e., those with a stake in maintaining the neoliberal academy. A truly collectivising approach to research assessment reform would foreground the labour issues associated with contemporary higher education under the assumption that open (or better) science would follow from less individuation and more collective governance over what the university is and does. </p>\n\n\n\n<p>I have <a href=\"https://www.youtube.com/watch?v=vGcb-z98Kz0\">argued elsewhere</a> that the push toward open access, while regressive in many ways, frees up resources that allow for more progressive and socially just pockets of activity in the margins. Being able to squat within the discourses of efficiency, openness, and other such concepts, affords the capacity to experiment with politically exciting approaches to common and collectively-managed endeavours, even while the profiteering and market-making associated with open access publishing continues apace. Is there a way for us to benefit from the push for research assessment reform in the same way by foregrounding these labour issues and radically reimagining what knowledge production and dissemination could look like? </p>\n\n\n\n<p>Part of the problem with policy-led approaches is that they fix and lock down what &#8216;openness&#8217; is and intends to achieve, while also forcing researchers to conform to this definition and comply with its demands. Yet openness itself, <a href=\"https://mitpress.mit.edu/books/living-books\">as many have argued</a>, facilitates and requires experimentation, particularly around the forms of organisation required to facilitate the kinds of relationalities that could help us build collective power in higher education. This, I argue, is what research assessment reform should be based on: building the capacity to explore and imagine different ways of producing knowledge, not simply reworking incentives towards open publishing, etc. In many ways, this means leaving behind assessment and replacing it with capacity building (as <a href=\"https://www.nature.com/articles/palcomms2016105\">we&#8217;ve argued for in a different context elsewhere</a>) or something altogether detached from the assessment of individual &#8216;performance&#8217;. </p>\n\n\n\n<p>For the most part, this vision requires radical thinking &#8212; which is why so many incremental approaches to assessment and culture reform fall flat for their tendency to rehearse all the pre-existing issues with the old system. My argument is simply that no one really knows how to best reimagine the new forms of organisation needed for more ethical knowledge production (but many people could give it a good shot given the opportunity, especially the very people currently so exploited by precarity). It involves bringing people together in a variety of ways, sustaining their collective efforts, and not continually dividing them up into individual units to be assessed at every possible turn. This also entails the ceding of control from policymaker to smaller, decentralised collectives of knowledge producers&#8230;which is probably a tough sell to the average policymaker.</p>\n\n\n\n<p></p>\n\n\n\n<p></p>\n\n\n\n<p></p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.samuelmoore.org/2022/06/18/why-open-science-is-primarily-a-labour-issue/\">Why open science is primarily a labour issue</a> appeared first on <a rel=\"nofollow\" href=\"https://www.samuelmoore.org\">Samuel Moore</a>.</p>\n"},{"id":"https://www.samuelmoore.org/?p=1289","title":"How does open science ‘democratise’ and ‘collectivise’ research?","link":"https://www.samuelmoore.org/2022/06/05/how-does-open-science-democratise-and-collectivise-research/","published":"Sun, 05 Jun 2022 20:05:40 +0000","description":"A recent article in The Scientist discusses the newly launched Higher Education Leadership Initiative for Open Scholarship (HELIOS). Composed of &#8216;leaders&#8217; from over 75 US colleges and...","isPermalink":false,"tags":["Open access"],"authors":[{"name":"samoore_","url":null}],"image":null,"modified":null,"contentHtml":"\n<p>A <a href=\"https://www.the-scientist.com/news-opinion/new-initiative-incentivizes-open-research-70098\">recent article</a> in <em>The Scientist </em>discusses the newly launched Higher Education Leadership Initiative for Open Scholarship (HELIOS). Composed of &#8216;leaders&#8217; from over 75 US colleges and universities, <a href=\"https://www.heliosopen.org/about\">HELIOS</a> is committed to incentivising open science practices in order to make research more research more &#8216;inclusive, transparent, and efficient&#8217;. It is an approach designed to reorient assessment mechanisms towards open science practices, including &#8216;publishing in open-access journals, posting data using FAIR (findable, accessible, interoperable, and reusable) principles, and sharing other research outputs such as computer code.&#8217;</p>\n\n\n\n<p>Throughout the article, we hear how open science &#8216;democratises&#8217; science and works against the rampant individualism that characterises so much of higher education. Open science is &#8216;collaborative&#8217; and entails the sharing of data, code and publications for anyone to access and reuse; it also allows research to reach and engage other communities not traditionally considered as part of the research process. These are familiar themes from years of open science advocacy.</p>\n\n\n\n<p>Yet it isn&#8217;t clear what the relationship is between the greater sharing of research materials and the so-called democratisation at work in open science. What actually is democratising and collectivising about what HELIOS is trying to do? </p>\n\n\n\n<p>It is important to ask this question because HELIOS is, by all accounts, a top-down initiative led by senior figures of research-intensive universities in the US. Despite the casual association between open science and collectivity, it appears that HELIOS is more a way for university leaders to coerce researchers into a cultural change, not something that is led by the research community at large. While changing tenure guidelines to prioritise publishing in open access journals, sharing FAIR data and releasing reusable open code may have some good outcomes, they are not themselves the basis for greater collective governance of science. Instead, these changes will provide an economic reason for researchers to adopt open science practices, a reason still based on individual progress within the academy.</p>\n\n\n\n<p>Clearly, it makes sense to incentivise behaviours that are good. But the problem here is that greater democratic governance of science <em>is </em>the way by which the incentivising should take place. This is made all the more important because the lack of collective governance within higher education is one of the biggest issues facing knowledge production right now: it is the thing that could lead to much greater cultures of academic research, certainly more so than HELIOS&#8217;s narrow focus on open science.</p>\n\n\n\n<p>The relationship between &#8216;openness&#8217; and democratisation is a false one, or at least there is no obvious or necessary connection between the two (see <a href=\"https://press.uchicago.edu/ucp/books/book/chicago/W/bo19085555.html\">Tkacz&#8217;s work</a> for more on the politics of openness). This is because open science is largely focused on the outputs of scientific research instead of the cultures of how they are produced. Or rather, open science is mainly interested in efficient and reproducible modes of production, not ethical or collectively-governed ones. The latter may be a consideration of some visions of open science, but they are not their defining feature.</p>\n\n\n\n<p>When policymakers and university leaders mandate openness to specific resources, democratic governance gets left behind. This is because this kind of openness does not require community accountability for it to be realised, only a vague sense that giving resources away will lead to a kind of inclusion that previously did not exist. This focus on resources is what allows the market and private enterprise &#8212; the ultimate expression of individualism &#8212; to dominate the provision of openness at the expense of community governance. </p>\n\n\n\n<p>For open science to adequately &#8216;democratise&#8217; or &#8216;collectivise&#8217;, it must consider the closures involved in such processes. By closures, I mean the actively designed and nurtured cultures of inclusion &#8212; and exclusion, by extension &#8212; that are required to foreground the good stuff (different cultures of knowledge, mutual reliance and care) and relegate the bad (everything oriented around profit). At some point, we&#8217;re going to have to work out how to leave the openness of openness behind and piece back together a more ethical system of knowledge production based on democratic self-governance of the university itself.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.samuelmoore.org/2022/06/05/how-does-open-science-democratise-and-collectivise-research/\">How does open science &#8216;democratise&#8217; and &#8216;collectivise&#8217; research?</a> appeared first on <a rel=\"nofollow\" href=\"https://www.samuelmoore.org\">Samuel Moore</a>.</p>\n"},{"id":"https://www.samuelmoore.org/?p=1278","title":"How to shed light on in-house publication review processes?","link":"https://www.samuelmoore.org/2022/05/11/how-to-shed-light-on-in-house-publication-review-processes/","published":"Wed, 11 May 2022 12:51:18 +0000","description":"This post makes a case for universities investing in people and processes for reviewing research in house before publication. This idea has no doubt been proposed before and is probably already a feature of...","isPermalink":false,"tags":["Open access"],"authors":[{"name":"samoore_","url":null}],"image":null,"modified":null,"contentHtml":"\n<p><em>This post makes a case for universities investing in people and processes for reviewing research in house before publication. This idea has no doubt been proposed before and is probably already a feature of some academic institutions, but I wanted to clarify here why I think it would benefit academic research. </em></p>\n\n\n\n<p>High-energy physics research is often held up as the archetypal open science discipline. Researchers upload their preprints to the arXiv when they are ready to share them, rather than after traditional journal-based peer review, meaning that the discipline itself is almost entirely open access as a result. Cultures of preprinting have been adopted across many other disciplines too and have been hailed as hugely important in the <a href=\"https://www.universityaffairs.ca/features/feature-article/the-rise-of-preprints/\">response to the pandemi</a>c. Sharing unrefereed research is increasingly commonplace for researchers of many disciplines.</p>\n\n\n\n<p>Yet as Kling and McKim wrote in their hugely influential paper on disciplinary publishing differences, the process by which high-energy physics research makes it to the arXiv is not as simple as just throwing out unrefereed research for public consumption. Instead, it reflects an extensive and careful process of evaluation between multiple groups of collaborating institutions:</p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>High-cost (multimillion dollar) research projects usually involve large scientific teams who may also subject their research reports to strong internal reviews, before publishing. Thus, a research report of an<br>experimental high-energy physics collaboration may have been read and reviewed by dozens of internal reviewers before it is made public.</p><cite>https://arxiv.org/abs/cs/9909008</cite></blockquote>\n\n\n\n<p>Once an experimental high-energy physics article is made public, it has undergone an extensive, internally-managed review process that may be conceived as a kind of peer review. There is care in the process of bringing together the many pairs of eyes that have a stake in the authorship of a paper. Authors have confidence in their preprint not just because they are protected by the safety of hundreds or thousands of co-authors, but because those co-authors have developed internal processes for ensuring confidence in their research.</p>\n\n\n\n<p>Although I do not want to reify this or any other kind of peer review as more efficacious in obtaining scientific &#8216;truth&#8217;, it is clear that the reputation physicists have acquired for working entirely in the open may not tell the full story about their review processes. This reputation instead elides the fact that a preprint is often a well-evaluated document rather than a first draft or unfinished research paper, even if it may change according to subsequent feedback or revisions. What I am interested in is whether a similar kind of internal process might be useful across other disciplines too.</p>\n\n\n\n<p>I think it&#8217;s fair to say that, across all disciplines, many researchers share their work with colleagues before wider dissemination via a journal, preprint server, etc. This could be through informal networks of peers, mentors, or simply other people in your department or lab. But what if there were processes to facilitate and nurture these practices, and what if these processes were made clear to readers at the point of wider dissemination? If an organisation were to formalise and certify this process &#8212; devoting resources to organising it according to disciplinary conventions &#8212; would this both encourage earlier dissemination of research and give readers confidence that they are not the first people reading it? </p>\n\n\n\n<p>I am essentially arguing for a job position within a disciplinary specific-setting, someone who knows intimately the manner and rhythm of their field&#8217;s publishing cultures, and who can help organise this process across their department (or wherever). Doing this would shed light on the processes of feedback and revision that took place before the research was disseminated while offering support to others trying to do the same. (It is in no way intended to be punitive.)</p>\n\n\n\n<p>I am not arguing that these internal review processes tell us much about the research itself (any more than any peer review process can), only that papers from a specific lab/department/centre/etc. would have broadly acquired feedback in the same way. In externalising these processes and encouraging more people to adopt them, we begin to understand the varying levels of assessment that research receives as it becomes more widely disseminated. This would also work against publishers as the final gatekeepers and would dilute their influence over peer review as a black and white system of verification. </p>\n\n\n\n<p>In building the capacity for such a system of feedback, and funding people to make this work, universities would begin to shift culture and reclaim elements of knowledge production from the marketised publishing industry. This approach would encourage better practices prior to sharing un-refereed research, ultimately leading to greater confidence in such research across all disciplines.</p>\n\n\n\n<p> </p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.samuelmoore.org/2022/05/11/how-to-shed-light-on-in-house-publication-review-processes/\">How to shed light on in-house publication review processes?</a> appeared first on <a rel=\"nofollow\" href=\"https://www.samuelmoore.org\">Samuel Moore</a>.</p>\n"},{"id":"https://www.samuelmoore.org/?p=1218","title":"An illustration of the problem with the literature on predatory publishing","link":"https://www.samuelmoore.org/2021/08/24/an-illustration-of-the-problem-with-the-literature-on-predatory-publishing/","published":"Tue, 24 Aug 2021 19:13:59 +0000","description":"I&#8217;m becoming increasingly interested in the academic literature on predatory publishing, especially the differing definitions and argumentative strategies these articles use to illustrate the problem of...","isPermalink":false,"tags":["Open access"],"authors":[{"name":"samoore_","url":null}],"image":null,"modified":null,"contentHtml":"\n<p>I&#8217;m becoming increasingly interested in the academic literature on predatory publishing, especially the differing definitions and argumentative strategies these articles use to illustrate the problem of poor-quality publishing. Over the weekend I scanned the recently-published article <a href=\"https://sigmapubs.onlinelibrary.wiley.com/doi/full/10.1111/jnu.12696?saml_referrer\">&#8216;Publishing in Predatory Journals: Guidelines for Nursing Faculty in Promotion and Tenure Policies&#8217;</a>, by Broome et al. Through interviews and analysis of tenure and promotion documentation, the article explores the extent to which predatory publishing is mentioned or discussed in the publishing guidance given to faculty in schools of nursing in the USA.</p>\n\n\n\n<p>While skimming the article to note down what definition of predatory it uses, I noticed this sentence in the authors&#8217; literature review:</p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>Unfortunately, the rise in number of these predatory publishers, which has recently been estimated to be an industry worth $10.5 billion annually (Wilkinson et al., <a href=\"https://sigmapubs.onlinelibrary.wiley.com/doi/full/10.1111/jnu.12696?saml_referrer#jnu12696-bib-0027\">2019</a>), has caused alarm, with many in academic communities fearing the potential destruction of the scientific literature.</p><cite><a href=\"https://doi.org/10.1111/jnu.12696\">https://doi.org/10.1111/jnu.12696</a></cite></blockquote>\n\n\n\n<p>$10.5 billion seemed unbelievably high to me so I followed the reference where this figure was taken from. This led me to <a href=\"https://bmjopen.bmj.com/content/9/5/e027928\">Wilkinson et al.</a>, the first sentence of which contains the line: &#8216;In the last 10 years, a subset of ‘predatory’ publishers has been able to flourish within the $10.5 billion per year market [1-4].&#8217; Already, then, it seems that the figure referenced by the authors of the original paper is talking about a larger market of which predatory publishers may be a part. Unfortunately, no more context than this is given and so I followed the references [1-4] cited by Wilkinson et al. for more context. Rather than an academic article, this led me to a blog of the publishing industry called <em>The Scholarly Kitchen</em> and an article by Joseph Esposito on the size of the open-access market. It turns out the figure cited is from an industry report by a company named Simba:</p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>Simba notes that the primary form of monetization for OA journals is the article processing charge or APC. In 2013 these fees came to about $242.2 million out of a total STM journals market of $10.5 billion. I thought that latter figure was a bit high, and I’m never sure when people are quoting figures for STM alone or for all journals; but even so, if the number for the total market is high, it’s not far off.</p><cite>https://scholarlykitchen.sspnet.org/2014/10/29/the-size-of-the-open-access-market/</cite></blockquote>\n\n\n\n<p>This seems to be quite different to the initial quote from Broome et al. illustrating incorrectly that the predatory journal market itself represents &#8216;$10.5 billion annually&#8217;, when it, in fact, represents the total STM journals market in 2013 (and even that is disputed by the author). So unless all the journals in the STM market are predatory (which is an argument for another time), this figure is way off the mark. </p>\n\n\n\n<p>It turns out that a separate group of authors,<a href=\"https://bmcmedicine.biomedcentral.com/articles/10.1186/s12916-015-0469-2\"> Shen and Björk</a>, did try to estimate the size of the predatory market and came up with a figure of $74 million, but even this is probably over-estimated based on the variety of definitions of predatory publishing that exist (and other factors explored by <a href=\"http://walt.lishost.org/2017/04/the-problems-with-shenbjorks-420000/\">Walt Crawford on his blog</a>). But even if this overinflated figure were accurate, the original figure cited by Broome et al. would still be over 100 times higher and gives the impression that predatory publishing is much, much larger than even the higher estimates claim. </p>\n\n\n\n<p>I&#8217;m not entirely sure what to conclude from this, but the error seems pretty basic and took me less than a few minutes to get to the bottom of. Should this have been picked up by an expert peer reviewer? Probably. The article was subject to double-blind external review, as outlined by the <em>Journal of Nursing Scholarship</em> author guidelines, and so you would have thought that an expert on academic publishing would have caught this. Peer review is of course not a perfect way of evaluating manuscripts, although this figure does feel pretty egregiously wrong to be part of the scholarly record. </p>\n\n\n\n<p>As part of their definition of predatory publishing, the authors themselves cite &#8216;questionable peer review done by these journals&#8217;. Here, we have a clear instance of questionable peer review that impacts the way the entire article is framed. This is not to say that the <em>Journal of Nursing Scholarship</em> is predatory, but rather that definitions of predatory are consistently insufficient and do not actually tell us anything about the substance or veracity of an article in question. They try to separate out good actors (in this case a subscription journal published by the for-profit commercial publisher Wiley) from bad actors based on inconsistently applied criteria often founded on prejudice (<a href=\"https://www.samuelmoore.org/2020/03/12/the-undecidable-nature-of-predatory-publishing/\">I have argued this previously</a>). This has real-world effects because a huge body of scholarship is now dedicated to the analysis of &#8216;predatory&#8217; journals that are leading to the &#8216;destruction of the scientific literature&#8217;, despite the fact that there is no fixed or useful definition as to what predatory publishing actually is. Paradoxically, as with this instance, many of these articles commit exactly the same sins they claim are characteristic of the kinds of publishing they are critiquing.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.samuelmoore.org/2021/08/24/an-illustration-of-the-problem-with-the-literature-on-predatory-publishing/\">An illustration of the problem with the literature on predatory publishing</a> appeared first on <a rel=\"nofollow\" href=\"https://www.samuelmoore.org\">Samuel Moore</a>.</p>\n"},{"id":"https://www.samuelmoore.org/?p=1208","title":"What does the UKRI policy mean for open access book publishing?","link":"https://www.samuelmoore.org/2021/08/09/what-does-the-ukri-policy-mean-for-open-access-book-publishing/","published":"Mon, 09 Aug 2021 13:17:15 +0000","description":"UK Research and Innovation today published its updated policy on open access. For journals, the policy is simplified and normalised across the disciplines. Immediate open access under CC BY is mandated (with...","isPermalink":false,"tags":["Open access"],"authors":[{"name":"samoore_","url":null}],"image":null,"modified":null,"contentHtml":"\n<p>UK Research and Innovation today published its <a href=\"https://www.ukri.org/about-us/policies-standards-and-data/good-research-resource-hub/open-research/ukris-new-open-access-policy-will-help-to-unlock-the-benefits-of-research-for-society/\">updated policy on open access</a>. For journals, the policy is simplified and normalised across the disciplines. Immediate open access under CC BY is mandated (with exceptions considered on a case-by-case basis), meaning no embargoes for green open access. Hybrid publishing will not be funded by UKRI where the journal in question does not have a transitional agreement. All in all, the policy is reflective of the direction of travel towards immediate open access for research articles, something the policymakers feel that the more mature market is now able to accommodate. </p>\n\n\n\n<p>The policy also mandates open access book publishing subject to a one-year embargo. Unlike journals, open access is not a dominant method of publishing long-form scholarship. The economics are different for book publishing, including the reliance on specialist editorial and production work that needs to be accounted for, alongside printing and distribution costs (particularly as print sales are likely to be one of the main ways of funding open access books). Many models have been developed to support OA monographs, but no single workable model has emerged. </p>\n\n\n\n<p>In recognition of the need to explore new models, UKRI has ear-marked a block grant of £3.5 million to support open access book publishing. Though it isn&#8217;t immediately clear what this money can be spent on, it is reasonable to assume that the dreaded book processing charge is one possible approach. Often totalling upwards of £10,000, the book processing charge is a staple model used by commercial publishers for open access books. It is a single payment intended to cover editorial and production costs and mitigate against the loss of revenue implied by giving away a free digital copy. In practice, these same publishers are able to sell print copies through regular channels, and so BPCs (which are eye-wateringly expensive) remove risk for commercial organisations wanting to publish open access while allowing them to monetise books as they have always done. It isn&#8217;t a great model for publishing.</p>\n\n\n\n<p>As more prestigious venues will charge more, the BPC will be just as pernicious as the article-processing charge has been for journal publishing. Authors are spending someone else&#8217;s money and so there is no reason for them to be price-sensitive, especially given the high reward that prestige offers. Without further intervention, it is likely that freeing up public money through a block grant will cement the BPC as the primary business model for open access books. This will create a two-tiered system whereby researchers with funding can publish open access books, while those without cannot. </p>\n\n\n\n<p>It is important to bear in mind that open access book publishing was pioneered by presses that do not require author payment and instead rely on a range of models and subsidies to support their work. The <a href=\"http://radicaloa.disruptivemedia.org.uk/\">Radical Open Access Collectiv</a>e is home to lots of them, and Lucy Barnes&#8217; twitter thread below illustrates more. Small, often scholar-led presses have been pioneering OA books for years and their contribution needs to be recognised. But how do they access the funding available for open access monographs? Do they have to start charging BPCs &#8212; thus rehearsing all the problems with marketisation &#8212; or can the money instead be used to directly fund their operations through consortial funding (as the <a href=\"https://www.copim.ac.uk/\">COPIM project</a> is developing) or direct payments to presses? Without this, we&#8217;ll see commercial publishers swoop in and snatch through BPCs the funding that UKRI has made available.</p>\n\n\n\n<blockquote class=\"twitter-tweet\" data-partner=\"tweetdeck\"><p dir=\"ltr\" lang=\"en\">The day UKRI releases its policy for <a href=\"https://twitter.com/hashtag/OpenAccess?src=hash&ref_src=twsrc%5Etfw\">#OpenAccess</a> books is a great time to remind everyone that there are award-winning presses publishing OA books without charging BPCs &#8212; such as <a href=\"https://twitter.com/OpenBookPublish?ref_src=twsrc%5Etfw\">@OpenBookPublish</a>, which has been doing so since 2008.<a href=\"https://t.co/CRYtc85nUI\">https://t.co/CRYtc85nUI</a> <a href=\"https://twitter.com/hashtag/OAbooks?src=hash&ref_src=twsrc%5Etfw\">#OAbooks</a> 1/5</p>— Lucy Barnes (@alittleroad) <a href=\"https://twitter.com/alittleroad/status/1423578957170057216?ref_src=twsrc%5Etfw\">August 6, 2021</a></blockquote>\n<script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\n\n\n<p>This has always been the main problem with open access policies: they do not take a view on the publishing market, instead merely promoting open over closed access. This not only glosses over the broader motivations for open access, which are about redirecting scholarly communication towards more ethical models and organisations, but also creates new problems by freeing up money that allows commercial publishers to consolidate their power. As with journals, we may well see the emergence of publishing models designed to remove the expert labour and editorial care involved in book publishing (which is already happening in much of the commercial book publishing world) and to automate book production to make it more commercially viable. </p>\n\n\n\n<p>But academic book publishing is not and should not be commercially viable &#8212; it should be subsidised by universities and made freely available to all who want access. Open access offers the chance to reassess how the market shapes publishing and to return control of it to research communities themselves. It is vital, then, that the block grant for books announced by UKRI can be used to support the alternative ecosystem of open access book publishers and not (simply) those charging BPCs. </p>\n\n\n\n<p></p>\n\n\n\n<p></p>\n\n\n\n<p></p>\n\n\n\n<p></p>\n\n\n\n<p></p>\n\n\n\n<p></p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.samuelmoore.org/2021/08/09/what-does-the-ukri-policy-mean-for-open-access-book-publishing/\">What does the UKRI policy mean for open access book publishing?</a> appeared first on <a rel=\"nofollow\" href=\"https://www.samuelmoore.org\">Samuel Moore</a>.</p>\n"},{"id":"https://www.samuelmoore.org/?p=1197","title":"The future relationship between university and publisher","link":"https://www.samuelmoore.org/2021/08/01/the-future-relationship-between-university-and-publisher/","published":"Sun, 01 Aug 2021 09:27:04 +0000","description":"As rumours circulate about the forthcoming UKRI open access policy announcement, fierce lobbying is underway by publishers worried that the policy may undermine their business models. Elsevier has even taken...","isPermalink":false,"tags":["Open access"],"authors":[{"name":"samoore_","url":null}],"image":null,"modified":null,"contentHtml":"\n<p class=\"has-drop-cap\">As rumours circulate about the forthcoming <a href=\"https://www.timeshighereducation.com/news/ukri-accepts-open-access-monographs-must-be-fully-funded\">UKRI open access policy</a> announcement, fierce lobbying is underway by <a href=\"https://www.publishers.org.uk/publications/the-practical-implications-of-ukris-proposed-open-access-policy-for-the-uks-research-sector/\">publishers</a> worried that the policy may undermine their business models. Elsevier has even taken the step of <a href=\"https://github.com/sje30/elsevier21/blob/main/elsevier-email-july2021.md\">directly emailing their UK-based academic editors</a> to criticise the rumoured policy and encourage academics to relay the publisher&#8217;s views to UKRI. While these disagreements may not seem particularly new to anyone familiar with the open access movement, it also feels like things are coming to a head between academic publishers and the university sector. Ultimately, as I&#8217;ll argue here, universities need to take a view on what their future relationship with publishing should be. </p>\n\n\n\n<p>In some respects, the debate over open access has always been about the antagonism between universities and publishers. Although access to research is an important and defining feature of these debates, the spectre of publishing profit margins and extractive business models loomed large from the beginning. There is no getting around the fact that publishers rely on labour and content they get for free. Instead, the editorial work of publishing is remunerated by universities as part of academic salaries, which of course does not fall evenly on individual academics (many of whom precarious, overworked and/or not employed by a university). Nevertheless, the university sector funds much of what the publishing industry relies upon for its operations and expects something in return.</p>\n\n\n\n<p>To the extent that it has been marketised, the publishing industry is viewed as standing outside the university and not controlled by it. This is despite the fact that academics (for the most part) maintain <em>editorial</em> control of the publications they edit and peer review. Having talked to numerous editors of commercial journals, there is a very real sense that their publishers are service providers rather than part of the scholarly community. They might not provide the level of service that many editors expect, but they are service providers all the same. As scholarly communication has been ceded entirely to this market of service providers, universities have lost <em>economic and material</em> control of the publications they rely on (which also impacts on editorial control in various ways). This is all the more apparent given the dual functions the industry serves of both knowledge dissemination and researcher evaluation. Universities have outsourced both of these crucial functions to a separate, external industry.</p>\n\n\n\n<p>As the university sector grapples with this loss of control, issues like the <a href=\"https://www.coalition-s.org/rights-retention-strategy/\">Rights Retention Strategy</a> have emerged for authors to retain ownership of intellectual property and circumvent publisher contracts that claim exclusive ownership. Such is the separation between university and publisher that researchers are being advised against signing publisher contracts that transfer copyright. Instead, researchers can assert ownership of their copyright prior to transferring it to a journal, allowing them to immediately deposit and share their editorially-accepted word document into a repository. Suffice to say that publishers <em>loathe</em> this strategy &#8212; which has the potential to enable immediate green open access &#8212; and are coming out against it with all guns blazing. </p>\n\n\n\n<p>Much of the current push for OA is thus predicated on the antagonism between publishers and universities. Access to publications is not a simple price negotiation between seller and consumer but instead reflects a struggle over the conditions that shape the negotiation. This situation is not particularly beneficial or sustainable for academic research, not least because universities do not appear to be particularly good at the hard-nosed negotiating that Elsevier is so well known for. It seems unlikely that an antagonistic approach has a long-term future and will only perpetuate the current system over which universities have ceded control. Sooner or later, universities will have to make a difficult call about the conditions of their relationship with the publishing industry, not just the price it pays to read and publish content. This means assessing the publishers they work with and considering the mechanisms that future control should take.</p>\n\n\n\n<p>I have made many calls on this blog for greater governance of scholarly publishing by the research community. When I argue for the need to bring publishing back in house, I mean in the sense of university press culture, university-managed infrastructure and governance of the publishers we work with. Universities need to build and manage stuff for this (as many increasingly do) but they also need to demand better accountability from publishers such that issues like the Rights Retention Strategy become unnecessary or unproblematic. There is arguably much more effort paid within the university to building a parallel publishing ecosystem through new university presses and open access publishers, but this new ecosystem will not unsettle the dominance of a handful of large, profiteering publishers with questionable ethics. For a long-term strategy, you require the alternative ecosystem, an understanding of how you want the old guard to change and a plan to eventually cut loose those publishers that refuse increased accountability. </p>\n\n\n\n<p>Such a plan would help to inform negotiations currently underway between the UK university sector and Elsevier (led by Jisc). Universities require access to Elsevier journals, although Elsevier will realistically not back down too much on price, and so the negotiators should seek formal pockets of governance over Elsevier publications as part of any deal. It remains to be seen what the priorities for governance should be and where demands might be met, but one could imagine issues relating to journal/data ownership, rights retention, diversity, metric implementation and journal policy changes as being up for grabs, in the long term at least. Introducing these issues into the negotiation now would signal to Elsevier that universities intend to be more active in their push for accountability and control over the industry.  </p>\n\n\n\n<p>Crucially, increased governance should be an aim across the industry &#8212; not just over the oligopoly &#8212; in order to cement best practice within the market more broadly. Governance should be an indication of partnership, trust and collaboration, not something punitive. This would also signal to academic editorial boards that publishers are not mere service providers and are part of the scholarly community, but only inasmuch as they act as members of it. This would also mean that academics would not be divorced from the important aspects of academic publishing and would instead be encouraged to use their editorial power for a more ethical and accountable market. </p>\n\n\n\n<p>Although the push for governance might feel hopelessly reformist (because the true objective is getting rid of marketisation in both the university and the publishing industry), it is still necessary given the parameters of the neoliberal university and its commercial imperatives. Greater governance does not preclude the possibility of radical alternatives in publishing and merely acts as a counterweight to the worst aspects of marketisation. This is similar to Christopher Newfield&#8217;s <a href=\"https://www.radicalphilosophy.com/article/universities-after-neoliberalism\">argument in the recent issue of <em>Radical Philosophy</em></a>. He argues that we should not &#8216;wait for wider social change&#8217; before seeking transformation of the neoliberal university. The work to be done is at once reformist and transformative. </p>\n\n\n\n<p>But at the same time as appearing reformist, the possibility of greater governance of commercial publishing is also a task of enormous magnitude. Not only do we not know what we require and how greater governance works in practice, it is highly unlikely that the more profiteering actors in the industry will entertain the idea. This is why universities need to make difficult decisions about their future relationship with publishers: those that are willing to open themselves up to greater oversight should be prioritised in negotiations, while those unwilling will stand out for their intransigence. Prioritising governance and oversight will therefore add complexity to negotiations currently based primarily on price, thus paving the way for less antagonistic relationships between &#8216;good&#8217; commercial actors and the university while leaving those publishers committed to the injustices of the free, ungovernable market out in the cold.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.samuelmoore.org/2021/08/01/the-future-relationship-between-university-and-publisher/\">The future relationship between university and publisher</a> appeared first on <a rel=\"nofollow\" href=\"https://www.samuelmoore.org\">Samuel Moore</a>.</p>\n"}]}