{"version":"https://jsonfeed.org/version/1.1","id":"h49ct36","title":"Liberate Science","description":"Research as a commons","homePageUrl":"https://libscie.org/","feedUrl":"https://libscie.org/rss/","favicon":"https://libscie.org/favicon.png","items":[{"id":"63ff07a7261a1e6be45d2afc","title":"Privacy as a form of openness: Moving away from Google Suite","link":"https://libscie.org/privacy-as-a-form-of-openness-moving-away-from-google-suite/","published":"Tue, 04 Apr 2023 07:24:16 GMT","description":"Privacy and openness are intertwined. But how does it affect how we conduct our business?","isPermalink":false,"tags":["Operations"],"authors":[{"name":"Liberate Science","url":null}],"image":"https://images.unsplash.com/photo-1461685265823-f8d5d0b08b9b?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=MnwxMTc3M3wwfDF8c2VhcmNofDJ8fFNlY3VyaXR5fGVufDB8fHx8MTY3NzY1ODYxNA&ixlib=rb-4.0.3&q=80&w=2000","modified":null,"contentHtml":"<img src=\"https://images.unsplash.com/photo-1461685265823-f8d5d0b08b9b?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=MnwxMTc3M3wwfDF8c2VhcmNofDJ8fFNlY3VyaXR5fGVufDB8fHx8MTY3NzY1ODYxNA&ixlib=rb-4.0.3&q=80&w=2000\" alt=\"Privacy as a form of openness: Moving away from Google Suite\"><p>We recently transitioned from using Google Suite as our main provider for email and online storage, in favor of <a href=\"https://proton.me\">Proton</a>. This is a conscious choice regarding the security of both our internal communications and the security of information people share with us.</p><p>Back in 2019, when we first required more scalable email solutions, we opted for Google Suite because it was straightforward and well known. <a href=\"https://www.chjh.nl/ok-google-delete-my-account-no-wait-no-really/\">Despite being familiar with the issues even back then</a>, we decided to use it as it was a de facto standard thing to do. It was available and incredibly easy.</p><p>Over the years, the symbiosis with the Google Workspace grew for us. It also became harder to disentangle from Google altogether. The linked applications, the logins tied to the Google account, and the Google Accounts we actually need to run our business (like our YouTube Channel or Google Business). It took several months to ensure a good transition but now we are migrated and disentangled to the degree possible.</p><p>Since its inception in 2014, Proton gained the reputation of being a solid and reliable end-to-end encrypted email provider. Since then, they&#x2019;ve expanded with storage, calendar, and VPN services as well, indicating they consider the entire suite of tools for running a business. That is why we now provide all our internal employees with a Proton accounts, including all of these services, amping up our security across the board, not just emails. Any internal emails are end-to-end encrypted by default. During travels, we can use reliable VPN services to prevent snooping.</p><p>This also means that whenever you send an email to an <code>@libscie.org</code> address, you can rest assured it is encrypted on our end and there is no third party snooping going on at our email provider. If you use Proton yourself, the email will be fully encrypted from sending to receiving.</p><p>The migration was not flawless &#x2014; we lost some functionality because integrations are limited. For example, our scheduling software <a href=\"https://savvycal.com\">SavvyCal</a> no longer works. We have to manually enter data into our sales pipeline, and you may find some broken links over time (let us know). It was good to realize how much of the value in the Google workspace actually came from the integrations. On the flipside, the data flowing <em>that</em> easily between service providers is also a risk that information can end up in the wrong place unknowingly.</p><p>In the end, we are open as a means to recalibrate power imbalances. Privacy is another way to recalibrate power imbalances, hence, crucial to include in what it means to be open. </p>"},{"id":"64213aed261a1e6be45d3020","title":"The case of professor Susanne Täuber (s03e04)","link":"https://libscie.org/open-update-s03e04/","published":"Tue, 28 Mar 2023 07:00:20 GMT","description":"In season 3, episode 4, we talk through the case of professor Susanne Täuber and try to make some sense of it.","isPermalink":false,"tags":["Open Update","Labs"],"authors":[{"name":"Chris Hartgerink","url":null}],"image":"https://images.unsplash.com/photo-1608377789057-6095aa84bf55?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=MnwxMTc3M3wwfDF8c2VhcmNofDJ8fGdyb25pbmdlbnxlbnwwfHx8fDE2Nzk5NDgzMDQ&ixlib=rb-4.0.3&q=80&w=2000","modified":null,"contentHtml":"<div class=\"kg-card kg-callout-card kg-callout-card-grey\"><div class=\"kg-callout-emoji\">&#x1F508;</div><div class=\"kg-callout-text\">This is the transcript of the Open Update. Find the original audio on <a href=\"https://podcasters.spotify.com/pod/show/open-update/episodes/The-case-of-professor-Susanne-Tuber-s03e04-e2177ie\">Anchor.fm</a>.</div></div><img src=\"https://images.unsplash.com/photo-1608377789057-6095aa84bf55?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=MnwxMTc3M3wwfDF8c2VhcmNofDJ8fGdyb25pbmdlbnxlbnwwfHx8fDE2Nzk5NDgzMDQ&ixlib=rb-4.0.3&q=80&w=2000\" alt=\"The case of professor Susanne T&#xE4;uber (s03e04)\"><p>[00:00:00] <strong>Chris Hartgerink:</strong> &#xA0;Hi, and welcome to the Open Update. For Liberate Science. I'm Chris Hartgerink.</p><p>[00:00:03] <strong>Sarahanne Field:</strong> I'm Sarahanne Field.</p><p>[00:00:05] <strong>Chris Hartgerink:</strong> In the Open Update we talk about power imbalances in research and society more broadly. We're in the fourth episode for this season; today we will talk about the case of Professor Susanne T&#xE4;uber, who was recently fired from the Dutch University of Groningen after being employed there for 14 years. This employment started back in 2009, and we want to dive into the origins of this situation, why it's relevant within the discussion of power imbalances. </p><p>That's pretty much a spoiler to the whole episode. It's not just a regular firing because something happened, it's deeper and it's getting a lot more traction as a result of it. This case specifically is very important regarding the effects of trying to struggle for equity. The case is getting some attention in Groningen, in the Netherlands, but not so much beyond it. We felt that because Sarahanne is going to go to University of Groningen and I am Dutch by origin, so I can read the court case that, this would be a great opportunity to relay some of this information to you, our audience.</p><p>We're gonna dive in. We're gonna try and do our best in those 15 minutes. We're also gonna be chatting a bit about what this does with incoming staff at the university.</p><p>To start us off with this case it really is important to set the stage around who Susanne T&#xE4;uber is, because Susanne T&#xE4;uber is a scholar who's very well known for their work on social safety in the workplace. Working on reports highlighting a lack of it and working for gender equity. For example, for <a href=\"https://www.rug.nl/research/young-academy/files/yag-report-harassment-at-the-ug.pdf\">the Young Academy of Groningen she documented events of sexism and beyond</a>. She is also a vocal critic of systemic issues. When we talk about the patriarchy, sexism at institutions beyond just the university and really trying to undo some of those effects as well.</p><p>As many academics know, an academic career isn't easy. You start off, you try to find a tenure track position or a postdoc. Then if you wanna stay in academia, you have to go through a certain mill of requirements to be able to get to the next stage to be promoted.</p><p>Professor T&#xE4;uber to was situated within Groningen through a gender equity program, the Rosalind Franklin Fellowship, to make sure that more women, became professors at the university. That's an important bit of context within this case. What happened over the years is that there were conversations around what is required to be promoted, and one of the points being that there were shifting goalposts. So there would be requirements, say you need to publish four papers and these journals, and then subsequently it would either be very close to those requirements or even pass them, and then there would be new requirements.</p><p>I don't know about you, Sarahanne, but that does sound frustrating,</p><p>[00:03:13] <strong>Sarahanne Field:</strong> Yeah, of course. Absolutely.</p><p>[00:03:15] <strong>Chris Hartgerink:</strong> As a result, there was this statement in a evaluation conversation \"okay, you need to publish more in high impact journals.\" We disagree with the idea of high impact journals, but okay. There's many details we can't go into, but there was a paper back in 2020 in the Journal of Management Studies, which in regular vernacular it has an impact factor of almost 10, I believe.</p><p>If I remember correctly that's quite high impact.</p><p>[00:03:43] <strong>Sarahanne Field:</strong> It is.</p><p>[00:03:44] <strong>Chris Hartgerink:</strong> So this is a result of these conversations as well, having to publish in high impact journals. This paper is open access, so if you want to read it, we'll provide a link, but it's called <a href=\"https://doi.org/10.1111/joms.12516\">\"Undoing Gender in Academia, personal Reflections on Equal Opportunity Schemes.\"</a></p><p>This is where, what I just said, the Rosalind Franklin Fellowship is a very important part. These personal reflections, they relate to the experience at the University of Groningen, which, if you are a woman at an institution, it's very likely you're gonna experience the effects of a sexist system.</p><p>In this paper, some of these systemic effects and how they took place in Susanne T&#xE4;uber's life are made explicit. That was really the start of a big problem for the employers at the university. They took this as personal accusations of sexism and subsequently said that these were unfounded and that this disturbed the employment relationship.</p><p>That, in a nutshell, is the idea of why Susanne T&#xE4;uber was fired. </p><p>So Sarahanne, and when I say this what does this case make you feel like on a very visceral basis?</p><p>[00:05:02] <strong>Sarahanne Field:</strong> For me it's, it's, I feel a lot of things, you know, because on the one hand, from the perspective of being an incoming faculty member, I start my position in August with the University of Groningen.</p><p>I did my PhD and my research master at the University of Groningen. I've taught there previously. I'm really proud of the university. In the last years it has made a lot of steps towards open science improvements towards recognizing science reform. One of the key things that I'll be doing there as a faculty member is pursuing my own research in the science reform movement. In the CWTS Leiden ranking, of the universities in the Netherlands, shows that it comes first in open access publications. It's about 87 or 88% of the publications that come out of the RUG are open access, which I think is really great.</p><p>There are a lot of elements that I'm really proud about the University of Groningen for. </p><p>But this is obviously really troubling and I think this says, a lot. It's, it's a real big indictment, of universities, in general. Universities are about learning to be critical, right? They're about learning to, to speak and learning to, to think critically about issues in society, about systemic issues in particular, I think. </p><p>I dislike that a court in the Netherlands can just say, \"oh yeah, we, we think this person can be fired on the basis of a damaged employer-employee relationship.\" I find it problematic, the idea that such a relationship can be damaged by being critical. That the employer-employee relationship between a university and a faculty member, that that can be damaged irreparably by the employee speaking critically. Not about the university per se, but about a program within the university that caused her problems and caused her, upset in the past.</p><p>That is troubling to me.</p><p>[00:06:58] <strong>Chris Hartgerink:</strong> It's very important that you share this because I think this is a sentiment that goes around a lot. On Twitter and on Mastodon, there was this hashtag #AmINext, by people who were following this and they asked themselves \"well, if I speak up, does that mean I disrupt my employment relationship and that I can be fired as well?\"</p><p>I know for myself and from my own experience, that this disrupted employment relationship is something that <em>is</em> utilized. At my old university, I was told that if I did a certain thing that it would disrupt the employment relationship and steps would be taken. So in that sense, it really goes through this fundamental of academic freedom in that sense.</p><p>Can you say what is necessary? Not even just academic freedom, but also freedom of speech. And I'm not the first person who will start talking about freedom of speech that often. There's another case, that was highlighted as well where there was a regional vocational school and there somebody was also fired for a disrupted workplace relationship for something they said . That ultimately went through appeals processes to the European Court of Human Rights, and they said that it was invalid that they were fired on these grounds because, if employment sanctions are in response to speech, it infringes on the right to freedom of speech. So I find that very interesting in this case.</p><p>And also to highlight that, Susanne T&#xE4;uber is trying to make an appeal as well, and there's <a href=\"https://www.gofundme.com/f/crowdfunding-campaign-to-support-susanne-tauber\">a crowdfunding campaign to make that happen</a>. We'll be sure to make that link available as well.</p><p>14 years into an employment relationship means something big needs to happen for that to, to be dissolved. And in the Netherlands, it is the case that when this disrupted employment relationship, is a valid reason to fire somebody legally, right? Not ethically per se, then there will be some compensation necessary because the person who is bearing the brunt of this is not gonna be the institution, it's gonna be the individual.</p><hr><p>[00:09:02] <strong>Chris Hartgerink:</strong> I checked out this original paper and there's plenty of people who have read this already, but it's just seven pages.</p><p>It's really, really quite short. You could probably read it in like 20 minutes. And there is no, no personal accusations in this. It's very fascinating to see that apparently these employers felt very personally affected by this.</p><p>I wanna highlight something that recently came to mind again, is this idea of, misogyny as the policing mechanism of the patriarchy. So the male dominance, and this is really that it punishes, women specifically, but in general punishes people who speak out against male dominance. And this really made me, remember this concept from Kate Manne in the book Down Girl specifically, that there is Susanne T&#xE4;uber speaking out about these issues. And then subsequently it's being policed, by way of legal procedures.</p><p>[00:09:57] <strong>Sarahanne Field:</strong> Another thing that this makes me think of is the fact that you hear so many cases where a male faculty member has been in trouble for harassing either students or other female, members of staff and they remain employed or, they get a smack on the wrist, but, but they still basically remain in, in good graces with the university</p><p>It feels offensive, unbelievable to me that someone can be fired seemingly so easily by just being critical about a program at a university. Yet, people who commit documented harassment, that they can just retain their employment.</p><p>I've heard of so many cases like this, it's not just an isolated instance. That kind of rubs me up the wrong way as well.</p><p>[00:10:42] <strong>Chris Hartgerink:</strong> This is a very good point because what is necessary to disrupt the employment relationship? Who is the employer and what is being disrupted?</p><p>If that is from this position of power, then that's gonna be validated by saying \"that's not a disruption of that employment relationship.\" But vice versa, if somebody's trying to change something, then that is much more threatening to the employers, so that disrupts the relationship.</p><p>[00:11:07] <strong>Sarahanne Field:</strong> To me, it would've been good for them to retain Susanna T&#xE4;uber as an ally, as a way of saying \"Look, we value employees that hold us up to scrutiny\" and to use her scholarship as a way of criticizing themselves and interrogating their own practices and becoming better. I think that would've been a really good way for the university to use her scholarship and to use her thinking.</p><p>So it's disappointing to me also that that was not an opportunity taken, but rather they saw her as a threat.</p><p>[00:11:43] <strong>Chris Hartgerink:</strong> Part of this is also the point that it's not about the individual case, it's about the system. </p><p>If I read this court case, both parties, Susanne T&#xE4;uber and the university, they agree the employment relationship has been disrupted. They don't contest that either way and every side has failures. But here the clear power imbalance is that the university is an institution and the professor is not. It's the punching down idea very much. It's so prototypical of what happens in many places. And this is one of the few times where it played out, from my recollection, as publicly as it has in result to a academic publication, which is really astounding.</p><p>[00:12:31] <strong>Sarahanne Field:</strong> I wonder what the university will do because obviously, I mean, I would be surprised if it would be able to just ignore the activism and the protesting that's gone on as a result of this. Do you have any forecasts?</p><p>[00:12:45] <strong>Chris Hartgerink:</strong> Many institutions will mitigate risk, and that will mean they will deflect, distract. But I feel like they're not really responding at this moment. They always will say \"because the legal procedure is pending.\" There will be an appeal.</p><p>The communications department of the university is never really gonna provide us with an honest answer on this, I'm afraid because, having a frank discussion about this is incredibly difficult. If they would do it, it would be really good for them because I think this is the crux here. To really make steps in in these systemic issues, you need to have those spaces to really have tough conversations, work through it, and resolve that conflict to the degree that it's not necessarily a compromise, but that things move forward.</p><p>[00:13:28] <strong>Sarahanne Field:</strong> What do you think is preventing that? Like what do you think is preventing the university from, from taking such an unprecedented step? What would prevent them from doing that?</p><p>[00:13:41] <strong>Chris Hartgerink:</strong> What prevents a lot of institutions from doing that, I think, is partly imagination. Simply the fact that the procedures are set up to deal with things to mitigate risk and to minimize the issues. And I think that's, where places such as Amsterdam, the municipality, or, and this is also not without flaw, the Dutch government, apologizing for slavery, have more broadly thought about how, these systems of white supremacy affect the current day people in the world. I think there is opportunity to do this, but it really requires imagination and a lot of courage to do this. After a decade or 15 years of cutting costs, there isn't much space to do.</p><p>It is ultimately about the university as a business. You need to cut costs, gain income and make sure that, stuff keeps running and you perform well in the rankings, and then it's very hard to do this. </p><p>I would say, the work that we do is inherently related to these issues as well. We are, by improving research and improving the conditions for research, we're creating space for these things to even be possible.</p><p>I'm encouraged by these events to do more.</p><p>[00:14:55] <strong>Sarahanne Field:</strong> Mm-hmm. Yeah. I'm, I'm still very pensive about it. With the shroud of secrecy that still remains in place around things like this. I mean, we have details of the court case, but still there's a lot of details that have been obscured from the public knowledge. Just makes me wonder what other things went into this and how to navigate those myself. Because I don't wanna be fired. Certainly not for speaking out. I have to believe that it's more than just this, this paper and the conflict that arose about her promotion. I don't know. I'm just very pensive about it.</p><p>[00:15:53] <strong>Chris Hartgerink:</strong> From my own experiences, there probably isn't much more information that can be gotten to that will explain it to you. These are incomprehensible, conflicts. And, people have these feelings and they feel offended. They feel defensive, they feel accused. And then subsequently that escalates. I specifically talk about the employer's position here. For example, \"by helping the male protege up the organizational ladder, the senior academic can expect general generosity later.\" I think this is one of those quotes where, if you are a senior academic helping or potentially helping a male protege, you're not sure whether you've done that, whether you have privileged them, then you might feel very insecure.</p><p>Instead of dealing with those feelings of uncertainty, does my behavior indeed promote, men over women, that implicit bias then it's a possibility that you lash out. I think these relationships are very complicated. We try to stay in an employment relationship for longer, especially at academic universities, but we'll have to see how this plays out.</p><p>Additional information is really not gonna make it much clearer because the problems seems very fundamental. </p><p>We're at risk of making this a long episode. So we'll be rounding up for this episode today. We will be following this case along. If there's any new developments that are important to share with you, we will. We hope that you learned something about this case. If you feel like we missed something, please do let us know. We are happy to make corrections. </p><p>We will be back in another two weeks with the next episode, and we are not yet sure what we'll be talking about then. If you have recommendations, please do get in touch probably really fast because the recording isn't happening on the day of because we have to do editing. With that please don't forget to rate us on your podcast provider of choice if you have not done so. Subscribe, tell people about the Open Update, if you think this is interesting. We will be back in two weeks. And yeah. Sarahanne, thanks for chatting about this difficult topic.</p><p>[00:18:08] <strong>Sarahanne Field:</strong> Yeah, thanks for sharing as well.</p>"},{"id":"6411d6e2261a1e6be45d2f13","title":"Partnering with PubCasts","link":"https://libscie.org/partnering-with-pubcasts/","published":"Tue, 21 Mar 2023 08:00:15 GMT","description":"ResearchEquals partnered with Pubcasts to make it easier to make your audio-articles part of your research portfolio.","isPermalink":false,"tags":["ResearchEquals"],"authors":[{"name":"Liberate Science","url":null}],"image":"https://libscie.org/content/images/2023/03/2023-03-15-ResearchEquals----PubCasts-1-.png","modified":null,"contentHtml":"<img src=\"https://libscie.org/content/images/2023/03/2023-03-15-ResearchEquals----PubCasts-1-.png\" alt=\"Partnering with PubCasts\"><p>Research communication comes in many forms &#x2014; traditional text based publishing cannot accommodate to all the needs of new, non text-based forms of communication. Audio-articles, also called <a href=\"https://en.wikipedia.org/wiki/Pubcast\">pubcasts</a>, are one such form.</p><p>We&#x2019;re happy to announce ResearchEquals is partnering with <a href=\"https://coastalroutes.org/pubcasts\">PubCasts</a> to stimulate, &#xA0;develop, and support the publication of audio-articles in our community.</p><p>The Pubcast initiative is led by <a href=\"https://www.researchequals.com/fishpeopleplace\">Hannah Harrison</a> and <a href=\"https://www.researchequals.com/conservechange\">Philip Loring</a>, who started making audio versions of their own articles. They started uploading them to <a href=\"https://soundcloud.com/conservechange/sets/pubcasts\">Soundcloud</a> several years ago, making them accessible to everyone for free.</p><p>In our partnership, we take the next step to also make pubcasts easy to cite and easy to include in a researcher&#x2019;s portfolio. This makes them first-class research outputs. To that end, we introduced a new module type &#x201C;pubcast&#x201D; on ResearchEquals, allowing you to publish your audio recordings under the appropriate category. Each pubcast gets its own DOI and we take care of archiving them. We also integrated a basic audio player so you can directly play those files from within ResearchEquals.</p><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img src=\"https://libscie.org/content/images/2023/03/Screenshot-2023-03-15-at-14.59.21.png\" class=\"kg-image\" alt=\"Partnering with PubCasts\" loading=\"lazy\" width=\"1088\" height=\"262\" srcset=\"https://libscie.org/content/images/size/w600/2023/03/Screenshot-2023-03-15-at-14.59.21.png 600w, https://libscie.org/content/images/size/w1000/2023/03/Screenshot-2023-03-15-at-14.59.21.png 1000w, https://libscie.org/content/images/2023/03/Screenshot-2023-03-15-at-14.59.21.png 1088w\" sizes=\"(min-width: 720px) 720px\"><figcaption>A screenshot of the pubcast <a href=\"https://doi.org/10.53962/tqv8-3raw\" rel=\"noopener noreferrer\">&#x201C;Alternative Seafood Networks During COVID-19&#x201D;</a></figcaption></figure><p>For those interested to create their own pubcasts, Hannah and Phillip created a protocol to support you in creating your own. You can find and cite <a href=\"https://doi.org/10.53962/hzk8-8ytf\">their protocol on ResearchEquals</a>. They are also <a href=\"https://www.researchequals.com/collections/zw5c-fx\">curating a collection of pubcasts</a>, which you can follow or submit your own pubcasts to! A slight note: We still limit files to 100MB at most, so process your audio files to make them smaller (we're happy to help you with that).</p><p>We are excited to support new ways of communicating research and making sure they are considered first-class research objects.</p><p>Do you have needs for your research communication? We are always on the lookout for new and exciting forms of research communication we can accommodate in ResearchEquals. Get in touch via <a href=\"mailto:info@libscie.org\">info@libscie.org</a>.</p>"},{"id":"640f1984261a1e6be45d2d3a","title":"How does who you are influence how you explore the world? (s03e03)","link":"https://libscie.org/how-does-who-you-are-influence-how-you-explore-the-world-s03e03/","published":"Tue, 14 Mar 2023 08:00:22 GMT","description":"&#x1F508;This is the transcript of the Open Update. Find the original audio on Anchor.fm.[00:00:00] Chris Hartgerink: Welcome to the Open Update season three. I'm one of your hosts, Chris...","isPermalink":false,"tags":["Open Update","Labs"],"authors":[{"name":"Chris Hartgerink","url":null}],"image":"https://images.unsplash.com/photo-1516373829531-29d21ac7f9d6?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=MnwxMTc3M3wwfDF8c2VhcmNofDEzfHxyZWZsZWN0aW9ufGVufDB8fHx8MTY3ODcxOTg4NA&ixlib=rb-4.0.3&q=80&w=2000","modified":null,"contentHtml":"<div class=\"kg-card kg-callout-card kg-callout-card-grey\"><div class=\"kg-callout-emoji\">&#x1F508;</div><div class=\"kg-callout-text\">This is the transcript of the Open Update. Find the original audio on <a href=\"https://podcasters.spotify.com/pod/show/open-update/episodes/How-does-who-you-are-influence-how-you-explore-the-world--s03e03-e20b7sk\">Anchor.fm</a>.</div></div><!--kg-card-begin: markdown--><img src=\"https://images.unsplash.com/photo-1516373829531-29d21ac7f9d6?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=MnwxMTc3M3wwfDF8c2VhcmNofDEzfHxyZWZsZWN0aW9ufGVufDB8fHx8MTY3ODcxOTg4NA&ixlib=rb-4.0.3&q=80&w=2000\" alt=\"How does who you are influence how you explore the world? (s03e03)\"><p>[00:00:00] <strong>Chris Hartgerink:</strong> Welcome to the Open Update season three. I'm one of your hosts, Chris Hartgerink</p>\n<p>[00:00:11] <strong>Sarahanne Field:</strong> And I'm your other host, Sarahanne Field.</p>\n<p>[00:00:13] <strong>Chris Hartgerink:</strong> Throughout season three, we are bringing conversations about power imbalances in research and society to you. So thank you for choosing to spend your time with us here on the podcast.</p>\n<p>By discussing power imbalances from all kinds of angles we want to stimulate you, but also ourselves, to look at the world around us in terms of power. Because how can we improve the world we live in by taking this lens? How can it change how we see things and the problems we see, the problems we even want to try and solve to begin with. That's what we'll do today as well.</p>\n<p>We will discuss the following question</p>\n<blockquote>\n<p>Does your personal context influence how you explore the world?</p>\n</blockquote>\n<p>Sarahanne, can you kick us off with this question? Because I think this is one of your pieces of expertise that you bring to the Open Update in season three.</p>\n<p>[00:01:13] <strong>Sarahanne Field:</strong> So when we're conducting research, as you say, when we're exploring the world around us in terms of answering questions and solving problems, we bring with us into this endeavor, a lot of ourselves. What we think is important is very much influenced by what we've experienced.</p>\n<p>In this episode, when we talk about positionality, we're basically talking about the idea of a disclosure of how someone's, for example, background, their gender, how they influence, their exploration of the world and, and solving problems.</p>\n<p>Often in research we kind of convert this information into a statement: a positionality statement. So that's what we're referring to when we talk about this topic, when we talk about this issue.</p>\n<p>[00:02:05] <strong>Chris Hartgerink:</strong> I'm trying to reflect this back on myself. Would positionality be something along the lines of I come from a working class family, I'm a first generation student, so I was the first person in my family to go to university, I'm white from a western country?</p>\n<p>Are those all things that would be included or would there be deeper things that could also be a part of your positionality or personal context statement?</p>\n<p>[00:02:33] <strong>Sarahanne Field:</strong> Not just your roots, but also what you've been through between being born and being here today. Both can influence how you judge other experiences that you come across, how you interpret what other, what other people say, how you interpret information.</p>\n<p>[00:02:49] <strong>Chris Hartgerink:</strong> Maybe we have listeners who might be super informed about this already and listeners who are even just starting to explore this idea or hear it for the first time.</p>\n<p>Could you in rapid fire, give us a few of these contexts that people might think about, as applying to themselves in terms of what shapes, how they view the world?</p>\n<p>[00:03:12] <strong>Sarahanne Field:</strong> So for example, whiteness, that's a big one. For me, for example, I was brought up in a wealthy country, in Australia. I was born into a middle class family. I had no trouble being fed and and going to a good school.</p>\n<p>I'm now in an institute in a wealthy white nation. Just the color of my skin and the whiteness of my experience growing up and becoming an academic, that really influences how I perceive things and what I prioritize, say with my own research. It's easy to forget that whiteness when I'm exploring the world and when I'm identifying problems and that the approach I take to solving them.</p>\n<p>My gender, for example. Being a woman in academia comes with its own challenges. That's another thing that people forget about, I think, because, for some people, especially cisgender people, we are born into a particular, context in that sense. we're used to that.</p>\n<p>We're used to being identified by others with that context in mind. And so it's also easy to forget that as well.</p>\n<p>[00:04:23] <strong>Chris Hartgerink:</strong> When you say cis, it's the gender you're identified with other people matches your own.</p>\n<p>[00:04:28] <strong>Sarahanne Field:</strong> Indeed.</p>\n<p>[00:04:30] <strong>Chris Hartgerink:</strong> I also did a very quick Google on some of these aspects to give people some more (<a href=\"https://science.nasa.gov/files/styles/background_image_file_size/public/thumbnails/image/academic%20wheel%20of%20privilege.JPG?itok=Jp0QfgtW\">see the Academic wheel of privilege for example</a>). I think you mentioned a few very important ones. some other aspects that might also be included is, you talked about gender, sexuality. Gender and sexuality are very different</p>\n<p>We also talked about the formal education. Your career stage can matter. The amount of resources or funding you have, very applicable in research.</p>\n<p>Caring duties, whether you're housed or not. Language, religion. Body size, mental health, and whether you're disabled or non-disabled.</p>\n<p>We can keep going, but just to give you something to skip back a few times in case you, you wanna, think about these things more specifically.</p>\n<p>That's a great introduction to this personal context. While we were preparing for this podcast, you mentioned there has been discussion around this, right? Not everyone agrees that this is something that people should, necessarily talk about or reflect on. Could you talk a bit more about the discussion that has been going around on, around this, whether personal context matters and whether we should disclose</p>\n<p>[00:05:43] <strong>Sarahanne Field:</strong> There are diverging opinions about how useful or indeed, even how valid positionality actually is. So some people are of the opinion that the backstory, someone's backstory, someone's context, has absolutely no bearing on the research that they do.</p>\n<p>That includes, you know, why they're doing that research, the topics they've chosen, how they conduct the research, how they disseminate the findings. On the other hand you have say people who have a constructivist approach in research. They tend to disagree and say well, there's value in trying to understand how someone's background and experiences influence how they do research, how they, again, coming back to that idea of exploring the world.</p>\n<p>[00:06:36] <strong>Chris Hartgerink:</strong> You mentioned constructivism. Many people, myself included, have a lot of problem understanding a lot of isms, because they represent so much more than the word alone. Just to make sure I understand, and our listeners understand, what do you mean by that?</p>\n<p>[00:06:53] <strong>Sarahanne Field:</strong> Basically constructivism, considers the way that we process information. It's not just passively taking in information. Our brains don't just absorb information, but we actually construct knowledge. As we experience the world, we process these experiences, we build a representation of what the world is.</p>\n<p>As you might imagine, the idea that all of these experiences that, that bring us to our understanding of the world, the idea that a constructivist might like the idea of positionality makes a little bit more sense when you think about, about that.</p>\n<p>[00:07:30] <strong>Chris Hartgerink:</strong> That makes a lot of sense. And apparently I indeed did not understand the word completely!</p>\n<p>We said this season was gonna be about power imbalances. Personal context, power imbalances quickly leads me to also think about privilege, which for a lot of people, if you have a rough life, then it can quickly feel like I don't have privilege.</p>\n<p>This idea of personal context, relating to power imbalances and how does that view how we see the power in the world around us. And also recognizing our own story in that how power has influenced and privilege has influenced where we have gotten, is a very, very critical one for the discussions that we want to have.</p>\n<p>I wonder whether when we talk about positionality, but in terms of research, when we think about privilege and power imbalances, how that affects your work --- where does the story you tell about yourself come in? I think this would be something that you would call also reflexivity?</p>\n<p>[00:08:54] <strong>Sarahanne Field:</strong> In a nutshell, cause there's an entire huge body of literature on reflexivity, but in a little cute nutshell, reflexivity is basically, it refers to an active process of reflecting on yourself and in this particular context of reflecting on yourself. as a researcher that is part of the research process.</p>\n<p>So we're humans that are conducting research typically, at least in the social sciences on other human beings. And so doing that kind of research without any sort of thought process into our position as the researcher in that process, cuz we're, we're interpreting this information right. Setting out these questions or these, these hypotheses. Then we're choosing methods to explore these questions. And then we are collecting these data and interpreting these data with the lens of our own humanity right there in the form. So the idea of reflexivity is to sort of say, okay, where do I sit in that process and how does, how do I, as the researcher in the middle of that?</p>\n<p>How do I do this? This role of the researcher?</p>\n<p>[00:10:13] <strong>Chris Hartgerink:</strong> As you talk about this, I keep thinking about the Many Analyst Project. If perspective, personal context, or how you explore the world, doesn't matter, then it should be a logical next step that whoever does the analysis of the same question shouldn't matter either.</p>\n<p>But from this Many Analyst study, the conclusion came that it varied a bunch. We can ask this question, why does it vary? That's a very interesting one, and I think that, you bringing up this point of reflexivity, reflecting on how our personal context might influence the choices that we make. It is a very interesting one, marrying this idea of power imbalances with the variability in results in a super practical setting. Taking this as a way to look at these problems, this lens of looking at the world and how to change it, it immediately changes the question of why is there variability to begin with, to where did it come from? That's a very interesting lens also to not just tackle questions of how do people relate within research or in the world more broadly, but also in terms of the reproducibility issues even.</p>\n<p>I hadn't thought of that before we had this conversation.</p>\n<p>To start wrapping up slowly, are there points, because you're very well-versed in this. You gave us a very good short recap of reflexivity and positionality, this personal context and how it influences the story that you tell. But also of what interests you. Are there any things top of mind that you'd like to leave with the listeners?</p>\n<p>[00:12:14] <strong>Sarahanne Field:</strong> There are a lot of things that I'd really like to say. One thing I've noticed in this discourse is the question of, okay, so I'm in a quantitative research discipline. You know, these kinds of people tend to question the value of using reflexivity and using positionality.</p>\n<p>Now just to link those two very quickly together, uh, reflexivity is in a way a precursor to positionality. You use the reflections that you develop about yourself to sort of, Make concrete some of these ideas about how your context influences your research and you make them concrete through a positionality statement.</p>\n<p>Do you kind of operationalize or deploy reflexivity in a positionality statement? And a lot of people in the quantitative research areas say \"well, how can I really do that? This isn't something we really do.\" One sort of thinking point for listeners that I'd like to sort of leave them with is, Okay, so maybe positionality in terms of the concrete positionality statement. I am this person. I have these characteristics and these influence my research in this paper in such a way, for example, That might not work for you.</p>\n<p>My question would be, okay. How would you, in your particular research context, um, operationalize reflexivity in a way that works for you?</p>\n<p>Would you just engage in thinking about how you influence the research process or would be, would there be a way to make that concrete or to reify it at all? Because I think often at the heart of these things, at the heart of these pushes to do this in the research process, oh, you should do  this, you should make a positionality statement. Cause we're seeing this a little bit. In grant proposals, in papers for some journals, we're seeing, you know, requests for positionality statements.</p>\n<p>But it's difficult to, to make that meaningful if you don't really know how you can do it yourself.</p>\n<p>So just, yeah, just thinking about how you would do reflexivity, in a way that made sense to you for your particular discipline. That's something that I'd, I'd sort of like to prompt listeners with.</p>\n<p>[00:14:28] <strong>Chris Hartgerink:</strong> As you said this, I was also reflecting on how I explore the problems in the world differently now than say, five years ago. Trying to articulate that change, my own progress, also helps me to understand what influences my personal context in that sense.</p>\n<p>With that, we will close out this conversation around personal context and how we explore the world. And then of course, specifically we are researchers within a research context. But that can also happen outside of research, of course.</p>\n<p>We want to leave you with a bit of an exercise. You know, it's not homework, we're not gonna check you on it, it's in two weeks. We did say we want to stimulate ourselves, but also you to think about these things. So what are some of the potential pieces of personal context that influence how you explore the world around yourself?</p>\n<p>It isn't an easy topic, when we talk about whiteness or our gender or our sexuality, especially when you deviate from the default. it also means that the people in the default very often don't have to talk about these things. So if you, if you feel like it, it isn't easy, please do put in a bit of effort, even just for yourselves. You don't need to. Because it's interesting to keep the discussion going. We cannot expect ourselves to be good at something if we never really train it.</p>\n<p>Thank you again for choosing to spend your time with us. We don't take that for granted. We will be back in two weeks if you choose to spend your time with us again with another episode of the open update. Until then!</p>\n<p>[00:16:25] <strong>Sarahanne Field:</strong> Take care!</p>\n<!--kg-card-end: markdown-->"},{"id":"63f5e4d7261a1e6be45d29a1","title":"ResearchEquals Supporting Memberships","link":"https://libscie.org/researchequals-supporting-memberships/","published":"Thu, 09 Mar 2023 08:00:02 GMT","description":"ResearchEquals supporting memberships are available. Sign up to shape how ResearchEquals evolves.","isPermalink":false,"tags":["ResearchEquals"],"authors":[{"name":"Liberate Science","url":null}],"image":"https://images.unsplash.com/photo-1501770118606-b1d640526693?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=MnwxMTc3M3wwfDF8c2VhcmNofDJ8fHN1cHBvcnR8ZW58MHx8fHwxNjc4MjkwNjkw&ixlib=rb-4.0.3&q=80&w=2000","modified":null,"contentHtml":"<img src=\"https://images.unsplash.com/photo-1501770118606-b1d640526693?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=MnwxMTc3M3wwfDF8c2VhcmNofDJ8fHN1cHBvcnR8ZW58MHx8fHwxNjc4MjkwNjkw&ixlib=rb-4.0.3&q=80&w=2000\" alt=\"ResearchEquals Supporting Memberships\"><p>In this blog, we explain what <a href=\"https://www.researchequals.com/supporting-member\">ResearchEquals Supporting Memberships</a> are, why we are <a href=\"https://libscie.org/introducing-supporting-memberships/\">(re)introducing them</a>, and how you can become an individual or institutional supporting member.</p><p>It is clear to us that what we are doing with ResearchEquals is not a technological change, it is a social one &#x2014; that means your involvement matters. </p><h2 id=\"what-is-a-supporting-membership\">What is a supporting membership?</h2><p>Supporting memberships are a community based approach to how ResearchEquals evolves. They come with membership dues (&#x20AC;79.99 per year or &#x20AC;9.99 per month) and together we build a network of people with one common denominator: To make all research work visible.</p><p>As a supporting member, you get front row in shaping ResearchEquals. Every member has equal voice regardless of whether you are a professor, junior researcher, citizen scientist, or even an institute. <strong>One member, one vote.</strong></p><p>With a supporting membership <a href=\"https://www.researchequals.com/20230221terms-diff#supporting-membership\">you also get certain rights</a>:</p><ol><li>The right to request information</li><li>The right to petition for action or to desist action</li><li>The right to block third party acquisitions</li></ol><p>This means that supporting members get to be more informed, have a direct line to make specific things happen, and provide a counterweight to the many acquisitions we see by big corporations. The right to block third party acquisitions is legally implemented in our <a href=\"https://researchequals.com/legal/poison-pill\">Poison Pill Agreement</a>.</p><p>Supporting members are convened at least four times a year at our <a href=\"https://libscie.org/introducing-our-event-policy/\">virtual-first</a> General Assemblies. Here we celebrate achievements, provide updates on our business development, hold space for tough conversations, and get to know our accomplices no matter where they are coming from. Every assembly is a unique opportunity to shape ResearchEquals together.</p><h2 id=\"why-supporting-memberships\">Why supporting memberships?</h2><p>Community is serious business and trust needs to be built continuously.</p><p>We want you to be able to trust we're in this for the right reasons. The Poison Pill Agreement sets a clear message: No shares may change hands without supporting members&#x2019; consent. If they do, there will be a financial penalty equal to the sum of the transaction, which goes directly to the supporting members.</p><p>The Poison Pill means that if shares would be sold (without consent) for ten million euro&#x2019;s with 100 supporting members at that time, each supporting member would receive a &#x20AC;100,000 penalty fee from the business. This makes any transaction without the consent of supporting members much less attractive to begin with. The poison pill helps prevent a non-agreeable situation from happening.</p><p>We also want to imagine, realize, and promote more just futures together with you. Supporting members will be consulted at general assemblies about how to allocate future profits. Are there projects we could support as a community? Are there things we think need to be experimented with? What could we imagine if we have &#x20AC;100,000; a million; ten million? We are not there (yet), but we dream big and we imagine of what we can achieve together.</p><p>We see supporting memberships as a way to train all of us to organize. ResearchEquals cannot change for any one individual only, yet we need a way to decide what we collectively want. We cannot make impactful changes alone, yet if we keep talking about what each of us individually thinks, we will not be able to make collective decisions when we disagree. When profits arrive, we need to be able to decide what to do with them. We need training.</p><p>Finally, one key motivation: <a href=\"https://earthbound.report/2018/01/15/elinor-ostroms-8-rules-for-managing-the-commons/\">Commons</a> based approaches only work when there is a clearly defined boundary. Who is entitled access to what? ResearchEquals remains an open-source project, but we cannot cater to everyone all the time. Supporting memberships permit us a clear boundary of the commons we are building.</p><h2 id=\"where-do-i-sign-up\">Where do I sign up?</h2><p>You are able to sign up for your own Supporting Membership right now, directly in ResearchEquals. When you go to the <a href=\"https://researchequals.com/dashboard\">ResearchEquals dashboard</a>, you can sign up through the &#xA0;following action:</p><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img src=\"https://libscie.org/content/images/2023/02/Screenshot-2023-02-22-at-11.17.22.png\" class=\"kg-image\" alt=\"ResearchEquals Supporting Memberships\" loading=\"lazy\" width=\"858\" height=\"250\" srcset=\"https://libscie.org/content/images/size/w600/2023/02/Screenshot-2023-02-22-at-11.17.22.png 600w, https://libscie.org/content/images/2023/02/Screenshot-2023-02-22-at-11.17.22.png 858w\" sizes=\"(min-width: 720px) 720px\"><figcaption>How to sign up on the ResearchEquals dashboard. Alternatively, you can sign up through the \"Account\" tab in the settings.</figcaption></figure><p>Organizations can become supporting members too &#x2014; for a minimum yearly contribution of &#x20AC;2,500. Each organization's logo will be displayed on the ResearchEquals website as a supporting member and one representative will get access like everyone else. Contact our CEO directly at <a href=\"mailto:ceo@libscie.org\">ceo@libscie.org</a> to start the conversation for your institution or tell them who to reach out to if you'd like your institution to support ResearchEquals.</p><p>And if after all this, you need more information, we are here for you. You may also want to <a href=\"https://www.researchequals.com/supporting-member\">check out our newest page on ResearchEquals</a> dedicated to the main points of a supporting membership.</p><p>Thanks for reading this far &#x2013; we appreciate you!</p>"},{"id":"64060bca261a1e6be45d2b55","title":"Supporting DORA’s 10th Anniversary","link":"https://libscie.org/supporting-doras-10th-anniversary/","published":"Tue, 07 Mar 2023 08:00:35 GMT","description":"A decade ago, the San Francisco Declaration on Research Assessment launched. I know I referenced it a lot in my efforts to improve research, and I bet many of you did too!It is with great pride I can announce...","isPermalink":false,"tags":["Consulting"],"authors":[{"name":"Chris Hartgerink","url":null}],"image":"https://libscie.org/content/images/2023/03/dora.webp","modified":null,"contentHtml":"<img src=\"https://libscie.org/content/images/2023/03/dora.webp\" alt=\"Supporting DORA&#x2019;s 10th Anniversary\"><p>A decade ago, the San Francisco Declaration on Research Assessment launched. I know I referenced it a lot in my efforts to improve research, and I bet many of you did too!</p><p>It is with great pride I can announce Liberate Science is working with DORA to make their 10 year celebration a success. Specifically, we are supporting DORA and its community with event management. We help curate and scaffold incoming community sessions for success.</p><p>Until April 3rd, <a href=\"https://sfdora.org/dora-10th-anniversary-events/#submit\">you can submit sessions for the celebrations as well</a>. So bring your ideas about reforming research assessment and let us shape the next ten years.</p>"},{"id":"63fcc4d3261a1e6be45d29ec","title":"A reading of the \"Guerilla Open Access Manifesto\" (s03e02)","link":"https://libscie.org/open-update-s03e02/","published":"Tue, 28 Feb 2023 08:00:56 GMT","description":"&#x1F508;This is the transcript of the Open Update. Find the original audio on Anchor.fm.Welcome to the Open Update. I'm your host Chris Hartgerink and this week, we don&#x2019;t have a regular episode for...","isPermalink":false,"tags":["Open Update"],"authors":[{"name":"Chris Hartgerink","url":null}],"image":"https://images.unsplash.com/photo-1610337673044-720471f83677?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=MnwxMTc3M3wwfDF8c2VhcmNofDN8fGdsaXRjaHxlbnwwfHx8fDE2Nzc1MTY0Mzc&ixlib=rb-4.0.3&q=80&w=2000","modified":null,"contentHtml":"<div class=\"kg-card kg-callout-card kg-callout-card-grey\"><div class=\"kg-callout-emoji\">&#x1F508;</div><div class=\"kg-callout-text\">This is the transcript of the Open Update. Find the original audio on <a href=\"https://anchor.fm/open-update/episodes/A-reading-of-the-Guerilla-Open-Access-Manifesto-s03e02-e1vjh3u\">Anchor.fm</a>.</div></div><img src=\"https://images.unsplash.com/photo-1610337673044-720471f83677?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=MnwxMTc3M3wwfDF8c2VhcmNofDN8fGdsaXRjaHxlbnwwfHx8fDE2Nzc1MTY0Mzc&ixlib=rb-4.0.3&q=80&w=2000\" alt=\"A reading of the \"Guerilla Open Access Manifesto\" (s03e02)\"><p>Welcome to the Open Update. I'm your host Chris Hartgerink and this week, we don&#x2019;t have a regular episode for you.</p><p>The last recording we did, ended up glitchy and unusable, and then we had health issues that prevented us from recording anything at all. We got off to a great start, with plans full of buffer time, but apparently with two hosts come new logistics problems. We are figuring it out, and thank you for being patient with us in this!</p><p>Instead of a regular episode, I will today read you <a href=\"https://archive.org/stream/GuerillaOpenAccessManifesto/Goamjuly2008_djvu.txt\">the Guerilla Open Access Manifesto</a>. It is almost fifteen years old, and inspires to this day. It is no longer as applicable as it was in 2008, but maybe hearing it in 2023 will inspire new ideas in you. We selected it as a reading for this podcast, because it centers power in its discussion of access.</p><hr><p>Information is power. But like all power, there are those who want to keep it for themselves. The world's entire scientific and cultural heritage, published over centuries in books and journals, is increasingly being digitized and locked up by a handful of private corporations. Want to read the papers featuring the most famous results of the sciences? You'll need to send enormous amounts to publishers like Reed Elsevier. </p><p>There are those struggling to change this. The Open Access Movement has fought valiantly to ensure that scientists do not sign their copyrights away but instead ensure their work is published on the Internet, under terms that allow anyone to access it. But even under the best scenarios, their work will only apply to things published in the future. Everything up until now will have been lost. </p><p>That is too high a price to pay. Forcing academics to pay money to read the work of their colleagues? Scanning entire libraries but only allowing the folks at Google to read them? Providing scientific articles to those at elite universities in the First World, but not to children in the Global South? It's outrageous and unacceptable. </p><p>\"I agree,\" many say, \"but what can we do? The companies hold the copyrights, they make enormous amounts of money by charging for access, and it's perfectly legal &#x2014; there's nothing we can do to stop them.\" But there is something we can, something that's already being done: we can fight back. </p><p>Those with access to these resources &#x2014; students, librarians, scientists &#x2014; you have been given a privilege. You get to feed at this banquet of knowledge while the rest of the world is locked out. But you need not &#x2014; indeed, morally, you cannot &#x2014; keep this privilege for yourselves. You have a duty to share it with the world. And you have: trading passwords with colleagues, filling download requests for friends. </p><p>Meanwhile, those who have been locked out are not standing idly by. You have been sneaking through holes and climbing over fences, liberating the information locked up by the publishers and sharing them with your friends. </p><p>But all of this action goes on in the dark, hidden underground. It's called stealing or piracy, as if sharing a wealth of knowledge were the moral equivalent of plundering a ship and murdering its crew. But sharing isn't immoral &#x2014; it's a moral imperative. Only those blinded by greed would refuse to let a friend make a copy. </p><p>Large corporations, of course, are blinded by greed. The laws under which they operate require it &#x2014; their shareholders would revolt at anything less. And the politicians they have bought off back them, passing laws giving them the exclusive power to decide who can make copies. </p><p>There is no justice in following unjust laws. It's time to come into the light and, in the grand tradition of civil disobedience, declare our opposition to this private theft of public culture. </p><p>We need to take information, wherever it is stored, make our copies and share them with the world. We need to take stuff that's out of copyright and add it to the archive. We need to buy secret databases and put them on the Web. We need to download scientific journals and upload them to file sharing networks. We need to fight for Guerilla Open Access. </p><p>With enough of us, around the world, we'll not just send a strong message opposing the privatization of knowledge &#x2014; we'll make it a thing of the past. Will you join us?</p><hr><figure class=\"kg-card kg-bookmark-card\"><a class=\"kg-bookmark-container\" href=\"https://archive.org/stream/GuerillaOpenAccessManifesto/Goamjuly2008_djvu.txt\"><div class=\"kg-bookmark-content\"><div class=\"kg-bookmark-title\">Full text of &#x201C;Guerilla Open Access Manifesto&#x201D;</div><div class=\"kg-bookmark-description\"></div><div class=\"kg-bookmark-metadata\"><img class=\"kg-bookmark-icon\" src=\"https://archive.org/images/glogo.jpg\" alt=\"A reading of the \"Guerilla Open Access Manifesto\" (s03e02)\"><span class=\"kg-bookmark-author\">Internet Archive logo A line drawing of the Internet Archive headquarters building fa&#xE7;ade.</span></div></div><div class=\"kg-bookmark-thumbnail\"><img src=\"https://archive.org/services/img/etree\" alt=\"A reading of the \"Guerilla Open Access Manifesto\" (s03e02)\"></div></a></figure><p>The sign off in this Guerilla Open Access Manifesto says Aaron Swartz, July, 2008. Amo. It has since then been contested whether Aaron Swartz wrote this on his own or with a group of people. This episode is not a regular episode where we just talk about the power imbalances, but if you do not know about the story of Aaron Swartz, we can highly recommend the documentary, \"<a href=\"https://www.youtube.com/watch?v=M85UvH0TRPc\">The Internet's own Boy</a>\", which is freely available online. </p><p>The Guerilla Open Access Manifesto is part of a longer history, and we wanted to make sure to bring that into this podcast as. &#xA0;Because it's openly licensed, we are free to read it here for you without any risk of copyright lawsuits, and so we thought let's do that. </p><p>Thank you for being so patient with us as we are figuring out the kinks of this podcast in this new season with a co-host and everything around it.</p><p>We hope you stay safe. We look forward to being here again in a few weeks with you, hopefully for a more regular episode where we talk about the power imbalances of open research. In the meantime, don't forget to subscribe on your podcast provider of choice. </p><p>We'll be back in a few weeks.</p>"},{"id":"63dfbac8261a1e6be45d268c","title":"Shutting down our preprint bots","link":"https://libscie.org/shutting-down-our-preprint-bots/","published":"Tue, 21 Feb 2023 08:00:21 GMT","description":"Preprint bots are shut down due to sudden changes to the Twitter API.","isPermalink":false,"tags":["Labs"],"authors":[{"name":"Chris Hartgerink","url":null}],"image":"https://images.unsplash.com/photo-1582571352032-448f7928eca3?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=MnwxMTc3M3wwfDF8c2VhcmNofDE4fHxyb2JvdHxlbnwwfHx8fDE2NzU2MDcwMTE&ixlib=rb-4.0.3&q=80&w=2000","modified":null,"contentHtml":"<img src=\"https://images.unsplash.com/photo-1582571352032-448f7928eca3?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=MnwxMTc3M3wwfDF8c2VhcmNofDE4fHxyb2JvdHxlbnwwfHx8fDE2NzU2MDcwMTE&ixlib=rb-4.0.3&q=80&w=2000\" alt=\"Shutting down our preprint bots\"><p>We started running Twitter bots in 2017, when Liberate Science was only a side project. First we launched the <a href=\"https://twitter.com/PsyArXivBot\">PsyArxiv bot</a>. Later, we launched bots for the <a href=\"https://twitter.com/metaarxiv\">MetaArxiv (2020)</a> and <a href=\"https://twitter.com/edarxivbot\">EdArxiv (2021)</a> preprint servers.</p><p>Six years in, we are shutting down these Twitter bots. You may have already noticed they are no longer posting any new preprints since <a href=\"https://twitter.com/TwitterDev/status/1623467615539859456?s=20&t=zGy5cl57uuac9gfIOo609g\">February 13th</a> (<a href=\"https://twitter.com/TwitterDev/status/1621026986784337922?s=20&t=zGy5cl57uuac9gfIOo609g\">previously 9th</a>).</p><p>There are several things that motivate us to stop the preprint bots&#x2019; operations. It includes the exodus from Twitter overall; it includes the recent announcement that Twitter API access is no longer free. It includes that the community has taken it upon itself to offer <a href=\"https://botsin.space/@PsyArXivBot\">replacement bots on Mastodon</a>.&#x2003;&#x2003;</p><p>We offered preprint bots for free all these years, but that does not mean it was free to run this. We had to run a custom RSS feed service (based on Jeff Spies&#x2019; <code><a href=\"https://github.com/JeffSpies/osfpreprints-feed\">osfpreprints-feed</a></code>; run on <a href=\"https://glitch.com\">Glitch</a> for $99/year). Automating a bot is free and easy if there is relatively little volume. Especially for PsyArxiv, the amount of preprints grew so rapidly that we had to upgrade our automation and costs went up to ~$600 per year (using <a href=\"https://zapier.com\">Zapier</a>). This is also why <a href=\"https://twitter.com/TwitterDev/status/1623467618400374784?s=20&t=bjVVPi-ZJCDI0JHmDPgRbg\">the 1,500 free post limit</a> proves too uncertain in the long run.</p><p>Running preprint bots is not enormously expensive and could probably be run cheaper too. With Twitter now all of a sudden requiring paid API access (eleven days notice for <a href=\"https://twitter.com/TwitterDev/status/1623467617037221889?s=20&t=fB0zNbGTMAzAf73Tl03jMw\">what looks like $100/month</a>!), this was a forcing factor for us to shut down the bots. The decision and how it was communicated by Twitter provides too much uncertainty for us to keep investing in what is not our core work at this point (it is part of <a href=\"https://libscie.org/introducing-liberate-science-labs/\">Liberate Science Labs</a>, where we experiment with things). </p><p>It was great while it lasted. I realize a lot of people relied on these bots to provide them with the latest - I am sorry this is the current situation. We&#x2019;re happy to discuss transferring the accounts if somebody wants to run them in a serious manner, with respect to how they have been run until now, and who is capable of dealing with the shenanigans of Twitter reliably.</p>"},{"id":"63e4c54c261a1e6be45d27ca","title":"Getting to know your new co-host! (s03e01)","link":"https://libscie.org/getting-to-know-your-new-co-host-s03e01/","published":"Tue, 14 Feb 2023 08:00:41 GMT","description":"&#x1F508;Find the original audio on Anchor.fmIn this episode, we get to know our new co-host!The Open Update podcast is a space to have conversations and continuously update what it means to be open. In...","isPermalink":false,"tags":["Open Update","Labs"],"authors":[{"name":"Chris Hartgerink","url":null}],"image":"https://images.unsplash.com/photo-1585776245991-cf89dd7fc73a?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=MnwxMTc3M3wwfDF8c2VhcmNofDJ8fHVwZGF0ZXxlbnwwfHx8fDE2NzU5MzczNzQ&ixlib=rb-4.0.3&q=80&w=2000","modified":null,"contentHtml":"<div class=\"kg-card kg-callout-card kg-callout-card-yellow\"><div class=\"kg-callout-emoji\">&#x1F508;</div><div class=\"kg-callout-text\"><a href=\"https://anchor.fm/open-update/episodes/Getting-to-know-your-new-co-host--s03e01-e1uhpp3\">Find the original audio on Anchor.fm</a></div></div><img src=\"https://images.unsplash.com/photo-1585776245991-cf89dd7fc73a?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=MnwxMTc3M3wwfDF8c2VhcmNofDJ8fHVwZGF0ZXxlbnwwfHx8fDE2NzU5MzczNzQ&ixlib=rb-4.0.3&q=80&w=2000\" alt=\"Getting to know your new co-host! (s03e01)\"><p>In this episode, we get to know our new co-host!</p><p>The Open Update podcast is a space to have conversations and continuously update what it means to be open. In season 3, co-hosts Sarahanne Field and Chris Hartgerink, discuss how power imbalances affect efforts to improve research, and the world beyond.</p><hr><p>[00:00:00] <strong>Chris Hartgerink:</strong> Welcome back to the Open Update. This is the first episode of season three. For Liberate Science, I'm Chris Hartgerink and I'm joined by our co-host today.</p><p>[00:00:09] <strong>Sarahanne Field:</strong> Hi, I'm Sarahanne!</p><p>[00:00:10] <strong>Chris Hartgerink:</strong> In this new season, we'll be going on a bit of a different track from the first two seasons. We'll be talking more about power dynamics in research, how it affects how research is done, but also how the conditions for research are created and include aspects that we don't talk about as much, when we're trying to improve research.</p><p>There are many dimensions to power dynamics, and with our new co-host, Sarahanne, we have a great opportunity to bring some new topics to the table and engage you in discussions. This is also an open invitation for you to join in on our discussions.</p><p>Sarahanne, I wanted to ask you, when you hear power dynamics, what are some of the first things that come to mind for you?</p><p>[00:01:03] <strong>Sarahanne Field:</strong> I come from a perspective of thinking about things in terms of science reform.</p><p>When we think about science reform, we're talking about a movement that has come out of the traditional scientific community and there is always a risk that it inherits some of those problems with power dynamics. The scientific research community is going to be the basis for the population in the science reform community.</p><p>I'm always looking for ways to to dissolve some of those power imbalances that may potentially be inherited.</p><p>[00:01:47] <strong>Chris Hartgerink:</strong> To tickle that a bit, do you think that in this reform movement we have a 1% who is influencing where we're going?</p><p>[00:01:55] <strong>Sarahanne Field:</strong> I don&#x2019;t know if I see it quite so clearly. I think that the way that power is distributed in the science reform community is just different. We still have these problems potentially with hierarchies and with say elite or powerful members within that community.</p><p>They have the potential to be the same kinds of people. When I say the same kinds of people I mean senior white males from wealthy institutions in the global North, for example.</p><p>I think reform has really switched things up when it comes to who has power in science. Before reform started becoming more impactful, people who had high H-indexes and people who publish in high impact factor journals, they are the ones who had the power.</p><p>But now people who have power in the science reform movement are potentially people who are really good at all of the open science things. People who have the resources to always publish registered reports, to always be sharing their data because they don't have sensitive data. And so we need to be thinking about how power is distributed, whether it's different or the same as the traditional system.</p><p>We need to be interrogating that and questioning that at every point.</p><p>[00:03:18] <strong>Chris Hartgerink:</strong> For the people who don't know you, where are you coming from? What stage of your career are you in?</p><p>[00:03:25] <strong>Sarahanne Field:</strong> The first thing I ever really did in research was meta scientific. My first research study ever, the first thing I ever published was a pair of replication studies, and that project started in early 2014. At that point I first heard about replication and reproducibility problems from very quantitative perspective.</p><p>So I have an undergraduate in psychology and quite a quantitative background. My perspective at that point was &#x201C;Yeah, replicate all the things!&#x201D; I was really zealous, I was so excited thinking, oh my goodness, we can test out if there's truth, if this is true.</p><p>It was such a binary way of thinking.</p><p>That's really softened over time. Although people who know me would say I'm really opinionated and I can be, I've really become very nuanced when it comes to issues surrounding reform, about transparency. Reform looks so different to so many different people. There's so much variability in how people experience reform and how they can enact reform in their own research process and, so for me, I've really become a little more nuanced.</p><p>I think pre-registration is great, but it has its problems. And you could say the same thing for any science reform initiative that you could ask me about.</p><p>Where do I come from?</p><p>I'm a mixed methodologist, so I don't have any particular marriage to one kind of methodology or approach or another. So I can see how science reform can be done differently depending on, what kind of a methodological approach you use, how you analyze data or research material, what possibilities there are for sharing. I guess I have a somewhat balanced view with a lot of things.</p><p>But I will also say that I'm fairly critical of the science reform movement. Although I consider myself a science reformer. I am also very cautious of drinking the Kool-Aid. I want to talk about things and interrogate initiatives before just assuming that we should all adopt them and that they're great. I like questioning and pushing the boundaries of, discussion about them. And that's why I'm really excited to be on the podcast because I see an opportunity for doing that with input from listeners.</p><p>[00:05:46] <strong>Chris Hartgerink:</strong> I keep remembering your dissertation &#x201C;<a href=\"https://doi.org/10.31219/osf.io/udfw4\">Charting the constellations of the Science Reform</a>.&#x201D; What struck me in that was how reflexive you are in the steps you take, to qualify what statements you can make.</p><p>Last season we had James Bridle on the show and he also very clearly said that the thing that sets researchers apart is not knowing things, but it's about them knowing what they're uncertain about and being able to, quantify, but at least qualify that.</p><p>I asked this question &#x201C;where do you come from?&#x201D; thinking I'm gonna get a bit of backstory. But in terms of you come from Australia originally, you moved to the Netherlands. But this is also the beauty of communication that it could go many ways.</p><p>For this season, we're talking about these power dynamics and I've said so often so our listeners will remember this. We're trying to bring this into the discussion and have all of these different elements come in.</p><p>I'm a white European colonizer. I understand my personal dynamics and how my Dutch history plays into how the world has evolved. And I wonder how that is for you with an Australian background, with a completely different kind of history.</p><p>[00:07:01] <strong>Sarahanne Field:</strong> I am only, I guess I would say, a second generation Australian. My not so distant ancestors had committed, I believe it was grand larceny in, in England.</p><p>[00:07:13] <strong>Chris Hartgerink:</strong> What's grand larceny again?</p><p>[00:07:16] <strong>Sarahanne Field:</strong> Heaps of stealing. Heaps of stealing.</p><p>[00:07:20] <strong>Sarahanne Field:</strong> And arson as well. Setting fire to things. I'm from that kind of stock and that's always been something that I thought was really. funny. Because, my ancestors were sent over to Australia for infringements to the law, and I always like to push the boundaries of what's acceptable.</p><p>I always, I feel that in myself, this, I'm attributing to having convict ancestors but really I think it's just, it's also what I'm like, but pushing the boundaries of what's acceptable. Not stealing so much or setting fighter stuff!</p><p>Pushing the boundaries of what people think is acceptable, and I think when I first started learning about what you were doing, Chris, that really spoke to me on that level, pushing boundaries and saying &#x201C;Okay, what we think is okay let's talk about that.&#x201D;</p><p>Let's push those boundaries. And so I think that's something that sort of has stuck with me about my own heritage. I feel quite humble. I was brought up speaking one language, which is in comparison to everyone in Europe who speaks at least two. I feel like I have quite a humble background and though I am, I don&#x2019;t know if that necessarily makes me feel like more of an imposter as a result.</p><p>I certainly feel that I come from a very humble background and as though I need to prove myself.</p><p>[00:08:36] <strong>Chris Hartgerink:</strong> . Thanks for sharing a bit about that and I remember that we met in. 2018, if I'm correct?</p><p>[00:08:43] <strong>Sarahanne Field:</strong> That's right. Yep.</p><p>[00:08:44] <strong>Chris Hartgerink:</strong> And I think this was also the time that it was the first presentation of the idea that is now ResearchEquals.</p><p>[00:08:52] <strong>Sarahanne Field:</strong> I hadn't seen anything like what you were presenting that day before. It was such an avant-garde idea. I remember thinking &#x201C;oh my goodness, this is someone that I've gotta watch!&#x201D; Like big watch this space kind of thing.</p><p>I just thought this Chris guy, he's, I really want to keep an eye on him because. This idea was just, listeners are going to know, about the platform in general this idea of modular publishing. At that point it was only a single idea on a handful of slides for me.</p><p>It's been actually incredible to see the journey that you've taken to, to make that into a reality. It's just incredible.</p><p>[00:09:33] <strong>Chris Hartgerink:</strong> This podcast has definitely been a part of that journey. One of the things about this season of the podcast that is really exciting me is to talk more about these power dynamics.</p><p>Because I remember of the things that for me became clear in the past year or so through conversations with you and with other people, is we often talk about this reform movement as if it is an escalator. We just level up.</p><p>What I hope with this season is to really talk more about these power dynamics and these power struggles that are taking place that highlight this isn't an escalator. This is a continuous fight to make these changes that we want to see. And then other people fighting to make either other changes to undo the changes.</p><p>It's all very much a political arena. I'm very much looking forward to discussing that with you and to hear also from the listeners what that means in their environments, because we're also all in different political arenas. What in the long run we can all do to organize in those places. And very excited to talk more about these things over, this season and beyond.</p><p>I think that also very much brings us already to the end stages of this first episode. So I think that maybe just to tickle the idea ideas for the season and also to tickle the listeners: What would be three dimensions of power dynamics or power struggles that you are excited to talk about</p><p>I can start off with mine to give you a bit of time to think about this.</p><p>I'm very excited to talk about the upcoming labor strikes in the uk from the union at the universities. I think that's very much related to reforming science. This is a political arena.</p><p>Then one of things is I would love to also talk more about how precarious contracts relate to bad research.</p><p>And then finally, I want to talk about how we individualize some of these issues by talking about how people, have to deal with their mental health and secure their own spaces when they're bearing the brunt of all of the things that are wrong.</p><p>Just a few, small topics for me.</p><p>[00:11:52] <strong>Sarahanne Field:</strong> Yeah just little tiny ones. Just blips on the radar.</p><p>One thing that I'm really really interested in is thinking about practices inside reform from this whole idea of the moral economy. Bart Penders introduced this in a paper that came out recently</p><p>I'd love to discuss that idea of there being reform elites that have these levels of etiquette, of scientific etiquette that relate to reform practices and how people, have to continually reach higher and higher to reach these thresholds. And that determines who's peripheral in the community. It makes people peripheral if you choose to not follow those practices or if you can't keep up. Who's peripheral then and can that be changed?</p><p>I think there's an extent to which hierarchy is almost a homeostasis. It's almost like science keeps promoting or encouraging this hierarchy because that's just the state it's comfortable at. Almost as if there's a water level that needs to just be maintained. That's something I'd love to talk about with listeners.</p><p>Another sort of thing I'd really like to talk about with some listeners is the idea that some people genuinely see science as being value free. That's something that really interests me and I think the people who have the privilege to see science as value free, how they perceive certain power problems in science and how they see that problem or that systemic issue within that structure. That's also something that relates to this issue that I'd really like to explore, but I dunno if that's too nebulous.</p><p>[00:13:45] <strong>Chris Hartgerink:</strong> We'll definitely have a challenge to thread the needle on all these different topics and still keep it digestible because it's very easy to go super scholarly on this.</p><p>This is also a great point to start wrapping it up.</p><p>Thank you for listening! We got our new co-host, Sarahanne, and this is only the first episode of a whole season. Before we started recording we decided the season is undefined. So who knows how long we go, how far we go, and how far you go along with us, that's up to you. But be sure to subscribe on your podcast provider of choice.</p><p>I think by now, people also always say, please leave a rating on Apple Podcasts because that's helps people discover it. So if that's something you do, we won't stop you.</p><p>We're planning on releasing a brief podcast every other week, so keep an eye out for it and let us know if you have any ideas and any final words for this episode.</p><p>[00:14:47] <strong>Sarahanne Field:</strong> Nothing to add from here. I'm just excited to hear how the conversation's gonna unfold and would love to hear some of your perspectives on the issues we've already touched on.</p><p>[00:14:57] <strong>Chris Hartgerink:</strong> We'll talk to you next time.</p><hr><p><em>The next episode of the Open Update will be released on February 28th, 9AM UTC+1.</em></p>"},{"id":"63db7568261a1e6be45d2654","title":"Co-host introduction for the Open Update (Season 3)","link":"https://libscie.org/open-update-season-3/","published":"Tue, 07 Feb 2023 08:00:21 GMT","description":"A new season of the Open Update is coming, with a co-host!","isPermalink":false,"tags":["Open Update","Labs"],"authors":[{"name":"Liberate Science","url":null}],"image":"https://images.unsplash.com/photo-1668537338628-85b9970bf17f?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=MnwxMTc3M3wwfDF8c2VhcmNofDExfHxyb2RlY2FzdGVyfGVufDB8fHx8MTY3NTM0MjA1NQ&ixlib=rb-4.0.3&q=80&w=2000","modified":null,"contentHtml":"<img src=\"https://images.unsplash.com/photo-1668537338628-85b9970bf17f?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=MnwxMTc3M3wwfDF8c2VhcmNofDExfHxyb2RlY2FzdGVyfGVufDB8fHx8MTY3NTM0MjA1NQ&ixlib=rb-4.0.3&q=80&w=2000\" alt=\"Co-host introduction for the Open Update (Season 3)\"><p>The Open Update is our podcast to help you stay informed on what&#x2019;s happening in the open research landscape.</p><p>In season 1, we covered the headlines for 52 weeks. In season 2, we dove in deep to understand the implications of the UNESCO Recommendation on Open Science with 10 specialists. After our successful first two seasons, with 62 episodes resulting in over 5,000 listens, we decided it was time to continue the conversations again in a different way.</p><p>In season 3, we will be joined by a co-host and explore how power dynamics play into the evolving landscape of open research. Our new co-host to do this is none other than <a href=\"http://sarahannemfield.eu/\">Dr. Sarahanne Field</a> &#x1F389; &#xA0;</p><p>Watch a brief introduction of our new co-host below &#x1F447;</p><figure class=\"kg-card kg-embed-card\"><iframe width=\"200\" height=\"113\" src=\"https://www.youtube.com/embed/wap6yQFjDXg?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"Co-host introduction for the Open Update (Season 3)\"></iframe></figure><p>Come join our new co-host, Sarahanne Field, and our resident co-host, Chris Hartgerink, for season 3! Don&#x2019;t forget to verify you are, in fact, <a href=\"https://anchor.fm/open-update\">subscribed to the Open Update</a> on your podcast provider of choice.</p><p>We are planning to release one episode every two weeks for an undefined time, each lasting between 15-20 minutes. Each episode&#x2019;s transcript will be posted to this blog, which you can receive in your inbox by <a href=\"https://libscie.org/signup/\">signing up for email updates</a>.</p><p>The first episode will be released on February 14th.</p>"},{"id":"63cfc44c261a1e6be45d242f","title":"On why we consider some licenses closed (at the moment)","link":"https://libscie.org/on-why-we-consider-some-licenses-closed/","published":"Tue, 31 Jan 2023 14:33:04 GMT","description":"ResearchEquals has a Pay To Close model, but why are some licenses considered closed, really?","isPermalink":false,"tags":["ResearchEquals"],"authors":[{"name":"Chris Hartgerink","url":null}],"image":"https://images.unsplash.com/photo-1633596683562-4a47eb4983c5?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=MnwxMTc3M3wwfDF8c2VhcmNofDYwfHxhYnN0cmFjdHxlbnwwfHx8fDE2NzQ1NjE5MTE&ixlib=rb-4.0.3&q=80&w=2000","modified":null,"contentHtml":"<img src=\"https://images.unsplash.com/photo-1633596683562-4a47eb4983c5?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=MnwxMTc3M3wwfDF8c2VhcmNofDYwfHxhYnN0cmFjdHxlbnwwfHx8fDE2NzQ1NjE5MTE&ixlib=rb-4.0.3&q=80&w=2000\" alt=\"On why we consider some licenses closed (at the moment)\"><p>Copyright is automatic: You create something and it will have copyright. This blog, just by writing it will have copyright. Even your doodles. It is the contract without paper trail. That also means: Without any intervention, nobody will be able to legally copy it.</p><p>The interventions to make that copyright more workable are important in open movements. Such interventions provide the legal certainty to reuse whatever it is you are interested in. The MIT and GPL licenses in open source. Creative Commons licenses in open access.</p><p>This is not a blog about how to <a href=\"https://choosealicense.com\">choose a license</a> &#x2014; it is a blog about some of the intricacies that went into decisions while building ResearchEquals. Specifically, it is about why we consider some licenses open access and others as part of our &#x201C;Pay To Close&#x201D; model.</p><p>The point of this blog is to have concrete things to (dis)agree with and allow for the ResearchEquals community to continue the discussion.</p><hr><p>ResearchEquals is built as an open access publishing platform. In our pilot prior to ResearchEquals, we only offered public domain dedication and the attribution licenses, which people felt was too restrictive. So we wondered, how can we introduce restrictive licenses as options but in a way that is in line with our value of making knowledge available and reusable?</p><p>Before I can discuss the intricacies, I have to mention what those more restrictive licenses are. These include a combination of not using the work for commercial activities (non-commercial; NC), not making anything else with it (no derivatives; ND), or not using any other license upon reuse (share alike; SA). In the worst case: All rights reserved and you always need to get permission from the author(s).</p><figure class=\"kg-card kg-image-card\"><img src=\"https://libscie.org/content/images/2023/01/Screenshot-2023-01-24-at-11.17.08.png\" class=\"kg-image\" alt=\"On why we consider some licenses closed (at the moment)\" loading=\"lazy\" width=\"2000\" height=\"1045\" srcset=\"https://libscie.org/content/images/size/w600/2023/01/Screenshot-2023-01-24-at-11.17.08.png 600w, https://libscie.org/content/images/size/w1000/2023/01/Screenshot-2023-01-24-at-11.17.08.png 1000w, https://libscie.org/content/images/size/w1600/2023/01/Screenshot-2023-01-24-at-11.17.08.png 1600w, https://libscie.org/content/images/size/w2400/2023/01/Screenshot-2023-01-24-at-11.17.08.png 2400w\" sizes=\"(min-width: 720px) 720px\"></figure><p>With a range of restrictive licensing options out of the way: Why do we consider share alike, non-commercial, and non-derivatives &#x201C;Pay To Close&#x201D;?</p><h2 id=\"demarcating-open\">Demarcating open</h2><p>The <a href=\"https://openaccess.mpg.de/Berlin-Declaration\">Berlin Declaration on Open Access</a> (2003) says open access must satisfy two conditions:</p><ol><li>Free and irrevocable access to the work</li><li>Right to (re)use, copy, distribute, transmit, and create derivatives of the work for any purpose</li></ol><p>With this definition, the non-commercial and non-derivative clauses immediately fall by the wayside. Big publishers have tried real hard to make the non-commercial clause accepted as open, but simply have failed over the past decades. It was an easy decision to add all the licenses with non-commercial or non-derivative clauses into the &#x201C;Pay To Close&#x201D; model as a result.</p><p>The share alike license on the other hand, remained more ambiguous. </p><p>There is a long history in open source of MIT versus GPL, which is, in the most crude sense, a parallel to CC BY (attribution) and CC BY-SA (share alike), respectively. I conceptualize the differences between them not on purely legalistic grounds, but as fundamental value differences: the public domain philosophy on the one hand and the copyleft philosophy on the other.</p><p>The public domain philosophy of open, as I understand it, is about getting creative works as close to the public domain as possible, as fast as possible. If I put a public domain dedication on it, I get as close to public domain as can be. Only requiring an attribution, is pretty close too. If I keep all rights to myself, it&#x2019;s as far from public domain as can be: Seventy years after my death. </p><p>The public domain philosophy strives for copyright minimalism.</p><p>The copyleft philosophy of open is about using copyright enforcement to create more and more content that will have to be shared openly. This means, if content under share alike gets reused, there will be more open content than there was before. These must also be share alike and in turn will create more open content if reused themselves, and so on. This can end up in a reusable utopia that self-perpetuates, <strong><em>if</em></strong> the share alike condition is <strong><em>strictly enforced</em></strong>. </p><p>The share alike philosophy aims to invert the copyright regime in place, but not do away with it.</p><p>As you read, copyright minimalism versus copyright enforcement are very different philosophies. Copyright minimalism resonates more with personally. </p><p>Copyright enforcement for the purposes that would suit me simply sounds off &#x2014; how can we guarantee that same enforcement will not be used for other purposes? The share alike philosophy benefits from strong copyright enforcement, which could enable stronger copyright legislation, and copyright maximalism potentially. This is counterproductive in my opinion. </p><p>In the long run, copyright minimalism is what I work towards instead of using the enforcement powers for the values I have. That this resonates more with my perspective on open is in the end why ResearchEquals demarcates the &#x201C;Pay To Close&#x201D; model the way it does.</p><hr><p>I recognize the power I have to make decisions about how ResearchEquals is shaped in these early days. It is not my goal to keep that power to myself, which is why that power is distributed at our General Assemblies. We will soon restart our supporting membership onboarding and how you can get the power to co-create ResearchEquals there. So if you want share alike to be considered open instead of &#x201C;Pay To Close&#x201D; - come put it on the agenda at an assembly! </p><p>Stay in the know by <a href=\"https://libscie.org/signup/\">signing up to receive all posts in your mailbox</a>.</p>"},{"id":"63cfa1db261a1e6be45d23f4","title":"Planning 2023","link":"https://libscie.org/planning-2023/","published":"Tue, 24 Jan 2023 15:02:42 GMT","description":"We are full of energy to make 2023 a success. Here's how we are approaching our work this year.","isPermalink":false,"tags":["Strategy"],"authors":[{"name":"Liberate Science","url":null}],"image":"https://images.unsplash.com/photo-1669554108285-dc5c2786ed61?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=MnwxMTc3M3wwfDF8c2VhcmNofDExfHwyMDIzfGVufDB8fHx8MTY3NDU1MTgwNA&ixlib=rb-4.0.3&q=80&w=2000","modified":null,"contentHtml":"<img src=\"https://images.unsplash.com/photo-1669554108285-dc5c2786ed61?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=MnwxMTc3M3wwfDF8c2VhcmNofDExfHwyMDIzfGVufDB8fHx8MTY3NDU1MTgwNA&ixlib=rb-4.0.3&q=80&w=2000\" alt=\"Planning 2023\"><p>Just a few weeks ago <a href=\"https://libscie.org/wrapped-2022/\">we reflected on the year 2022</a> &#x2014; with those positive results we find the energy to make 2023 another resultful one. In this blog post, we outline how we are planning to move forward this year.</p><p>To put things in to perspective before we get started, here&#x2019;s what <a href=\"https://libscie.org/theory-of-change/\">our theory of change</a> says we are working towards:</p><div class=\"kg-card kg-callout-card kg-callout-card-green\"><div class=\"kg-callout-emoji\">&#x1F333;</div><div class=\"kg-callout-text\">In 10-15 years we aim to have fostered a self-sustaining research commons, in order to advance and bridge different ways of knowing.</div></div><p>For 2023, we interpret our self-sustaining research commons locally and in two ways: (1) Business and (2) Community. These will be our core themes for 2023, which will be reflected in the activities.</p><h2 id=\"business\">Business</h2><p>The straightforward reality is that we cannot work on this mission if we do not have the money to buy people&#x2019;s time to focus on this. Regrettably, that is the system we are embedded in.</p><p>The Shuttleworth Foundation made it possible to buy the core team&#x2019;s time throughout 2019-2022; in 2023 we are already using our own lifetime revenue already. This means that the bucket we are using in 2023 was filled in 2019-2022. We need to pick up the pace: We have 2023 to fill the remainder of the 2023 bucket and start filling our bucket for 2024.</p><p>We are on track to make it through the year 2023, but last quarter we still spent more than we earned. We earned 25% of what we spent during the last quarter of 2022. Concretely, <strong>we need to earn 100% of what we spend</strong> in the final quarter of 2023. This will set us on track to generating a profit in 2024, which we can then jointly decide what to do with (more on that later this year).</p><p>Breaking-even in 2023 means we will need to spend a lot of energy on improving how we generate revenue and reducing costs. This is not just important for the business, but also for the reliability of what is becoming critical infrastructure for researchers.</p><p>If you would like to work with us or support our efforts, <a href=\"mailto:info@libscie.org\">do not hesitate to get in touch</a>.</p><h2 id=\"community\">Community</h2><p>A self-sustaining research community is a space that people convene in. Lively, engaging, building each other up, and respectful of individual differences/histories while recognizing historical inequities &#x2014; that&#x2019;s what we envision. Specifically pertaining to the researchers sharing their process in the ResearchEquals community of practice.</p><p>For example, we can use <a href=\"https://digitalfutures.space/deepdive/trauma-informed-design/\">trauma informed design</a> to make our spaces so much more than just another space to survive in. What can we do to not only make this a space that prevents harm, but also promotes joy?</p><p>Community building requires active work. In 2022, our CEO took <a href=\"https://www.cscce.org/trainings/cef/\">the CSCCE Community Fundamentals</a> course, which inspired us to step up our community efforts. It took us as long as it needed to, to get here. As <a href=\"https://docs.google.com/presentation/d/1LqdO86mBy6CQin7kFUcM_CfnyhV1fDFQ/edit#slide=id.p18\">Cameron Neylon recently said</a> (paraphrased): Many seemingly technological projects in open scholarship are actually working on a social change. ResearchEquals does so too - together we are changing research communication from after-the-fact to communicating the process.</p><p>We will be creating a lifecycle within our ResearchEquals community. This way, people will be coming and going and we focus on what we can do to engage no matter whether you were an early-adopter or a newcomer. There will be new ways for people to join the community, to increase their participation, and more.</p><h2 id=\"activities-for-2023\">Activities for 2023</h2><p>To that end, our 2023 activities are the following, although they may evolve. We specifically say what we are going to do this year, but also what we will not do. These are in no particular order.</p><h3 id=\"dont\">Don't</h3><ul><li>Feature fever - we will not implement any major features that drastically alter what ResearchEquals can do. We will only implement minor features that expand the business capacity and refine the experience on the platform.</li></ul><h3 id=\"do\">Do</h3><!--kg-card-begin: markdown--><ul>\n<li>Create and run the pilot ResearchEquals Cohort</li>\n<li>Evaluate pilot and determine whether to run Cohorts on a regular basis</li>\n<li>Have one employee start the two-year <a href=\"https://www.cscce.org/trainings/cscce-community-manager-certification-program/\">CSCCE Certification program</a></li>\n<li>Evaluate and improve the quantitative feedback mechanisms available for ResearchEquals\n<ul>\n<li>Add collections growth to the real-time statistics page</li>\n<li>Set growth targets</li>\n</ul>\n</li>\n<li>Upgrade our supporting membership strategy\n<ul>\n<li>Integrate supporting memberships into ResearchEquals</li>\n<li>Onboard ten new supporting members (individual or institutional)</li>\n<li>Rethink our General Assembly strategy</li>\n</ul>\n</li>\n<li>Build trust with our ResearchEquals Community\n<ul>\n<li>Create and implement an <a href=\"https://openstartup.tm\">open startup strategy</a></li>\n<li>Create and implement an archival strategy</li>\n</ul>\n</li>\n<li>Support use of ResearchEquals for creative purposes\n<ul>\n<li>Work with funders to promote the publication of grant proposals</li>\n<li>Enlist community champions to teach and facilitate step-by-step research publishing</li>\n<li>Publish six use cases of ResearchEquals</li>\n</ul>\n</li>\n<li>2023 evaluation against <a href=\"https://openscholarlyinfrastructure.org/\">POSI</a> (see <a href=\"https://libscie.org/principles-of-open-scholarly-infrastructure-2022/\">our 2022 evaluation</a> as well)</li>\n<li>2022 GHG emission assessment + a continuous emission assessment strategy</li>\n<li>Liberate Science Labs\n<ul>\n<li>Open Update season 3 with a co-host</li>\n<li>Champion the creation of an open source CrossRef library</li>\n<li>Organize Open Publishing Festival</li>\n<li>Run a set of 3 webinars on the fediverse</li>\n</ul>\n</li>\n</ul>\n<!--kg-card-end: markdown--><hr><p>As mentioned before, this list will keep on evolving and this only the start of our 2023 journey! We look forward to reflecting on this list at the end of the year, at the latest. If you are interested to know how things go, <a href=\"https://libscie.org/signup/\">sign up for newsletter updates</a> - we will keep posting our progress throughout the year &#x1F60A;</p>"},{"id":"638e070a261a1e6be45d1dd2","title":"Community Spotlight: Nami Sunami","link":"https://libscie.org/community-spotlight-nami-sunami/","published":"Tue, 03 Jan 2023 08:00:52 GMT","description":"In today’s community spotlight, we talk to Nami Sunami (he/him), maintainer of ResearchEquals! Who is Nami and what motivates him in his work? Let’s find out.","isPermalink":false,"tags":["Community"],"authors":[{"name":"Nami Sunami","url":null}],"image":"https://libscie.org/content/images/2022/12/PHOTO-2022-12-08-08-02-32.jpg","modified":null,"contentHtml":"<img src=\"https://libscie.org/content/images/2022/12/PHOTO-2022-12-08-08-02-32.jpg\" alt=\"Community Spotlight: Nami Sunami\"><p>In today&#x2019;s community spotlight, we talk to Nami Sunami (he/him). Nami is a maintainer of ResearchEquals and is author of <a href=\"https://github.com/libscie/ResearchEquals.com/issues?q=author%3Ansunami\" rel=\"noopener noreferrer\">over 110 proposed changes and bug reports to the project</a>! Who is Nami and what motivates him in his work? Let&#x2019;s find out by asking him a few questions.</p><hr><h2 id=\"why-do-you-contribute-to-researchequals\">Why do you contribute to ResearchEquals?</h2><!--kg-card-begin: markdown--><p>In 2019, I was at the University of Delaware as a PhD student in social psychology, looking for ways to make my research more open. I&#x2019;d found many great initiatives inside academia (e.g., Open Science Framework and Society of Improvement of Psychological Science), but then one caught my eyes&#x2014;Liberate Science.</p>\n<p>Independent, outside academia, and still deeply targeting the problems in academia, from the <em>outside-in.</em></p>\n<p>A bit out there, but a totally fascinating and unexpected idea&#x2014;like a shooting star coming outside my view. I found sparkles in my eyes, and I have not lost them since then. That has to do with my identity.</p>\n<p>I did not follow a normal path in the education system. I&#x2019;m originally from Japan where social norms of following expectations are prevalent. But, I dropped out of high school for many reasons. Since then, I&#x2019;ve been trying to find a different way of making an impact in the place where people are not looking yet. That&#x2019;s why I decided to study in the Philippines.</p>\n<p>I studied psychology in Saint Louis University in Baguio City in the Philippines. This is where I felt the structural inequalities of accessing scientific knowledge. For example, the university library did not have electronic subscriptions to any of the psychology journals. There were paper copies, such as Journal of Personality and Social Psychology, but the issues were outdated by 10 or 20 years. I would guess these were donated by someone. It felt very unjust that the current system requires people to pay for access. I took that feeling of injustice into the next stages of my career.</p>\n<p>After finishing undergrad I went back to Japan for a brief moment, but I wanted to study in the United States (US) at that time. I decided to go to a terminal master&#x2019;s program at Western Illinois University. My mentor and program taught me how to do psychology research and I really had fun. After that, I went to a social psychology PhD program at the University of Delaware. This is where I learned about the open science movement and the power structures and inequalities associated with it.</p>\n<p>All of these, all of my previous experiences, add up for me to keep working on ResearchEquals and LibScie. In my undergrad, I learned how the scientific system can be unjust, undermining freedom of information. In my graduate careers, I learned the challenges of making a change within a system.</p>\n<p>That&#x2019;s when I learned about LibScie&#x2014;and I saw hope. It&#x2019;s outside of the power structures. It&#x2019;s targeting the program that I care about: Freedom of knowledge and information. I&#x2019;m still super excited about this and that&#x2019;s why i contribute to R=.</p>\n<!--kg-card-end: markdown--><h2 id=\"looking-back-do-the-power-structures-in-different-countries-resemble-each-other-would-you-change-research-in-a-similar-way-in-the-us-as-in-the-philippines\">Looking back, do the power structures in different countries resemble each other? Would you change research in a similar way in the US as in the Philippines?</h2><!--kg-card-begin: markdown--><p>In my experience, the ways research is conducted in the US and in the Philippines are really different from each other.</p>\n<p>My undergraduate institution was a major regional university and the psychology program offered master&#x2019;s programs. But even then our department did not have a research-focused lab or Principal Investigators (PIs). The research conducted there is often led by students&#x2014;for undergraduate classes or for master&#x2019;s theses. The lack of funding for research was an issue too&#x2014;I remember standing in front of the main entrance of the University recruiting participants without pay (or compensation with snacks).</p>\n<p>The contrast of the Philippines with the US setting may be that supervisors there were concerned about teaching procedures and methods&#x2014;and less concerned about generating new and interesting findings, which a lot of USA researchers are incentivised to do. I remember we were doing replications of the Stroop Effect, which worked, while the replications did not work so much for the Mozart Effect. I wish we had some incentives to put these findings out in public.</p>\n<p>In the US, we have a lot of structural pressure and incentives to communicate new and interesting findings, less on replicating things. This is where I learned a phrase, &#x201C;Beat the data until it tells you something&#x201D;. I think this saying highlights the pressure to show something new.</p>\n<p>So, no, I don&#x2019;t think implementing the same solution to the US and the Philippines would work.</p>\n<!--kg-card-end: markdown--><h2 id=\"is-there-something-that%E2%80%99s-surprising-you-recently-about-research-or-the-world-in-general-something-that-came-into-view-unexpectedly-that-is-having-an-impact-on-you\">Is there something that&#x2019;s surprising you recently, about research or the world in general? Something that came into view unexpectedly that is having an impact on you?</h2><p>I&#x2019;m surprised by the speed in which new technological solutions are invented with the goal of helping researchers. There are some Artificial Intelligence (AI) tools that can summarise research papers. I am both excited and concerned.</p><p>I&#x2019;m excited that we may be accelerating the space where we allow ourselves to make changes in science from outside of academia&#x2014;in an outside-in manner. This is important to me since we can let people who were excluded from research to have power, and together we can all advance knowledge.</p><p>At the same time, new technologies come with new challenges and pitfalls. We should be vigilant. Is a piece of new technology simply recreating a similar power structure? Would using a piece of new technology amplify existing biases and privileges? Any strings attached with it? Since I&#x2019;m easily excited by new tech, I want to keep asking these questions.</p><h2 id=\"that%E2%80%99s-a-super-interesting-point-finally-what-would-you-like-for-2023-to-bring-to-the-researchequals-community\">That&#x2019;s a super interesting point! Finally, what would you like for 2023 to bring to the ResearchEquals community?</h2><p>I&#x2019;m hoping that the ResearchEquals community will become sustainable. We are in a long-game to change a big flow. Change takes time. I hope we grow our community together, suggest creative solutions to each other, and keep the wheel of ResearchEquals moving!</p><hr><p>Thanks Nami for sharing your story and being a part of this community. Are you interested in sharing your story? <a href=\"https://discord.gg/SefsGJWWSw\" rel=\"noopener noreferrer\">Join us on our Discord</a> channel and we might just feature you in the future!</p>"},{"id":"6399c7a0261a1e6be45d2036","title":"Wrapped: 2022","link":"https://libscie.org/wrapped-2022/","published":"Tue, 27 Dec 2022 08:00:34 GMT","description":"2022 was a big year for us at Liberate Science! We’ve achieved a lot with a small team. Join us in a brief review of events.","isPermalink":false,"tags":[],"authors":[{"name":"Liberate Science","url":null}],"image":"https://images.unsplash.com/photo-1433162653888-a571db5ccccf?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=MnwxMTc3M3wwfDF8c2VhcmNofDJ8fHdyYXBwZWR8ZW58MHx8fHwxNjcxMDMxMTg4&ixlib=rb-4.0.3&q=80&w=2000","modified":null,"contentHtml":"<img src=\"https://images.unsplash.com/photo-1433162653888-a571db5ccccf?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=MnwxMTc3M3wwfDF8c2VhcmNofDJ8fHdyYXBwZWR8ZW58MHx8fHwxNjcxMDMxMTg4&ixlib=rb-4.0.3&q=80&w=2000\" alt=\"Wrapped: 2022\"><p>As we are about to start a new calendar and fiscal year, it is helpful to reflect on how we&#x2019;ve done in the past year. Reflection is a helpful tool to celebrate achievements and to give feedback to ourselves, maybe even identify patterns we cannot see in the moment.</p><p>2022 was a big year for us at Liberate Science! We&#x2019;ve achieved a lot with a small team. </p><div class=\"kg-card kg-callout-card kg-callout-card-yellow\"><div class=\"kg-callout-emoji\">&#x1F6CE;&#xFE0F;</div><div class=\"kg-callout-text\">For those just tuning in: We work to promote all research labor and make underlying power structures visible.</div></div><p>Let us review some of the things we achieved in 2022 as a community achieved.</p><h2 id=\"researchequals\">ResearchEquals</h2><p>One of the biggest steps we took this year was the launch of our own open access publishing platform <a href=\"https://researchequals.com\">ResearchEquals</a>. On this platform, researchers publish their process instead of just their outcomes.</p><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img src=\"https://libscie.org/content/images/2022/12/Screenshot-2022-12-14-at-13-46-46-ResearchEquals.com-1.png\" class=\"kg-image\" alt=\"Wrapped: 2022\" loading=\"lazy\" width=\"2000\" height=\"1534\" srcset=\"https://libscie.org/content/images/size/w600/2022/12/Screenshot-2022-12-14-at-13-46-46-ResearchEquals.com-1.png 600w, https://libscie.org/content/images/size/w1000/2022/12/Screenshot-2022-12-14-at-13-46-46-ResearchEquals.com-1.png 1000w, https://libscie.org/content/images/size/w1600/2022/12/Screenshot-2022-12-14-at-13-46-46-ResearchEquals.com-1.png 1600w, https://libscie.org/content/images/size/w2400/2022/12/Screenshot-2022-12-14-at-13-46-46-ResearchEquals.com-1.png 2400w\" sizes=\"(min-width: 720px) 720px\"><figcaption>A mock-up of how publishing on <a href=\"https://researchequals.com\">ResearchEquals</a> looks like.</figcaption></figure><p>After <a href=\"https://libscie.org/hypergraph-lessons-and-future/\">we made the tough decision in the summer of 2021 that rebuilding our publishing platform was necessary</a>, we gave ourselves six months to do so. We wanted to launch on February 1st 2022 with a new platform that not only provided a reliable publishing experience for researchers, but also introduced us to creating DOIs and running a modern web application. In hindsight it is obvious that we succeeded in doing so on time &#x2014; and within budget.</p><p>Since February 1st 2022, ResearchEquals has become home to over 230 people and over 100 research modules!</p><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img src=\"https://libscie.org/content/images/2022/12/Screenshot-2022-12-14-at-11.16.53.png\" class=\"kg-image\" alt=\"Wrapped: 2022\" loading=\"lazy\" width=\"2000\" height=\"711\" srcset=\"https://libscie.org/content/images/size/w600/2022/12/Screenshot-2022-12-14-at-11.16.53.png 600w, https://libscie.org/content/images/size/w1000/2022/12/Screenshot-2022-12-14-at-11.16.53.png 1000w, https://libscie.org/content/images/size/w1600/2022/12/Screenshot-2022-12-14-at-11.16.53.png 1600w, https://libscie.org/content/images/size/w2400/2022/12/Screenshot-2022-12-14-at-11.16.53.png 2400w\" sizes=\"(min-width: 720px) 720px\"><figcaption>Statistics of ResearchEquals as of December 14th, 2022. View these in <a href=\"https://researchequals.com/stats\">real-time on ResearchEquals</a> at any time.</figcaption></figure><p>We are encouraged by this growth as a result of doing eight seminars throughout the year (e.g., at RIOT Science Club, FORRT, Max Planck Institute), the informal conversations we had, and <a href=\"https://libscie.org/researchequals-on-the-berlin-subway/\">the experimental marketing</a> we did. There was no communications strategy to this growth (point of improvement!).</p><p>In order to put those numbers into perspective, we compared them to one of the projects with a longer track record: the Open Science Framework (OSF). <a href=\"https://doi.org/10.31222/osf.io/mn4t2\">In their first year (2012)</a>, 371 people registered on the OSF and published 38 study registrations (average publishing rate of 10%). Comparing that to our 2022 numbers, fewer people registered on the platform, but they published more (average publishing rate of 41%). Of course the platforms aren&#x2019;t the same, but this is still helpful information.</p><p>Note that the OSF inspired ResearchEquals in many ways and we look up to the work they&#x2019;ve done over the past decade. Measuring ourselves based on their growth trajectory allows us to understand what we might be capable of, not to see whether we are outperforming them. We celebrate the OSF for surpassing a <a href=\"https://www.cos.io/blog/surpassing-100000-registrations-on-osf\">100,000 published registrations</a> and <a href=\"https://www.cos.io/blog/celebrating-a-global-open-science-community\">500,000 registered people</a> after a decade of hard work. Our comparison merely allows us to understand whether dreaming of similar numbers for ResearchEquals is realistic!</p><p>Late into 2022, <a href=\"https://youtu.be/Xq0LvlTvIrg\">we launched ResearchEquals Collections</a>. This is a one-click way of creating <a href=\"https://en.wikipedia.org/wiki/Overlay_journal\">overlay journals</a> (or any other kind of curated collection of research objects with a DOI). In the eight weeks since launching Collections, people have already created twelve collections! We feel this is indicative that the idea of curated collections is resonating with people, and that we can carry this idea forward. People <em>want</em> to become their own editor, it seems. We look forward to providing more use cases in 2023 to showcase how Collections help make all the curation work you do more visible.</p><p>We also want to celebrate the fact that we have been running ResearchEquals as a reliable service since launch - we had no major outages whatsoever thanks to our quality assurance procedures. You can view our uptime at any time on <a href=\"https://up.researchequals.com\">our status page</a>.</p><h2 id=\"open-update\">Open Update</h2><p>Another big effort this year was <a href=\"https://anchor.fm/open-update\">the Open Update podcast</a>.</p><p>We ended our first season after 52 episodes of weekly updates to move on to a more intensely produced second season. In the second season we interviewed ten guests about the UNESCO Recommendation on Open Science.</p><p>These seasons helped us provide running tabs on what was happening in the research landscape, plus help provide perspectives on ongoing issues. The main goal, in hindsight, of the Open Update is to create conversations around research labor and the power structures in research. We will carry that forward into 2023 (season 3 is in the works!).</p><p>Spotify provided us with a nice overview of how the podcast has grown this year.</p><figure class=\"kg-card kg-gallery-card kg-width-wide\"><div class=\"kg-gallery-container\"><div class=\"kg-gallery-row\"><div class=\"kg-gallery-image\"><img src=\"https://libscie.org/content/images/2022/12/Screenshot-2022-12-14-at-12.22.26.png\" width=\"2000\" height=\"1136\" loading=\"lazy\" alt=\"Wrapped: 2022\" srcset=\"https://libscie.org/content/images/size/w600/2022/12/Screenshot-2022-12-14-at-12.22.26.png 600w, https://libscie.org/content/images/size/w1000/2022/12/Screenshot-2022-12-14-at-12.22.26.png 1000w, https://libscie.org/content/images/size/w1600/2022/12/Screenshot-2022-12-14-at-12.22.26.png 1600w, https://libscie.org/content/images/size/w2400/2022/12/Screenshot-2022-12-14-at-12.22.26.png 2400w\" sizes=\"(min-width: 720px) 720px\"></div><div class=\"kg-gallery-image\"><img src=\"https://libscie.org/content/images/2022/12/Screenshot-2022-12-14-at-12.23.23.png\" width=\"2000\" height=\"1013\" loading=\"lazy\" alt=\"Wrapped: 2022\" srcset=\"https://libscie.org/content/images/size/w600/2022/12/Screenshot-2022-12-14-at-12.23.23.png 600w, https://libscie.org/content/images/size/w1000/2022/12/Screenshot-2022-12-14-at-12.23.23.png 1000w, https://libscie.org/content/images/size/w1600/2022/12/Screenshot-2022-12-14-at-12.23.23.png 1600w, https://libscie.org/content/images/size/w2400/2022/12/Screenshot-2022-12-14-at-12.23.23.png 2400w\" sizes=\"(min-width: 720px) 720px\"></div><div class=\"kg-gallery-image\"><img src=\"https://libscie.org/content/images/2022/12/Screenshot-2022-12-14-at-12.23.54.png\" width=\"2000\" height=\"1067\" loading=\"lazy\" alt=\"Wrapped: 2022\" srcset=\"https://libscie.org/content/images/size/w600/2022/12/Screenshot-2022-12-14-at-12.23.54.png 600w, https://libscie.org/content/images/size/w1000/2022/12/Screenshot-2022-12-14-at-12.23.54.png 1000w, https://libscie.org/content/images/size/w1600/2022/12/Screenshot-2022-12-14-at-12.23.54.png 1600w, https://libscie.org/content/images/size/w2400/2022/12/Screenshot-2022-12-14-at-12.23.54.png 2400w\" sizes=\"(min-width: 720px) 720px\"></div></div><div class=\"kg-gallery-row\"><div class=\"kg-gallery-image\"><img src=\"https://libscie.org/content/images/2022/12/Screenshot-2022-12-14-at-12.24.22.png\" width=\"2000\" height=\"975\" loading=\"lazy\" alt=\"Wrapped: 2022\" srcset=\"https://libscie.org/content/images/size/w600/2022/12/Screenshot-2022-12-14-at-12.24.22.png 600w, https://libscie.org/content/images/size/w1000/2022/12/Screenshot-2022-12-14-at-12.24.22.png 1000w, https://libscie.org/content/images/size/w1600/2022/12/Screenshot-2022-12-14-at-12.24.22.png 1600w, https://libscie.org/content/images/size/w2400/2022/12/Screenshot-2022-12-14-at-12.24.22.png 2400w\" sizes=\"(min-width: 720px) 720px\"></div><div class=\"kg-gallery-image\"><img src=\"https://libscie.org/content/images/2022/12/Screenshot-2022-12-14-at-12.25.47.png\" width=\"2000\" height=\"1052\" loading=\"lazy\" alt=\"Wrapped: 2022\" srcset=\"https://libscie.org/content/images/size/w600/2022/12/Screenshot-2022-12-14-at-12.25.47.png 600w, https://libscie.org/content/images/size/w1000/2022/12/Screenshot-2022-12-14-at-12.25.47.png 1000w, https://libscie.org/content/images/size/w1600/2022/12/Screenshot-2022-12-14-at-12.25.47.png 1600w, https://libscie.org/content/images/size/w2400/2022/12/Screenshot-2022-12-14-at-12.25.47.png 2400w\" sizes=\"(min-width: 720px) 720px\"></div></div></div></figure><h2 id=\"theory-of-change\">Theory of change</h2><p>Halfway through 2022, <a href=\"https://libscie.org/introducing-our-theory-of-change/\">we introduced our theory of change this year</a>, which we summarise as follows:</p><div class=\"kg-card kg-callout-card kg-callout-card-grey\"><div class=\"kg-callout-emoji\">&#x2728;</div><div class=\"kg-callout-text\">We foster a self-sustaining research commons, in order to advance and bridge different ways of knowing. To that end, we work to promote all research labor and make underlying power structures visible.</div></div><p>The details go a bit deeper and the main difference with other theories of change is that we include the power dynamics into the analysis. </p><p>We focus on making research work visible and harness the idea that there is no meritocratic, level playing field. Whether the causes come from individuals or systems, conscious or unconscious behaviour, they are in effect and important to take into account as we strive to make an impact on improving research as a whole.</p><p>With ResearchEquals we realised the tools to make visible the research steps that remain unpublished in journals. With ResearchEquals Collections we realised the tools to make visible the curation of research that already happens by researchers in a variety of forms. These relate to two of our aims that we want to realise in the next 2 years - the question for 2023 remains how to build on that. The technological infrastructure means nothing without the human infrastructure to support it.</p><p>While we did set ourselves several goals for 2022 in the theory of change, we realised upon reflecting whether we achieved those that they were not specific enough (<a href=\"https://libscie.org/theory-of-change/#outputs-activities-2022\">view the details here</a>). Our activities for 2023 will be better to evaluate against, and we will be sharing an initial set shortly. </p><h2 id=\"business-development\">Business development</h2><p>In 2022, we grew the business' revenue every quarter, reaching ~25% of our spend in the final quarter (denoted #9 below). We have generated income primarily from our consulting activities (>90%) and some from our products on ResearchEquals.</p><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img src=\"https://libscie.org/content/images/2022/12/image.png\" class=\"kg-image\" alt=\"Wrapped: 2022\" loading=\"lazy\" width=\"1808\" height=\"1110\" srcset=\"https://libscie.org/content/images/size/w600/2022/12/image.png 600w, https://libscie.org/content/images/size/w1000/2022/12/image.png 1000w, https://libscie.org/content/images/size/w1600/2022/12/image.png 1600w, https://libscie.org/content/images/2022/12/image.png 1808w\" sizes=\"(min-width: 720px) 720px\"><figcaption>Percentage of costs covered by own revenue per quarter.</figcaption></figure><p>For product income, we introduced three business models in ResearchEquals. We introduced...</p><ol><li>...the <strong>Pay to Close</strong> model with the launch of ResearchEquals, but did not market this. It was never intended to make us money, as we are in this business to create open research. </li><li>...the <strong>Pay-What-You-Want</strong> model, which on average 30% of publishing authors used since its introduction (on average paying &#x20AC;15). We consider these as showcases of support &#x2014; everytime we get one of these, we do a little dance! &#x1F57A;&#x1F3FB;&#x1F483;&#x1F3FD;</li><li>...the paid <strong>Collections</strong>, which have been driving some revenue since introduction in November. </li></ol><p>Overall, we see that the business is still heavily dependent on consulting income, but product income is growing. In 2023, we will have to take this into account.</p><p>Finally, we have also been institutionalising the values of our manifesto and open scholarship more broadly into our organisation. For example, some of our highlights:</p><ul><li>We signed on to <a href=\"https://libscie.org/principles-of-open-scholarly-infrastructure-2022/\">the Principles of Open Scholarly Infrastructure</a></li><li>We set up policies that embed equity in our organisational culture (like our <a href=\"https://libscie.org/introducing-our-event-policy/\">Event Policy</a>)</li><li>We estimated <a href=\"https://libscie.org/ghg-2021/\">our 2021 carbon emissions</a> (-30% from 2020)</li><li>1% of our payments processed through Stripe are <a href=\"https://libscie.org/ecological-sustainability-1-pledge/\">committed to permanent carbon removal projects</a></li></ul><hr><p>In conclusion, 2022 was a year full of exciting developments. This work was made possible by many people, so thanks to our supporting members, our contractors, our core team, and all community contributors!</p><p>We look forward to sharing our 2023 plans in the not too distant future with you!</p>"},{"id":"63906f06261a1e6be45d1e96","title":"Introducing Liberate Science Labs","link":"https://libscie.org/introducing-liberate-science-labs/","published":"Tue, 20 Dec 2022 08:00:38 GMT","description":"We’re starting Liberate Science Labs to provide a space for further experimentation and pushing the envelope.","isPermalink":false,"tags":["Labs"],"authors":[{"name":"Chris Hartgerink","url":null}],"image":"https://images.unsplash.com/photo-1602062083396-750ace19e226?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=MnwxMTc3M3wwfDF8c2VhcmNofDIyfHxzcGljeXxlbnwwfHx8fDE2NzA0MTU1NzQ&ixlib=rb-4.0.3&q=80&w=2000","modified":null,"contentHtml":"<img src=\"https://images.unsplash.com/photo-1602062083396-750ace19e226?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=MnwxMTc3M3wwfDF8c2VhcmNofDIyfHxzcGljeXxlbnwwfHx8fDE2NzA0MTU1NzQ&ixlib=rb-4.0.3&q=80&w=2000\" alt=\"Introducing Liberate Science Labs\"><p>I founded Liberate Science in October 2019 to realise <a href=\"https://researchequals.com/\">ResearchEquals</a>. Thanks to the Shuttleworth Foundation&#x2019;s support over the past three years, ResearchEquals now exists and we have been in production for 10 months &#x2014; since then <a href=\"https://up.researchequals.com/\">we&#x2019;ve had zero downtime</a>! We will continue to develop ways for you to make your research work visible and are committed to doing that for the long haul.</p><p>At the same time we recognise the need to be creative and experiment in order to sustain our collective ingenuity for change. Experimenting with ResearchEquals is limited in that sense because you have come to rely on it for your day to day work. It needs to be predictable, stable, and reliable. Experimenting means change and risk, which means less predictable and reliable.</p><p>We&#x2019;re starting Liberate Science Labs to provide a space for further experimentation and pushing the envelope. Not just for ResearchEquals, but also on other domains that are in line with our <a href=\"https://libscie.org/liberate-science-manifesto/\">manifesto</a> and <a href=\"https://libscie.org/theory-of-change/\">theory of change</a>. How can we better understand how power systems prevent changes to how we do research? How might we organise more effectively?</p><p><em>Liberate Science Labs provides a space to explore and be nimble in how to create change.</em> That can be new ideas, theories, projects, forms of organising, and anything else. Some of it will stick, some of it will not. </p><p>Labs initiatives are never forever and do not have to scale. They do not need to make money (they&#x2019;re allowed to) and they are there to allow creativity.</p><p>Personally, the Labs framework helped me realise that some of what we do is already a part of this. We have been running preprint bots on Twitter for the past three years to increase awareness of preprints (<a href=\"https://twitter.com/PsyArXivBot\">PsyArxivBot</a>, <a href=\"https://twitter.com/metaarxiv\">MetaArxiv Bot</a>, and <a href=\"https://twitter.com/edarxivbot\">EdarxivBot</a>). We consulted on a research project to realise a tool that helps reduce privacy violations in open data (<a href=\"https://libscie.org/p/6296df81-3996-4d9d-8d73-253b62b93bdd/\">the <code>datacheck</code>project</a>), in an attempt to balance the scales between sharing and respecting people&#x2019;s privacy. The <a href=\"https://libscie.org/open-update/\">Open Update</a> podcast was a way for us to share the news and create discussions.</p><!--kg-card-begin: html--><div class=\"mermaid\">\n    graph TD;\n  A[Liberate Science] --> B[ResearchEquals]\n  A --> C[Labs]\n  C --> D[Preprint bots]\n  C --> E[datacheck]\n  C --> F[Open Update]\n\n</div><!--kg-card-end: html--><p>Liberate Science Labs will help us incubate ideas and support community led projects that align with our theory of change. We are already talking with several potential partners that want to do more and where we can help. </p><p>Liberate Science Labs will return in 2023 with more information&#x2026; &#x1F60A;</p>"}]}