{"version":"https://jsonfeed.org/version/1.1","id":"n6x4a73","title":"Chris Hartgerink","description":"Chris Hartgerink","homePageUrl":"https://www.chjh.nl/","feedUrl":"https://www.chjh.nl/rss/","favicon":"https://www.chjh.nl/favicon.png","items":[{"id":"6401eaa03680b9003d7eaf70","title":"Arbitrary application of arbitrary rules","link":"https://www.chjh.nl/you-may-not-ask-a-question/","published":"Mon, 27 Mar 2023 12:27:16 GMT","description":"When there are rules, who decides what they are intended for and how they are applied?","isPermalink":false,"tags":["Stories from my PhD"],"authors":[{"name":"Chris Hartgerink","url":null}],"image":"https://www.chjh.nl/content/images/2023/03/5.jpg","modified":null,"contentHtml":"<div class=\"kg-card kg-callout-card kg-callout-card-grey\"><div class=\"kg-callout-emoji\">&#x1F4A1;</div><div class=\"kg-callout-text\">This is a post in a series of <a href=\"https://www.chjh.nl/tag/stories-from-my-phd/\">Stories From My PhD</a>. For background on this series, <a href=\"https://www.chjh.nl/revisiting-my-phd/\">read the announcement post</a>.</div></div><img src=\"https://www.chjh.nl/content/images/2023/03/5.jpg\" alt=\"Arbitrary application of arbitrary rules\"><p>I have been to a few dozen dissertation defenses over the past decade. As a result of attending PhD defenses on a fairly regular basis with the same folk, their procedures got discussed. A lot. </p><p>This story is about a situation where a university's own arbitrary regulations are arbitrarily not applied.</p><hr><p>PhD regulations may vary from university to university, but they all follow similar broad strokes. For Dutch universities, I know you can find the PhD regulations easily. For example (and for no particular reason), I looked up and found <a href=\"https://www.uva.nl/binaries/content/assets/uva/en/research/phd/procedures/doctorate-regulations-_uva_en_2020-28-08-2020.pdf?ref=chjh.nl\">the PhD regulations of the University of Amsterdam</a> within less than a minute.</p><p>I attended local defenses, from the department I was in or of colleagues across the university. It made me intimately familiar with the practical aspects of the formal procedures, that are incredibly arbitrary at times and discriminating at worst.</p><p>&#x201C;Why do they have to start with a prayer?&#x201D; was not an uncommon question at my <a href=\"https://en.wikipedia.org/wiki/Alma_mater?ref=chjh.nl\">alma mater</a>.</p><p>&#x201C;Will the male professors take off their cap&#x201D; the chair would proclaim without hesitation, leaving non-male professors clearly and logically confused.</p><p>Being in the audience, there is time to think and criticize these things. There is no pressure on attending, and honestly, not every defense is as interesting. Not because of skill of the PhD candidate though. Some of the topics simply went way over my head; sometimes the committee asked trivial questions. Questions that were so generic you could predict them based on who was in the committee alone.</p><p>Sometimes, all I could do was to think about how an institute&#x2019;s banal regulations shape the life event of another. A PhD is protocolled from its inception, planning, through to its closing. Oddly enough, the banality of it made me so bored, it was the perfect motivation to make terse legal documents interesting to me all of a sudden. Like when I read the bleach or soap stickers on the toilet.</p><p>During one of my boredom expeditions, I stumbled upon this clause in the regulations:</p><blockquote>Persons other than the members of the PhD committee present at the defense may interrogate the PhD candidate, provided they have submitted a written request [&#x2026;] at least one week in advance and been granted his permission.</blockquote><p>I had heard in discussions before that this existed, but I had not actually read it before. Anyone in the audience could ask questions, save they submitted them prior to the defense! I knew I wanted to ask a question at a PhD defense at least once, as an audience member.</p><p>Asking a question at such an important moment means having to get intimately familiar with the person&#x2019;s work so you can ask a decent question. I joked around to ask a banal question, but never seriously wanted to do that. That would be bullying. It would also be rather obnoxious to do this out of the blue, because I know I tend to ask intense questions (and a defense can be nerve-wracking). So, I asked around with people who&#x2019;s defense was coming up. </p><p>\"How would you feel if I submitted a question?\"</p><p>I only wanted to do this with consent &#x2014; and I got it in 2017. </p><p>\"Heck yeah, that's fun!\" one of my colleagues responded. I latched on to that yes and got going. </p><p>In preparation, I read the entire dissertation, and formulated my question thoughtfully and seriously. I was fairly proud, because it was not my domain of expertise to begin with. The candidate told me the general idea behind my question was interesting (I did not disclose the exact question).</p><p>In a more than timely fashion, I sent my question a month in advance to the Director of the Graduate School. All I got back was the following:</p><blockquote>This regulation is not meant for questions from the audience. You may not ask your question and the regulations will be amended to reflect that.</blockquote><hr><p>The regulation for questions from the audience does not say on what grounds permission may be declined. As a result, that decision can be incredibly arbitrary and may still be valid. What \"Persons other than the members of the PhD committee present\" means if not also the audience, I do not know.</p><p>The PhD regulations did not provide any appeal procedures for this specific scenario. All appeals related to the PhD candidate directly, not to third parties who wanted to apply those same regulations. It felt like the rules were applied arbitrarily and to the convenience of those wielding them. But because this story was intertwined with several other stories from my PhD, I decided to leave it. I did not have the energy to push this.</p><p>To this day, the regulation has not been amended (I checked). If you are at my alma mater and want to ask a question as an audience member: Check out <a href=\"https://www.tilburguniversity.edu/sites/default/files/download/Promotiereglement%20Tilburg%20University_ENG.pdf?ref=chjh.nl\">Article 9.4.5</a> and let me know how it goes &#x1F609;</p>"},{"id":"64181775471c6f003d880750","title":"Gender gaps as symptoms of patriarchy","link":"https://www.chjh.nl/gender-gaps-as-symptoms-of-patriarchy/","published":"Mon, 20 Mar 2023 08:34:50 GMT","description":"In this post, I share some thoughts on gender gaps in academia and society more broadly.","isPermalink":false,"tags":["Speech"],"authors":[{"name":"Chris Hartgerink","url":null}],"image":"https://images.unsplash.com/photo-1633277193619-a73de6c5701b?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=MnwxMTc3M3wwfDF8c2VhcmNofDJ8fHBhdHJpYXJjaHl8ZW58MHx8fHwxNjc5MzAwNDg2&ixlib=rb-4.0.3&q=80&w=2000","modified":null,"contentHtml":"<div class=\"kg-card kg-callout-card kg-callout-card-blue\"><div class=\"kg-callout-emoji\">&#x1F4A1;</div><div class=\"kg-callout-text\">These are prepared remarks for the Choice Hackathon on March 18th, 2023. <a href=\"https://www.youtube.com/watch?v=dz0_aPICfTk&ref=chjh.nl\">Find the recording on YouTube</a>.</div></div><img src=\"https://images.unsplash.com/photo-1633277193619-a73de6c5701b?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=MnwxMTc3M3wwfDF8c2VhcmNofDJ8fHBhdHJpYXJjaHl8ZW58MHx8fHwxNjc5MzAwNDg2&ixlib=rb-4.0.3&q=80&w=2000\" alt=\"Gender gaps as symptoms of patriarchy\"><p>When we think of gender gaps in academia or society more broadly, we may think of very specific issues. But gender gaps are mere symptoms, with a common cause: The patriarchy. This is a system where maleness ultimately dominates, at the cost of everyone.</p><p>A concrete, quantified gender gap could be the wage differences between men and women. <a href=\"https://ec.europa.eu/eurostat/statistics-explained/index.php?title=Gender_pay_gap_statistics&ref=chjh.nl\">In Germany, where I live, it is 18%. In Romania, where you live, it is 4%</a>.</p><p>Another concrete gender gap, more specific to academia, is attrition of women throughout the career ladder. Despite the almost equal start for students, the gender gap widens over the course of a career. At the end of the career ladder, there&#x2019;s three men for every one women professors. If we resolve this gap, it however does not mean maleness has been overcome - massculine traits may simply spill over into the women who make it to full professor (a type of <a href=\"https://en.wikipedia.org/wiki/Queen_bee_syndrome?ref=chjh.nl\">queen bee behavior</a>).</p><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img src=\"https://www.chjh.nl/content/images/2023/03/Screenshot-2023-03-18-at-10.45.45.png\" class=\"kg-image\" alt=\"Gender gaps as symptoms of patriarchy\" loading=\"lazy\" width=\"2000\" height=\"1798\" srcset=\"https://www.chjh.nl/content/images/size/w600/2023/03/Screenshot-2023-03-18-at-10.45.45.png 600w, https://www.chjh.nl/content/images/size/w1000/2023/03/Screenshot-2023-03-18-at-10.45.45.png 1000w, https://www.chjh.nl/content/images/size/w1600/2023/03/Screenshot-2023-03-18-at-10.45.45.png 1600w, https://www.chjh.nl/content/images/2023/03/Screenshot-2023-03-18-at-10.45.45.png 2002w\" sizes=\"(min-width: 720px) 720px\"><figcaption>The gender gap in positions in academia. Source: <a href=\"https://www.lnvh.nl/monitor2022/EN.html?ref=chjh.nl\">The Dutch Network of Women Professors</a>.</figcaption></figure><p>Another concrete quantified gender gap is the percentage of board members that aren&#x2019;t men. The EU wants <a href=\"https://ec.europa.eu/commission/presscorner/detail/es/statement_22_7074?ref=chjh.nl\">40% of board members to be non-male by 2026</a>, but will that mean they are less male in their behavior too? What is required of non-male folk to become a part of those boards? The gender gap goes deeper than the identity, it goes to behavior. We internalize power into how we act and what we believe is right - there is plenty of internalized sexism going around.</p><p>What I am trying to hint at here is that gender gaps tend to be helpful in quantifying differences, but when there are no more numeric differences, it does not mean there are no more qualitative differences. Are people able to be who they are in these spaces? Or are they conforming to the expectations of gender stereotypes?</p><p>This is where I&#x2019;d like to introduce the concept of <a href=\"https://en.wikipedia.org/wiki/Doing_gender?ref=chjh.nl\">&#x201C;Doing gender.&#x201D;</a></p><p>In this concept, gender is nothing but a social performance. We construct our gender by how we behave. Sex assigned at birth only assigns the expectation of a role.</p><p>If we say somebody is being assertive, you may be more likely to imagine a man. If somebody&#x2019;s caring for a person, you may be more likely to imagine a woman.</p><p>Likewise, in academia, the person speaking too much in a meeting is more likely to be a man. Establishing dominance and assertivity are masculine traits after all. The note taker and people organizer, making sure everyone is heard and tended to, is more likely to be a woman. Women are more likely to be unconsciously assigned this role.</p><p>This is the real, everyday and practical consequences of what it means to do gender.</p><p>To close gender gaps, we need to look beyond merely the numbers into what we do on an everyday basis. If we look only at the numbers, we will just start a game of whack-a-mole: Address one thing for another to pop up. How do we start undoing male dominance? More practically: What can you do to affect this?</p><hr><p>Gender gaps indicate sexism, but misogyny is the policing of those gaps so that they stay or widen.</p><p>The philosopher Kate Manne, in her book <a href=\"http://www.katemanne.net/down-girl.html?ref=chjh.nl\">Down Girl</a>, explains misogyny as the act of punishing women who challenge male dominance &#x2014; the patriarchy. Through that, we can see misogyny in practice easily.</p><p>Take for example, the history of #MeToo in academia, the time where many victims of sexual harassment finally felt capable to speak up about what happened to them.</p><p>Many male professors indicated that, as a result, they would no longer supervise or meet with women students one on one. They wanted to prevent sexual harassment allegations, ultimately against themselves. This is not a genuine concern about women&#x2019;s well-being. If they were genuinely concerned, they &#xA0;would listen to women, instead of centring their own perspective.</p><p>Within Kate Manne&#x2019;s framework, professors denying supervision to women is easy to be seen as misogyny - the punishing of individual women for women as a whole speaking up about sexual harassment. It reinforces the gender gap of speaking out against injustice.</p><p>And the lists of punishment go on and on: Speak up about sexism, and you are more likely to be seen as a trouble maker, and ultimately fired.</p><p>Just last week, professor Susanne T&#xE4;uber was <a href=\"https://deeplink.rechtspraak.nl/uitspraak?id=ECLI%3ANL%3ARBNNE%3A2023%3A854&ref=chjh.nl\">legally (!) fired from their Dutch University</a>, for raising concerns regarding social safety, including around sexist behavior. The university said prof T&#xE4;uber disrupted the employment relationship - and punished their behavior by firing them. Misogyny in practice, among many other things.</p><hr><p>Misogyny ensures gender gaps stay. But when we talk about gender gaps as a whole, we often get stuck in a binary. Man. Woman. What about everyone else?</p><p>If gender is a social performance, if we do gender, then that means we are not restricted to two roles. We can generate new roles and new genders for ourselves. This is where discussion of many gender gaps break down, because it is not even being quantified.</p><p>Transgender folk, non-binary folk, they cannot even start to perform their role, to do their gender, because of the policing going on to maintain the binary. I experience it almost every day: Forms that do not have any other options than man or woman. The pressure to gender based on your name &#x2014; the letters full of &#x201C;Dear Sir&#x201D; when I have never even disclosed to them I am a sir, madame, or anything else.</p><p>Academia has a big problem with gender beyond the binary. When people are <a href=\"https://link.springer.com/book/10.1007/978-3-030-83617-7?ref=chjh.nl\">redoing gender</a>, they are simply erased, ignored, or punished. </p><p>Take for example the issue of research on gender. </p><p>Much research now exists to study and quantify gender differences, to help identify gender gaps, which is in a way, a good thing. In order to do that though, they have to determine the gender - something you cannot do without asking people, except if you resort to simply assigning it for them. If gender is a social role, assigning it is an act of male dominance in and of itself - taking the authority to assign it.</p><p>And this is exactly what many studies do: Assign gender. </p><p>Researchers use algorithms to pretend they can get an objective gender assignment, hiding behind statistics. My name is Chris, so I am likely to be a man because most other people named Chris identify as man. There is not even an option for that to be non-binary, trans, or anything else at this point. </p><p>The research then only identifies gender gaps between men and women, creating a much too simple model. What are the more complex gender gaps? Those that go beyond the binary and allow us to understand more deeply the interaction between identifying with the sex assigned at birth, also called cis gender, and being trans?</p><p>By assigning gender as a binary, the gender stays in a binary.</p><p>We do not even get to see the gender gaps that go beyond the binary - let alone truly start addressing how male dominance limits gender equality beyond the binary either.</p><p>All to say, gender gaps are real, yes.</p><p>Removing gender gaps in the numbers, however, does not remove the gender gaps in practice. We live in a male dominated society - from systems, to people, to the individual traits and behaviors. The <a href=\"https://www.theguardian.com/global-development/2023/mar/06/antonio-guterres-un-general-assembly-gender-equality?ref=chjh.nl\">secretary general of the United Nations said</a> it will take another 300 years to reach gender equality at the current pace - but that&#x2019;s only in the numbers. At this pace, it may take another 3000 years for it to go beyond the numbers, if we don&#x2019;t start picking up the pace and struggling for it harder.</p>"},{"id":"63e61bc80ea212003dc5da12","title":"My ongoing gender journey","link":"https://www.chjh.nl/my-gender-journey/","published":"Mon, 13 Mar 2023 15:24:06 GMT","description":"I used to think I was a man&#x2019;s man and heterosexual &#x2014; but why?Where I grew up there was little public exposure beyond the traditional gender roles and heteronormative behaviors. As a kid, for...","isPermalink":false,"tags":["Personal"],"authors":[{"name":"Chris Hartgerink","url":null}],"image":"https://images.unsplash.com/photo-1624789443801-2ef65248c665?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=MnwxMTc3M3wwfDF8c2VhcmNofDIyfHxnZW5kZXJ8ZW58MHx8fHwxNjc2MDI0Nzkw&ixlib=rb-4.0.3&q=80&w=2000","modified":null,"contentHtml":"<img src=\"https://images.unsplash.com/photo-1624789443801-2ef65248c665?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=MnwxMTc3M3wwfDF8c2VhcmNofDIyfHxnZW5kZXJ8ZW58MHx8fHwxNjc2MDI0Nzkw&ixlib=rb-4.0.3&q=80&w=2000\" alt=\"My ongoing gender journey\"><p>I used to think I was a man&#x2019;s man and heterosexual &#x2014; but why?</p><p>Where I grew up there was little public exposure beyond the traditional gender roles and heteronormative behaviors. As a kid, for example, I could have been convinced it was completely normal that my elementary school teacher tried to convert my left-handed writing, because it supposedly was a sign of the devil (anno 1999 in a Catholic region). Luckily, my mom thought it was ridiculous and let me do my thing.</p><p>At my high school, a few gay people were publicly out, but I was still trying so hard to fit in and be accepted that it didn&#x2019;t even occur to me to explore my gender or my sexuality. Like so many in this world, I was bullied in elementary and in high school, making me feel left out of the experiences so many of the people around me <strong><strong><strong>seemed</strong></strong></strong> to be having. I vividly remember getting threatened for some mundane thing only adolescents would threaten somebody over. In an attempt to find some purpose, I resorted to identifying with my societally assigned gender: What being a man meant to me.</p><p>The lure of identifying with masculinity was strong, straightforward, and societally accepted. The cis resources are plentifold &#x2014; websites like &#x201C;the Art of Manliness&#x201D;, \"the Bro Code\", or videos told me what it meant to be a traditional, cis man in modern times. They provided solace and affiliation but at a cost. Spoiler alert: Lots of those resources promoted toxic masculinity, even if in a modern jacket.</p><p>In hindsight, I was desperate to find validation and affection. Cisgender norms provided me with a structure to validate myself. Heteronormativity and raging hormones meant I directed my need for affection outward. I remember having crushes on girls left and right, not understanding that it had more to do with the affection I lacked for myself than the affection they gave me.</p><p>As I went from adolescence to young adulthood, I slowly started understanding myself more and more as I physically and emotionally moved on from the area I grew up in. It was like I was not just moving on from that time period, but that I was also moving from the embodied feelings associated with those points in space-time.</p><p>At university as a twenty-something, I (of course) still struggled with finding a purpose, but I slowly started to understand that I had been forcing myself into boxes that need not be. I found ways to become more comfortable with myself, through finding my own competencies, regardless of the identity others ascribed to me. After struggling with many superficial friendships, I was able to find the relational depth I needed. Breaking out of boxes has been a slow process occurring gradually for a decade, which I was unable to acknowledge for a long time due to unnoticable minimal differences. The insights came at the time I was ready for them, I like to think.</p><p>All that to say that only some years ago, I became comfortable to explore and say I am bisexual.</p><p>All that to say that over the past years, I have been becoming more knowledgable and comfortable to let go of gender expectations. I&#x2019;ve become more comfortable exploring my gender, and overall how I want to be, instead of who I am expected to be. Even in that journey, I have had expectations as to my identity (gay people expecting I&#x2019;m gay). The only terminology I really have found some affiliation with is queer. It&#x2019;s many things at once, and ambiguous from the start.</p><p>In a process of unlearning, I become even better at what I have come to be real good at: Be my own voice of reason for radical change.</p><p>Some people reading this may not even know some of the things I write in here because I actively did not share. In an individualized society we are still products of the complex collective systems we find ourselves in &#x2014; me not sharing is more because of how we are all products of our society rather than anything that has to do just with you specifically.</p><p>This journey of understanding is not solely one I observed on my own. It has been inspired by the many other people sharing their gender journey and showcasing that our boxes can be presents in which we find ourselves. The increased visibility of LGBTQIA+ helped me go on my own journey as the information is right there for the interested to find. If people are interested, I am happy to share some of the resources that helped me at a future time. Thank you to all the ancestors who came before me, and created the resources that are helping me find my presents.</p><hr><p>I started writing this blog as an introduction for a completely different topic. I did not realize I wanted to tell this story until I wrote it. </p><p>I&#x2019;ll follow up later with the topic I actually wanted to write about: My increasing frustrations with those researchers who assign gender in their studies.</p>"},{"id":"63ef75abdad7d1003df15f0a","title":"Committing to an Ethics Code","link":"https://www.chjh.nl/the-choice-between-policing-or-cultivating-ethics/","published":"Mon, 27 Feb 2023 07:01:06 GMT","description":"How can we cultivate a culture of ethical conduct? A story on one approach that may not have achieved a richer culture.","isPermalink":false,"tags":["Stories from my PhD"],"authors":[{"name":"Chris Hartgerink","url":null}],"image":"https://images.unsplash.com/photo-1626005600953-fb5538488270?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=MnwxMTc3M3wwfDF8c2VhcmNofDEzfHxjdWx0aXZhdGV8ZW58MHx8fHwxNjc2NjM3NjIy&ixlib=rb-4.0.3&q=80&w=2000","modified":null,"contentHtml":"<div class=\"kg-card kg-callout-card kg-callout-card-grey\"><div class=\"kg-callout-emoji\">&#x1F4A1;</div><div class=\"kg-callout-text\">This is a post in a series of Stories From My PhD. For background on this series, <a href=\"https://www.chjh.nl/revisiting-my-phd/\">read the announcement post</a>.</div></div><img src=\"https://images.unsplash.com/photo-1626005600953-fb5538488270?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=MnwxMTc3M3wwfDF8c2VhcmNofDEzfHxjdWx0aXZhdGV8ZW58MHx8fHwxNjc2NjM3NjIy&ixlib=rb-4.0.3&q=80&w=2000\" alt=\"Committing to an Ethics Code\"><p>As a researcher you are bound to uphold certain standards of conduct.</p><p>When I defended my PhD, I was reminded of that rather explicitly with the following statement before being awarded my degree:</p><blockquote>You acquire hereby all the rights that by law or custom, are made or will be attached to the doctorate. Apart from rights, the doctorate also comes with obligations. These first of all include the execution of research and all scholarly activities with utmost integrity.</blockquote><blockquote>The privilege of being a doctor also entails that society needs to be able to rely on the sound and independent judgment of those holding a doctorate.</blockquote><p>This statement was only introduced in the past decade, but I think a reminder like this is a simple and effective idea. After all, it <em>is</em> a serious responsibility to have a PhD. Things proclaimed by people with a Dr. in front of their name are taken more seriously, whether we like it or not &#x2014; whether they are correct or not.</p><p>Academic institutions hold the burden to uphold that integrity. This story, based on real events, showcases one instance of how that was done. This Story from my PhD is edited to focus on the events, not the people involved.</p><hr><p>On a day like every other, I sat behind my computer and worked on statistical analyses, bantered on email, and created memes to make life fun. Every too often, I would get up to visit the vending machine overlooking the forest. This day would be interestingly different.</p><p>&#x201C;Ping!&#x201D; the email client chimed.</p><p>&#x201C;We request you to fill in a declaration confirming your your commitment to academic integrity.&#x201D;</p><p>It looked like it was an internal announcement and I confusedly asked my office mates whether they got this message as well.</p><p>&#x201C;Lemme check&#x2026;&#x201D; they responded stoicly.</p><p>Before long, there was some chatter in the hallways. Everyone on our floor received this email. It would not take long to discover everyone on all floors, in all buildings received it.</p><p>&#x201C;Acting with integrity is the foundation of sound and reliable academic practice. We greatly value compliance with these principles. You are expected to observe the Ethics Code and we request that you make a declaration confirming your commitment to academic integrity.&#x201D;</p><p>People ended up giggling about this at lunch. </p><p>&#x201C;Of course we are committed to integrity!&#x201D; was the common feeling. Even those who may not have been committed would need to proclaim this now.</p><p>Most people signed, no matter how obvious it sounded. I did not sign it, thinking it was simply another bureaucratic shenanigan like so many, which would fizzle out with no consequences.</p><p>&#x201C;Do this!&#x201D;</p><p>&#x201C;Why?&#x201D;</p><p>&#x201C;Because we say so.&#x201D;</p><p>Is it ethical to justify things only because of the power to &#xA0;be able to proclaim something needs to happen? It felt like a rather empty request.</p><p>During the following weeks, I heard more about this initiative by chance when I attended a talk on research integrity by a professor from my university.</p><p>&#x201C;We are requiring all employees to sign a statement affirming their commitment to the Ethics Code&#x201D; the professor proclaimed proudly and to my surprise.</p><p>After the talk, I found them sipping a coffee and asked: &#x201C;Did you mean that, that it is a requirement?&#x201D; </p><p>&#x201C;I haven&#x2019;t signed it yet and I was not aware it was required.&#x201D;</p><p>&#x201C;You understand that after recent events, we need to step up\" the professor argued. \"We need to make it clear that we do not tolerate unethical conduct.&#x201D;</p><p>I nodded along as the dutiful PhD student is expected to when talking to a professor known to not be the most considerate to begin with.</p><p>&#x201C;I strongly urge you to sign it, otherwise we may need to take steps. Most people already signed, so just come along. It may result in negative consequences if you don&#x2019;t.&#x201D; </p><p>The professor's words did not feel as urgent as they might have been intended. </p><p>Most people clicked the link, checked the box, and pressed submit. They declared their commitment to the Ethics Code. I cannot blame them &#x2014; it is the path of least resistance. &#x201C;Who am I to say no? I don&#x2019;t want to have to deal with this&#x201D; is a thought I have to constantly fight against.</p><p>I also supported the Ethics Code, but what was happening here was not a commitment. It was following orders. Weeks would pass with me not signing.</p><p>&#x201C;A month ago we sent you a request to fill in a declaration confirming your commitment to academic integrity. You have not yet entered such confirmation. This possibly has slipped your mind. We kindly request you to take this action in the next two weeks&#x201D; a follow up email told me.</p><p>Things came together when I read that email. Hours later, with some more research under my belt on (pan-)university policies and my own employment contract, I replied.</p><p>&#x201C;Thanks for the reminder&#x201D; I started off. &#x201C;I don&#x2019;t really understand why this explicit request is necessary, and why it is not communicated as a requirement if it is in fact required.&#x201D;</p><p>&#x201C;The Ethics Code itself states&#x201D; I continued, &#x201C;that all universities are bound by it. My employment contract also states this already. Declaring my commitment would result in the same situation as is already the case.&#x201D;</p><p>I finished with an invitation. &#x201C;I would like to talk about the origins and goals of this measure, so I can make an informed decision about what to do. Research ethics is a daily topic for me, as it is part of my specialization.&#x201D;</p><p>This apparently was a reason to escalate.</p><p>&#x201C;Legally an employee may not refuse a reasonable request from the employer, unless they&#x2019;re looking for a problem in the employment relation, with the most severe consequence getting fired.&#x201D;</p><p>&#x201C;You say you support the Ethics Code. Can't you just sign it then?&#x201D;</p><p>After some back and forth veiled by the spectre of getting fired and the accompanying stress for a PhD candidate, I received the answer I was looking for all along:</p><blockquote>The Ethics Code is not well known. Signing a commitment declaring support for the Ethics Code provides legal certainty to fire somebody when necessary.</blockquote><hr><p>I am in favor of upholding integrity, yet this approach felt like it missed the mark. It felt like a bureaucrat's straightforward solution to a much more complex issue. Some might say, better than nothing &#x2014; what does a commitment mean if it has to be made when the weight of an institution starts coming down on you, really? </p><p>This approach was a choice to solve a problem &#x2014; and I wonder whether they actually did solve the problem in the end. It of course depends on the problem they defined at the start.</p>"},{"id":"63d6e296ee6ba9003d9de83e","title":"The Excellence Paradox: Selecting for excellence is self-defeating","link":"https://www.chjh.nl/the-excellence-paradox/","published":"Mon, 13 Feb 2023 15:54:09 GMT","description":"Does it really make sense to select only the best? I explore how excellence is self-defeating from a theoretical probability perspective.","isPermalink":false,"tags":["Research Commons"],"authors":[{"name":"Chris Hartgerink","url":null}],"image":"https://images.unsplash.com/photo-1611075384322-731537ad7971?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=MnwxMTc3M3wwfDF8c2VhcmNofDJ8fGV4Y2VsbGVuY2V8ZW58MHx8fHwxNjc1MDI3MTYx&ixlib=rb-4.0.3&q=80&w=2000","modified":null,"contentHtml":"<div class=\"kg-card kg-callout-card kg-callout-card-purple\"><div class=\"kg-callout-emoji\">&#x1F4A1;</div><div class=\"kg-callout-text\">This is an idea I've toyed around with for a few years, but never wrote down. I would love to hear your feedback!</div></div><!--kg-card-begin: markdown--><img src=\"https://images.unsplash.com/photo-1611075384322-731537ad7971?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=MnwxMTc3M3wwfDF8c2VhcmNofDJ8fGV4Y2VsbGVuY2V8ZW58MHx8fHwxNjc1MDI3MTYx&ixlib=rb-4.0.3&q=80&w=2000\" alt=\"The Excellence Paradox: Selecting for excellence is self-defeating\"><p>Competitive research processes lead to many perverse incentives - incentives that put the researcher and the research process at odds. For example, because of selective publication pressures researchers primarily end up publishing those research processes that end up in significant or novel results. This despite longstanding evidence that this form of publication bias reduces the validity of findings drastically.</p>\n<p>Another perverse incentive is the notion of &#x201C;excellence&#x201D; in a competitive landscape. It seems logical: Select the best to get the best. That it seems logical, does not make this logic consistent with reality. In this blog I outline why selecting for excellence is self-defeating, and you do <strong><strong>not</strong></strong> end up with the best by trying to select for the best.</p>\n<p>By most practical definitions, excellence is reserved for the few. The excellent are the cream of the crop. As such, excellence is most often defined relatively. Consider this scenario: If there are a 100 people, the top ten performing people could be considered the excellent ones.<sup class=\"footnote-ref\"><a href=\"#fn1\" id=\"fnref1\">[1]</a></sup></p>\n<p>Beyond an alleged means to select the best, selecting for excellence also bakes in exclusivity, scarcity, and inflated value. Even if hypothetically every single one of the 100 people could be considered excellent to some degree, selecting for excellence often means only the top remain &#x2014; in this case the top ten. Ninety people would be excluded, the work that they could produce is removed from the equation, and the value of the remaining ten is higher because of lower supply.</p>\n<p>By selecting for excellence, we create a form of professional Darwinism. This is self-perpetuating, because the absolute performance does not matter. Even if you would be considered one of the top ten performers five years ago, maybe you do not make the cut today. No matter how good your absolute performance is, you need to prove your relative worth. This means that not only does selecting for excellence bake in exclusivity, scarcity, and inflated value; it also creates the ambiguous condition where your previous &#x201C;excellence&#x201D; is no guarantee in the future, in essence gaslighting yourself about how good you actually are. This strongly goes against the mental health advise to not compare your performance with other&#x2019;s, as it can be (severely) detrimental.<sup class=\"footnote-ref\"><a href=\"#fn2\" id=\"fnref2\">[2]</a></sup></p>\n<h2 id=\"naive-realism\">Naive realism</h2>\n<p>At the bottom of the line, selecting for excellence adheres to a naive realist philosophy: The results you get are 100% accurate. There are no false positives, there are no false negatives. Because somebody gets selected as excellent, they become, by definition, excellent. In this world, what we observe becomes real instead of our observations trying to reflect the real.</p>\n<p>Fact of the matter is, none of the methods to assess relative excellence are that good. Even if the method with which we could unambiguously rank order people for the skill in question, we would have the problem that we do not know the distribution of what we are selecting upon. If there is a large gap between the so-called &#x201C;excellent&#x201D; and the &#x201C;non-excellent,&#x201D; then it <em>might</em> work. If there is a continuous increase of skill as we go up &#x201C;the excellence hierarchy,&#x201D; simple error will cause us to make mistakes. A person could be &#x201C;more excellent&#x201D; than someone else, but the measurement error on that occasion could make them &#x201C;less excellent&#x201D;<sup class=\"footnote-ref\"><a href=\"#fn3\" id=\"fnref3\">[3]</a></sup> and potentially miss the cut. Arbitrary cut-offs can result in arbitrary results.</p>\n<h2 id=\"base-rate-fallacy\">Base rate fallacy</h2>\n<p>Which brings us to the fundamental theoretical problem of selecting for excellence. At its core, the problem is the same as the base rate fallacy caused by the low prevalence of excellence. If only the top 10% are considered excellent, it means the prevalence is 10%.</p>\n<p>Let us consider a very optimistic scenario. In our decisions, we only have 1% false positives (&#x237A;; &#x201C;non-excellent&#x201D; designated as &#x201C;excellent&#x201D;) and 90% true positives (1-&#x3B2;; &#x201C;excellent&#x201D; as &#x201C;excellent&#x201D;). That would result in a positive predictive value (PPV), the chances of &#x201C;excellent&#x201D; being &#x201C;correct&#x201D;, of 91%. I calculate below using <em>N=100</em>.</p>\n<p><img src=\"https://ucarecdn.com/25da6149-9b8e-4af0-bf2d-be91390e9d29/\" alt=\"The Excellence Paradox: Selecting for excellence is self-defeating\" loading=\"lazy\"><sup class=\"footnote-ref\"><a href=\"#fn4\" id=\"fnref4\">[4]</a></sup></p>\n<p>In a visual representation, that could look like this:</p>\n<p><img src=\"https://ucarecdn.com/f3aaa63f-a5e4-4143-905e-af096b51b2d4/\" alt=\"The Excellence Paradox: Selecting for excellence is self-defeating\" loading=\"lazy\"></p>\n<p>You could say, not too bad &#x2014; but remember this is the best case scenario! In the best case scenario, just shy of 1 out of 10 people will not get the career opportunities they supposedly deserve under the excellence framework. This can have all kinds of downstream consequences (housing, relationships, mental health). Again: This is the best scenario I will be offering here!</p>\n<p>We can switch out the rates in our scenario quite easily to take less optimistic scenario&#x2019;s. If we take the basic error rate for false positives, often set at 5%, only 2 out of 3 people selected as excellent would be considered correctly selected.</p>\n<p><img src=\"https://ucarecdn.com/14168e63-221e-4110-b0bd-15f654745556/\" alt=\"The Excellence Paradox: Selecting for excellence is self-defeating\" loading=\"lazy\"></p>\n<p>Which in visual terms could look like this:</p>\n<p><img src=\"https://ucarecdn.com/091c8578-eb5e-4e0c-a35b-ef20887abda4/\" alt=\"The Excellence Paradox: Selecting for excellence is self-defeating\" loading=\"lazy\"></p>\n<p>Again, this means that people&#x2019;s livelihoods depend on a measure that fails 1 out of 3 times. This is still a rather optimistic scenario --- we can also get more pessimistic, in terms of selection pressures.</p>\n<p>Imagine a world ten years down the line. Researchers still want to get tenure. The government has kept funds for researchers at parity levels and did not substantively increase them to increase capacity. However, the amount of researchers seeking tenure has increased, because of the higher amount of graduate candidates. As a result, competition increased and only the top 1% is considered excellent, instead of top 10%.</p>\n<p><img src=\"https://ucarecdn.com/8785b2ad-7c05-429e-8a80-6d63f837bc03/\" alt=\"The Excellence Paradox: Selecting for excellence is self-defeating\" loading=\"lazy\"></p>\n<p>When looking at the visuals it seems like a fruitless exercise, with more mistakes than anything else.</p>\n<p><img src=\"https://ucarecdn.com/f040507d-4fe4-46e9-870f-857489a1e11a/\" alt=\"The Excellence Paradox: Selecting for excellence is self-defeating\" loading=\"lazy\"></p>\n<p>In this scenario, selecting for excellence fails for 17 out of 20 researchers (85%). Selecting for excellence fails 17 out of 20 people&#x2019;s lives and livelihoods. People who may have moved to another country for this opportunity, who may have all kinds of circumstances that create additional stress on their lives. Would it not be unacceptable to use this as a reliable mechanism to make career and life altering decisions? Unethical?</p>\n<p>Of course, we can never know the reality of this excellence mechanism. I call it naive realism, others may simply say it is realism. All probability theory would tell us is that even in the best case scenarios selecting for excellence fails; in worse cases it fails miserabley &#x2014; especially as excellence becomes an ever more exclusive concept.</p>\n<h2 id=\"what-to-do\">What to do?</h2>\n<p>It could be straightforward: Reduce selection pressures. Of course university budgets matter; of course the number of graduate students matter. So many things matter, but at the end of the day all of these play into what the selection pressures are, and we must reduce them.</p>\n<p>Even if we do not reduce the pressures, we must at least <strong>keep the same capacity</strong>. Without available resources growing <em>at least</em> at the same rate as the pool of candidates (whether that is funding, journal space, or otherwise), we will get even higher selection pressures. If capacity is not kept at parity, selection pressures will grow.</p>\n<p>Better than keeping things at parity is to widen the pool of people to consider excellent. We would be way better off to select for what is good enough, rather than for what is excellent. What if good enough is the top 30%, instead of the excellent top 10%? We would approach the best case scenario very quickly with a positive predictive value of 89%.</p>\n<p>A practice like selecting for excellence, but outside of academia, is called <a href=\"https://en.wikipedia.org/wiki/Vitality_curve?ref=chjh.nl\">\"rank and yank.\"</a> It caused much trouble for companies like Microsoft over th years until they discontinued it in 2013. Yet, in academia ranking and yanking thrives on all levels to everybody's discontent and the failure of its purpose.</p>\n<p>In a future blog post I will evaluate journal rejection rates in light of the excellence paradox. Stay tuned!</p>\n<hr class=\"footnotes-sep\">\n<section class=\"footnotes\">\n<ol class=\"footnotes-list\">\n<li id=\"fn1\" class=\"footnote-item\"><p>Absolute excellence can exist too, if the rule to define excellence is strictly defined. Because in most research situations excellence is highly ambiguous, I consider relative excellence as the primary form of excellence that is of interest. <a href=\"#fnref1\" class=\"footnote-backref\">&#x21A9;&#xFE0E;</a></p>\n</li>\n<li id=\"fn2\" class=\"footnote-item\"><p>Someone is always going to be better than you in one specific thing, even if they are not performing as well as you on all the things you do! <a href=\"#fnref2\" class=\"footnote-backref\">&#x21A9;&#xFE0E;</a></p>\n</li>\n<li id=\"fn3\" class=\"footnote-item\"><p>Talking about excellence makes very little sense to me, as I notice in writing this. <a href=\"#fnref3\" class=\"footnote-backref\">&#x21A9;&#xFE0E;</a></p>\n</li>\n<li id=\"fn4\" class=\"footnote-item\"><p>Sorry for the screenshots. I tried embedding the formulae directly and it got real messy &#x1F614; If anybody knows how to properly embed LaTeX in Ghost CMS, I'd love to hear! <a href=\"#fnref4\" class=\"footnote-backref\">&#x21A9;&#xFE0E;</a></p>\n</li>\n</ol>\n</section>\n<!--kg-card-end: markdown-->"},{"id":"63ca52c6e7798f003d5f4d3c","title":"The joy of compounding skillsets","link":"https://www.chjh.nl/the-joy-of-compounding-skillsets/","published":"Mon, 30 Jan 2023 14:20:44 GMT","description":"Being a generalist makes you more unique then you think!","isPermalink":false,"tags":["Startup Therapy"],"authors":[{"name":"Chris Hartgerink","url":null}],"image":"https://images.unsplash.com/photo-1666786881194-7ecf6f620375?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=MnwxMTc3M3wwfDF8c2VhcmNofDI4fHxDb21wb3VuZHxlbnwwfHx8fDE2NzQyMDM4MDg&ixlib=rb-4.0.3&q=80&w=2000","modified":null,"contentHtml":"<img src=\"https://images.unsplash.com/photo-1666786881194-7ecf6f620375?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=MnwxMTc3M3wwfDF8c2VhcmNofDI4fHxDb21wb3VuZHxlbnwwfHx8fDE2NzQyMDM4MDg&ixlib=rb-4.0.3&q=80&w=2000\" alt=\"The joy of compounding skillsets\"><p>Starting a small company means the buck stops with me on everything, every time. Since founding Liberate Science three years ago, that means I&#x2019;ve had to pick up a lot of skills. Where there is a gap, I either need to fill it myself or find someone to fill it.</p><p>Trained as a social psychologist turned applied statistician and meta-researcher, I now also know things about software engineering, design, community management, social media management, bookkeeping, business development, and much more. I love learning - so my curiosity is very content!</p><p>This generalist approach means I am also in no way an expert in many of these topics, which I am okay with. The idea of experts is overrated anyway, as deferring to someone because of their expertise status is an ad hominem &#x2014; it elevates the person above the content. </p><p>In the past, I struggled with my self confidence as a generalist, in a world that encourages specialists. The whole idea that you need to be a specialist in your field, aim to be the best, made me put a lot of pressure on myself. &#x201C;Jack of all trades, master of none&#x201D; as the saying goes diminished my feelings of self-worth.</p><p>After reading books like <a href=\"https://en.wikipedia.org/wiki/Range:_Why_Generalists_Triumph_in_a_Specialized_World?ref=chjh.nl\">Range</a>, I have come to think about my skillset as compounding.</p><p>If you are a a specialist, you may be the one person out of a million people with that level of skill mastery. This is fantastic of course! It takes a lot of effort to get there, as over time marginal increases in your skill require ever more time (also known as <a href=\"https://en.wikipedia.org/wiki/Diminishing_returns?ref=chjh.nl\">law of diminishing returns</a>). Examples can be piano players, professional athletes, or other domains that require specialization by definition.</p><p>If you are a generalist, you may have multiple skills that are used together to compound into your unique perspective. Like me: I may be one out of 10,000 people in my skill of applied statistics and one out of 10,000 in software engineering. Combined, those two skillsets provide me with a perspective that only one out of 10,000,000 people have! Add more skillsets, and the compounding effect grows even more.</p><p>The only downside is that this only applies when the skills can actually be compounded. My knowledge about drilling holes in the wall does not help with publishing (I think). This means that you have to let yourself be surprised by the combinations and be okay with having skillsets that are potentially irrelevant to your work. Let yourself be surprised &#x2014; maybe it was about drilling holes in paywalls all along.</p><p>I do not pressure myself to be a specialist anymore &#x2014; being a generalist keeps me both humble about my reasoning, and also gives me the confidence that I have a unique perspective to provide and contribute. </p><p>What are some of your compounding skills? I would love to know in the comments below.</p>"},{"id":"63c13ee7e7d303003d297a0a","title":"\"Stories from my PhD\" series","link":"https://www.chjh.nl/revisiting-my-phd/","published":"Mon, 23 Jan 2023 15:00:40 GMT","description":"As a recovered academic, I feel comfortable writing some stories I have not shared before.","isPermalink":false,"tags":["Stories from my PhD"],"authors":[{"name":"Chris Hartgerink","url":null}],"image":"https://images.unsplash.com/photo-1583339522870-0d9f28cef33f?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=MnwxMTc3M3wwfDF8c2VhcmNofDR8fHB1cnBsZXxlbnwwfHx8fDE2NzM2MTA0MDA&ixlib=rb-4.0.3&q=80&w=2000","modified":null,"contentHtml":"<img src=\"https://images.unsplash.com/photo-1583339522870-0d9f28cef33f?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=MnwxMTc3M3wwfDF8c2VhcmNofDR8fHB1cnBsZXxlbnwwfHx8fDE2NzM2MTA0MDA&ixlib=rb-4.0.3&q=80&w=2000\" alt=\"\"Stories from my PhD\" series\"><p>I used to introduce myself as a recovering academic in the years 2018-2022. Only now in 2023, am I comfortable saying I am a recovered academic. Having recovered, I am in a comfortable place to start sharing some personal stories that have not seen the light of day before in written form. </p><p>Writing stories is a way for me to remember and to reflect on some of the events that shaped me. It will become my external memory archive as I wade through my personal archives of recordings, emails, and internal memories. I do not yet know the lineup of these posts.</p><p>It will not be hard to figure out who is who in these stories, especially if you are familiar with the actors despite my pseudonymization. But that is not the point &#x2014; in addition to my external memory I hope these stories may help others who are living similar stories feel seen. I love the idea of <a href=\"https://digitalfutures.space/deepdive/trauma-informed-design/?ref=chjh.nl\">trauma-informed design</a>, where we use our trauma to inform how we imagine better futures. Maybe revisiting some of the things I needed to recover from so intensely proves informative to myself.</p><p>I recognize I am a male presenting white person, first-generation student. I pass as the default even when I may not be at times in minimal ways. In no way do I write these stories to elevate them as the worst things in the world. If anything, I hope they may inspire others to feel the courage to share their stories, no matter how old they are.</p><p>Symbolically, I will open this series of posts with my dissertation's prologue (minus the chapter summary), to set the stage once more.</p><hr><!--kg-card-begin: markdown--><p>The history and practice of science is convoluted<sup class=\"footnote-ref\"><a href=\"#fn1\" id=\"fnref1\">[1]</a></sup>, but when I was a student it was taught to me in a relatively uncomplicated manner. Among the things I remember from my high school science classes are how to convert a metric distance into Astronomical Units (AUs) and that there was something called the research cycle. Those classes presented things such as the AU and the empirical cycle as unambiguous truths. In hindsight, it is difficult to imagine these constructed ideas as historically unambiguous. For example, I was taught the AU as simple arithmetic while that calculation implies accepting a historically complex process full of debate on how an AU should be defined<sup class=\"footnote-ref\"><a href=\"#fn2\" id=\"fnref2\">[2]</a></sup>. As such, that calculation was path-dependent, similar to how the history and practice of science in general is also path-dependent <sup class=\"footnote-ref\"><a href=\"#fn3\" id=\"fnref3\">[3]</a></sup><sup class=\"footnote-ref\"><a href=\"#fn4\" id=\"fnref4\">[4]</a></sup>.</p>\n<p>Scientific textbooks understandably present a distillation of the scientific process. Not everyone needs the (full) history of discussions after broad consensus has already been reached. This is a useful heuristic for progress but also minimizes (maybe even belittles) the importance of the process<sup class=\"footnote-ref\"><a href=\"#fn3\" id=\"fnref3:1\">[3:1]</a></sup>. As such, textbook science (vademecum science)<sup class=\"footnote-ref\"><a href=\"#fn5\" id=\"fnref5\">[5]</a></sup>, with which science teaching starts, provides high certainty, little detail, and provides the breeding ground for a view of science as producing certain knowledge. Through this kind of teaching, storybook images of scientists and science might arise, often as the actors and process of discovering absolute truths rather than of uncertain and iterative production of coherent and consistent knowledge. Such storybook images likely result in the impression that scientists versus non-scientists are more objective, rational, skeptical, rigorous, and ethical, even after taking into account educational level <sup class=\"footnote-ref\"><a href=\"#fn6\" id=\"fnref6\">[6]</a></sup>.</p>\n<p>Scientific research articles tend to provide more details and less certainty than scientific textbooks, but still present storified findings that simplify a complicated process into a single, linear narrative<sup class=\"footnote-ref\"><a href=\"#fn7\" id=\"fnref7\">[7]</a></sup>. Compared to scientific textbooks, which present a narrative across many studies, scientific articles provide a narrative across relatively few studies. Hence, scientific articles should be relatively better than scientific textbooks for understanding the validity of findings because they get more space to nuance, provide more details, and contextualize research findings. Nonetheless, the linear narrative of the scientific article distills and distorts a complicated non-linear research process and thereby provides little space to encapsulate the full nuance, detail, and context of findings. Moreover, storification of research results requires flexibility, where its manifestation in the flexibility of analyses may be one of the main culprits of false positive findings (i.e., incorrectly claiming an effect)<sup class=\"footnote-ref\"><a href=\"#fn8\" id=\"fnref8\">[8]</a></sup> and detracts from accurate reporting. The lack of detail and (excessive) storification go hand in hand with the misrepresentation of event chronology to present a more comprehensible narrative to the reader and researcher. For example, breaks from a main narrative (i.e., nonconfirming results) may be excluded from the reporting. Such misrepresentation becomes particularly problematic if the validity of the presented findings rests on the actual and complete order of events --- as it does in the prevalent epistemological model based on the empirical research cycle <sup class=\"footnote-ref\"><a href=\"#fn9\" id=\"fnref9\">[9]</a></sup>. Moreover, the storification within scholarly articles can create highly discordant stories across scholarly articles, leading to conflicting narratives and confusion in research fields or news reports and, ultimately, less coherent understanding of science by both general- and specialized audiences.</p>\n<p>When I started as a psychology student in 2009, I implicitly perceived science and scientists in the storybook way. I was the first in my immediate family to go to university, so I had no previous informal education about what 'true' scientists or 'true' science looked like --- I was only influenced by the depictions in the media and popular culture. In other words, I thought scientists were objective, disinterested, skeptical, rigorous, ethical (and predominantly men). The textbook- and article based education I received at the university did not disconfirm or recalibrate this storybook image and, in hindsight, might have served to reinforce it. For example, textbooks provided a decontextualized history that presented the path of discovery as linear, 'the truth' as unequivocal, multiple choice exams which could only receive correct or wrong answers, and certified stories in the form of peer reviewed publications. Granted, the empirical scientist was warranted the storybook qualities exactly <em>because</em> the empirical research cycle provided a way to overcome human biases and provided grounds for the widespread belief that search for 'the truth' was more important than individual gain.</p>\n<p>As I progressed throughout my science education, it became clear to me  how naive the storybook image of science and the scientist was through a series of events that undercut the very epistemological model that granted these qualities. As a result of these events, I had what I somewhat dramatically called two 'personal crises of epistemological faith in science' (or put plainly: wake up calls). These crises strongly correlated with several major events within the psychology research community and raised doubts about the value of the research I was studying and conducting. Both these crises made me consider leaving scientific research and I am sure I was not alone in experiencing this sentiment.</p>\n<p>My first, local crisis of epistemological faith was when the psychology professor who got me interested in research publicly confessed to having fabricated data throughout his academic career <sup class=\"footnote-ref\"><a href=\"#fn10\" id=\"fnref10\">[10]</a></sup>. Having been inspired to go down the path of scholarly research by this very professor and having worked as a research assistant for him, I doubted myself and my abilities. I asked myself whether I was critical enough to conduct and notice valid research. After all, I had not had even an inch of suspicion while working with him. Moreover, I wondered what to make of my interest in research, given that the person who got me inspired appeared to be such a bad example to model myself after. This event also unveiled to me the politics of science and how validity, rigor, and 'truth' finding was not a given <sup class=\"footnote-ref\"><a href=\"#fn11\" id=\"fnref11\">[11]</a></sup>. Regardless, the self-reported prevalence of fraudulent behaviors among scientists (viz. 2%)<sup class=\"footnote-ref\"><a href=\"#fn12\" id=\"fnref12\">[12]</a></sup> was sufficiently low to not undermine the epistemological effort of the scientific collective (although it could still severely distort it). Ultimately, I considered it unlikely that the majority of researchers would be fraudsters like this professor and simply realized that research could fail at various stages (e.g., data sharing, peer review). As a result, I became more skeptical of the certified stories in peer reviewed journals and in my own and other's research. I ultimately shifted my focus towards studying statistics to improve research.</p>\n<p>A second, more encompassing epistemological crisis arose when I took a class that indicated that scientists undermine the empirical research cycle at a large scale. These behaviors were sometimes intentional, sometimes unintentional, but often the result of misconceptions and ill procedures in order to play the game of getting published<sup class=\"footnote-ref\"><a href=\"#fn13\" id=\"fnref13\">[13]</a></sup>. More specifically, this epistemological crisis originated from learning about how loose application of statistical procedures could produce statistically significant results from pretty much anything<sup class=\"footnote-ref\"><a href=\"#fn14\" id=\"fnref14\">[14]</a></sup>. Additionally, these behaviors result in biased publication of results<sup class=\"footnote-ref\"><a href=\"#fn15\" id=\"fnref15\">[15]</a></sup> through the invisible (and often unaccountable) hand of peer review<sup class=\"footnote-ref\"><a href=\"#fn16\" id=\"fnref16\">[16]</a></sup> that in itself suffers from various misconceptions. This combination potentially leads to a vicious cycle of overestimated (and sometimes false positive) effects, leading to underpowered research that is selectively published, leading to overestimated effects and underpowered research, and so on until that cycle gets disrupted. These issues are not necessarily new and have been discussed for over 40 years in some way or form<sup class=\"footnote-ref\"><a href=\"#fn17\" id=\"fnref17\">[17]</a></sup>. Given this longstanding vicious cycle, it seemed unlikely the issues in empirical research would resolve themselves --- they seemed more likely to be further exacerbated if left unattended. Progress on these issues would not be trivial or self-evident, given that previous awareness subsided and attempts to improve the situation did not stick in the long run. It also indicated to me that the reforms needed had to be substantial, because the improvements made over the last decades remained insufficient (although the historical context is highly relevant)<sup class=\"footnote-ref\"><a href=\"#fn18\" id=\"fnref18\">[18]</a></sup>. Because of the failed attempts in the past and the awareness of these issues throughout the last six years or so, my epistemological worries are ongoing and oscillate between pessimism and optimism for improvement.</p>\n<p>Nonetheless, these two epistemological crises caused me to become increasingly engaged with various initiatives and research domains to actively contribute towards improving science. This was not only my personal way of coping with these crises and more specific incidents, it also felt like an exciting space to contribute to. In late 2012, I was introduced to the concept of Open Science for my first big research project. It seemed evident to me that Open Science was a great way to improve the verifiability of research<sup class=\"footnote-ref\"><a href=\"#fn19\" id=\"fnref19\">[19]</a></sup>. The Open Science Framework had launched only recently <sup class=\"footnote-ref\"><a href=\"#fn20\" id=\"fnref20\">[20]</a></sup>, which is where I started to document my work openly. I found it scary, difficult, and did not know where to start simply because I had never been taught to do science this way nor did anyone really know how. It led me to experiment with these new tools and processes to find out the practicalities of actually making my own work open, and I have continued to do so ever since. It made me work in a more reproducible, open manner, and also led me to become engaged in what are often called the Open Access and Open Science movements. Both these movements aim to make knowledge available to all in various ways, going beyond dumping excessive amounts of information but also making it comprehensible by providing clear documentation to for example data. Not only are the communities behind these movements supportive in educating each other in open practices, they also activated me to help others see the value of Open Science and how to implement it <sup class=\"footnote-ref\"><a href=\"#fn21\" id=\"fnref21\">[21]</a></sup>. Through this, activism within the realm of science became part of my daily scientific practice.</p>\n<p>Actively improving science through doing research became the main motivation for me to pursue a PhD project. Initially, we set out to focus purely on statistical detection of data fabrication (linking back to my first epistemological crisis). The proposed methods to detect data fabrication had not been tested widely nor validated and there was a clear opportunity for a valuable contribution. Rather quickly, our attention widened towards a broader set of issues, resulting in a broad perspective on issues in science by looking at not only data fabrication, but also at questionable research practices, statistical results and the reporting thereof, complemented by thinking about incentivizing rigorous practices.</p>\n<hr class=\"footnotes-sep\">\n<section class=\"footnotes\">\n<ol class=\"footnotes-list\">\n<li id=\"fn1\" class=\"footnote-item\"><p>Wootton, David. 2015. The Invention of Science: A New History of the Scientific Revolution. Toronto, Canada: Allen Lane. ISBN:9781846142109. <a href=\"#fnref1\" class=\"footnote-backref\">&#x21A9;&#xFE0E;</a></p>\n</li>\n<li id=\"fn2\" class=\"footnote-item\"><p><a href=\"https://doi.org/10.1017/s1743921305001365?ref=chjh.nl\">doi:10.1017/s1743921305001365</a> <a href=\"#fnref2\" class=\"footnote-backref\">&#x21A9;&#xFE0E;</a></p>\n</li>\n<li id=\"fn3\" class=\"footnote-item\"><p>Latour, Bruno, and Steve Woolgard. 1986. Laboratory Life: The Construction of Scientific Facts. Princeton, NJ: Princeton University Press. ISBN:0692094187. <a href=\"#fnref3\" class=\"footnote-backref\">&#x21A9;&#xFE0E;</a> <a href=\"#fnref3:1\" class=\"footnote-backref\">&#x21A9;&#xFE0E;</a></p>\n</li>\n<li id=\"fn4\" class=\"footnote-item\"><p>Gelman, Andrew, and Eric Loken. 2013. &#x201C;The Garden of Forking Paths: Why Multiple Comparisons Can Be a Problem, Even When There Is No &#x2018;Fishing Expedition&#x2019; or &#x2018;P-Hacking&#x2019; and the Research Hypothesis Was Posited Ahead of Time.&#x201D; <a href=\"https://wayback.archive.org/web/20180712075516/http://www.stat.columbia.edu/~gelman/research/unpublished/p_hacking.pdf?ref=chjh.nl\">https://wayback.archive.org/web/20180712075516/http://www.stat.columbia.edu/~gelman/research/unpublished/p_hacking.pdf</a>. <a href=\"#fnref4\" class=\"footnote-backref\">&#x21A9;&#xFE0E;</a></p>\n</li>\n<li id=\"fn5\" class=\"footnote-item\"><p>Fleck, Ludwig. 1984. Genesis and Development of a Scientific Fact. Chicago, IL: University of Chicago Press. ISBN:9780226253251. <a href=\"#fnref5\" class=\"footnote-backref\">&#x21A9;&#xFE0E;</a></p>\n</li>\n<li id=\"fn6\" class=\"footnote-item\"><p><a href=\"https://doi.org/10.1080/08989621.2016.1268922?ref=chjh.nl\">doi:10.1080/08989621.2016.1268922</a> <a href=\"#fnref6\" class=\"footnote-backref\">&#x21A9;&#xFE0E;</a></p>\n</li>\n<li id=\"fn7\" class=\"footnote-item\"><p><a href=\"https://doi.org/10.1017/cbo9780511807862.002?ref=chjh.nl\">doi:10.1017/cbo9780511807862.002</a> <a href=\"#fnref7\" class=\"footnote-backref\">&#x21A9;&#xFE0E;</a></p>\n</li>\n<li id=\"fn8\" class=\"footnote-item\"><p><a href=\"https://doi.org/10.1371/journal.pmed.0020124?ref=chjh.nl\">doi:10.1371/journal.pmed.0020124</a> <a href=\"#fnref8\" class=\"footnote-backref\">&#x21A9;&#xFE0E;</a></p>\n</li>\n<li id=\"fn9\" class=\"footnote-item\"><p>De Groot, A.D. 1994. Methodologie: Grondslagen van Onderzoek En Denken in de Gedragswetenschappen [Methodology: Foundations of Research and Thinking in the Behavioral Sciences]. Assen, the Netherlands: Van Gorcum. ISBN:9789023228912. <a href=\"#fnref9\" class=\"footnote-backref\">&#x21A9;&#xFE0E;</a></p>\n</li>\n<li id=\"fn10\" class=\"footnote-item\"><p>Stapel, Diederik A. 2012. Ontsporing. Amsterdam, the Netherlands: Prometheus. ISBN:9789044623123. <a href=\"#fnref10\" class=\"footnote-backref\">&#x21A9;&#xFE0E;</a></p>\n</li>\n<li id=\"fn11\" class=\"footnote-item\"><p>See for example Broad, William, and Nicholas Wade. 1983. Betrayers of the Truth. New York, NY: Simon; Schuster. ISBN:9780671447694. <a href=\"#fnref11\" class=\"footnote-backref\">&#x21A9;&#xFE0E;</a></p>\n</li>\n<li id=\"fn12\" class=\"footnote-item\"><p><a href=\"https://doi.org/10.1371/journal.pone.0005738?ref=chjh.nl\">doi:10.1371/journal.pone.0005738</a> <a href=\"#fnref12\" class=\"footnote-backref\">&#x21A9;&#xFE0E;</a></p>\n</li>\n<li id=\"fn13\" class=\"footnote-item\"><p><a href=\"https://doi.org/10.1177/1745691612459060?ref=chjh.nl\">doi:10.1177/1745691612459060</a> <a href=\"#fnref13\" class=\"footnote-backref\">&#x21A9;&#xFE0E;</a></p>\n</li>\n<li id=\"fn14\" class=\"footnote-item\"><p>E.g., <a href=\"https://doi.org/10.1177/0956797611417632?ref=chjh.nl\">doi:10.1177/0956797611417632</a> <a href=\"#fnref14\" class=\"footnote-backref\">&#x21A9;&#xFE0E;</a></p>\n</li>\n<li id=\"fn15\" class=\"footnote-item\"><p><a href=\"https://doi.org/10.1007/bf01173636?ref=chjh.nl\">doi:10.1007/bf01173636</a> <a href=\"#fnref15\" class=\"footnote-backref\">&#x21A9;&#xFE0E;</a></p>\n</li>\n<li id=\"fn16\" class=\"footnote-item\"><p>Harnad, Stevan. 2000. \"The Invisible Hand of Peer Review.\" Exploit Interactive. <a href=\"http://cogprints.org/1646/?ref=chjh.nl\">http://cogprints.org/1646/</a>. <a href=\"#fnref16\" class=\"footnote-backref\">&#x21A9;&#xFE0E;</a></p>\n</li>\n<li id=\"fn17\" class=\"footnote-item\"><p><a href=\"https://doi.org/10.1037/0033-2909.105.2.309?ref=chjh.nl\">doi:10.1037/0033-2909.105.2.309</a>;<a href=\"https://doi.org/10.1037/h0045186?ref=chjh.nl\">doi:10.1037/h0045186</a>;<a href=\"https://doi.org/10.1037/0033-2909.86.3.638?ref=chjh.nl\">doi:10.1037/0033-2909.86.3.638</a>;<a href=\"https://doi.org/10.2466/03.11.pms.112.2.331-348?ref=chjh.nl\">doi:10.2466/03.11.pms.112.2.331-348</a>;<a href=\"https://doi.org/10.1207/s15327957pspr0203_4?ref=chjh.nl\">doi:10.1207/s15327957pspr0203_4</a>;<a href=\"https://doi.org/10.1056/nejm199310143291613?ref=chjh.nl\">doi:10.1056/nejm199310143291613</a> <a href=\"#fnref17\" class=\"footnote-backref\">&#x21A9;&#xFE0E;</a></p>\n</li>\n<li id=\"fn18\" class=\"footnote-item\"><p>See <a href=\"https://doi.org/10.1177/1745691615609918?ref=chjh.nl\">doi:10.1177/1745691615609918</a> <a href=\"#fnref18\" class=\"footnote-backref\">&#x21A9;&#xFE0E;</a></p>\n</li>\n<li id=\"fn19\" class=\"footnote-item\"><p>See also <a href=\"https://doi.org/10.15200/winn.144232.26366?ref=chjh.nl\">doi:10.15200/winn.144232.26366</a> <a href=\"#fnref19\" class=\"footnote-backref\">&#x21A9;&#xFE0E;</a></p>\n</li>\n<li id=\"fn20\" class=\"footnote-item\"><p><a href=\"https://doi.org/10.31237/osf.io/t23za?ref=chjh.nl\">doi:10.31237/osf.io/t23za</a> <a href=\"#fnref20\" class=\"footnote-backref\">&#x21A9;&#xFE0E;</a></p>\n</li>\n<li id=\"fn21\" class=\"footnote-item\"><p>My first steps taken in <a href=\"https://doi.org/10.6084/m9.figshare.928315.v2?ref=chjh.nl\">doi:10.6084/m9.figshare.928315.v2</a> <a href=\"#fnref21\" class=\"footnote-backref\">&#x21A9;&#xFE0E;</a></p>\n</li>\n</ol>\n</section>\n<!--kg-card-end: markdown-->"},{"id":"63bee2c7e3890c004de49fcc","title":"Remarks for the Berlin Publishing Conference 2023","link":"https://www.chjh.nl/remarks-for-the-berlin-publishing-conference-2023/","published":"Thu, 12 Jan 2023 08:31:37 GMT","description":"My remarks for the junior researcher panel at the APE2023 conference.","isPermalink":false,"tags":["Speech"],"authors":[{"name":"Chris Hartgerink","url":null}],"image":"https://www.chjh.nl/content/images/2023/01/Academic-Publishing-Europe_logo_Tekengebied-1-768x452.jpg","modified":null,"contentHtml":"<div class=\"kg-card kg-callout-card kg-callout-card-yellow\"><div class=\"kg-callout-emoji\">&#x1F4A1;</div><div class=\"kg-callout-text\">These are my remarks for the junior researcher panel at the <a href=\"https://berlinstitute.org/ape2023/?ref=chjh.nl\">APE2023 conference</a>. This blog is slightly edited for clarity and expands the quote selection from Aaron Swartz.</div></div><img src=\"https://www.chjh.nl/content/images/2023/01/Academic-Publishing-Europe_logo_Tekengebied-1-768x452.jpg\" alt=\"Remarks for the Berlin Publishing Conference 2023\"><p>Aaron Swartz died a decade ago today - to commemorate him I&#x2019;ll start by reading selected quotes from <a href=\"https://archive.org/details/GuerillaOpenAccessManifesto\">the Guerilla Open Access Manifesto</a> here today.</p><blockquote>Information is power. But like all power, there are those who want to keep it for themselves. [&#x2026;] Sharing isn't immoral &#x2014; it's a moral imperative. Only those blinded by greed would refuse to let a friend make a copy. [&#x2026;] corporations, of course, are blinded by greed. The laws under which they operate require it &#x2014; their shareholders would revolt at anything less. [&#x2026;] We need to take information, wherever it is stored, make our copies and share them with the world. [&#x2026;] With enough of us, around the world, we'll not just send a strong message opposing the privatization of knowledge &#x2014; we'll make it a thing of the past. Will you join us?</blockquote><p>I would argue to reframe publishing as a question of power &#x2014; as Aaron talked about it: Information is power.</p><p>We talked about business models, the value in data, and other opportunities at this conference. But without also talking about the power dimension I would argue we miss the why. We will miss the framework with which to understand the problems we are trying to solve.</p><p>When publishers negotiate contracts, non-disclosures are about negotiation power.</p><p>&#x201C;Publishers are sitting on a goldmine of data&#x201D; someone said this morning. The power of tracking.</p><p><a href=\"https://akademienl.social/@chartgerink/109670707031255522?ref=chjh.nl\">We just heard</a> about how privacy improvements are bad for publisher&#x2019;s access management.</p><p>Yesterday, I heard jokingly say &#x201C;Elsevier tracks everything&#x201D;, which reminds me of the power created by data brokering, which some of the parent companies of publishers do.</p><p>For researchers, your &#xA0;publishing business is not relevant. The power dynamics are.</p><p>It is why I am a reluctant publisher myself - as a researcher I wanted do something about those power dynamics in publishing, no matter how small.</p><p>In 1989, 20% of people thought the wall would fall in the next five years. Six months later it fell. When I heard this story yesterday from J&#xF6;rg Rocholl, all I heard was that you may think people will tolerate power imbalance indefinitely, but your wall may fall if you push it too far. </p><p>Researchers may take down your paywalls and much more in a similar way if you keep pushing the power imbalances.</p>"},{"id":"63aea6623a6782003dcb8459","title":"Open Inaccessibility","link":"https://www.chjh.nl/open-inaccessibility/","published":"Fri, 30 Dec 2022 13:24:03 GMT","description":"In my decade working on the openness of research I touched upon content accessibility only a few times, in part because it was and is a less discussed topic in my circles. But that does not make it less...","isPermalink":false,"tags":["Research Commons"],"authors":[{"name":"Chris Hartgerink","url":null}],"image":"https://images.unsplash.com/photo-1584697964358-3e14ca57658b?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=MnwxMTc3M3wwfDF8c2VhcmNofDUwfHxkaXNhYmlsaXR5fGVufDB8fHx8MTY3MjM5NjE1Mw&ixlib=rb-4.0.3&q=80&w=2000","modified":null,"contentHtml":"<img src=\"https://images.unsplash.com/photo-1584697964358-3e14ca57658b?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=MnwxMTc3M3wwfDF8c2VhcmNofDUwfHxkaXNhYmlsaXR5fGVufDB8fHx8MTY3MjM5NjE1Mw&ixlib=rb-4.0.3&q=80&w=2000\" alt=\"Open Inaccessibility\"><p>In my decade working on the openness of research I touched upon content accessibility only a few times, in part because it was and is a less discussed topic in my circles. But that does not make it less important. </p><p>After all: When a PDF is downloaded, who can read it?</p><p><a href=\"https://www.youtube.com/watch?v=2fiQry9AmfY&ref=chjh.nl\">At the start of the year I discussed</a> the social model of disability and inaccessibility in relation to open scholarship, but since then I have not done much more in a practical sense. Here's the best explanation of the social model of disability I have seen:</p><figure class=\"kg-card kg-embed-card kg-card-hascaption\"><iframe width=\"200\" height=\"113\" src=\"https://www.youtube.com/embed/0e24rfTZ2CQ?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen title=\"What is the social model of disability? - Scope video\"></iframe><figcaption>An explainer video of the social model of disability. Source: <a href=\"https://youtu.be/0e24rfTZ2CQ?ref=chjh.nl\">https://youtu.be/0e24rfTZ2CQ</a></figcaption></figure><p>Content inaccessibility came back on my radar again when I read <a href=\"https://doi.org/10.48550/arXiv.2212.07286?ref=chjh.nl\">a recent study about content accessibility improvements for arXiv</a>. This paper calls content accessibility \"the next frontier of open science.\" As we see a simultaneous increase in user-generated content platforms for publishing, where there is less control over what and how things get published, I would agree and argue that accessibility will become a bigger topic quickly. </p><p>Some of my main takeaways and juxtapositions from this paper include:</p><ul><li>There is clear content inaccessibility: only 30% of people using assistive technologies rate all research as accessible (vs. 59% of people not using assistive technologies).</li><li>HTML is preferred for accessibility, but non-disabled people prefer PDFs.</li><li>Biggest improvement areas for accessibility are (1) PDF formatting, (2) images (alt texts), (3) math accessibility (e.g., MathML for screenreaders), (4) making data in figures parseable by screen readers.</li><li>People who don't use assistive technologies don't know what is required of them to make accessible documents</li><li>PDF is often preferred because it is easy/easier to save to reference managers.</li></ul><p>Moreover, this study evaluated the experiences of researchers in each step of the article process. A lot of negative experiences happen at each step, indicating there is ample room for improvement. Accessibility is helpful for everyone in the end.</p><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img src=\"https://www.chjh.nl/content/images/2022/12/Screenshot-2022-12-30-at-11.33.25.png\" class=\"kg-image\" alt=\"Open Inaccessibility\" loading=\"lazy\" width=\"2000\" height=\"773\" srcset=\"https://www.chjh.nl/content/images/size/w600/2022/12/Screenshot-2022-12-30-at-11.33.25.png 600w, https://www.chjh.nl/content/images/size/w1000/2022/12/Screenshot-2022-12-30-at-11.33.25.png 1000w, https://www.chjh.nl/content/images/size/w1600/2022/12/Screenshot-2022-12-30-at-11.33.25.png 1600w, https://www.chjh.nl/content/images/size/w2400/2022/12/Screenshot-2022-12-30-at-11.33.25.png 2400w\" sizes=\"(min-width: 720px) 720px\"><figcaption><em><a href=\"https://doi.org/10.48550/arXiv.2212.07286?ref=chjh.nl\">Original Figure 1.</a></em> The stacked bar chart shows the percent of positive vs. negative experiences at each step in the user journey.</figcaption></figure><p>I wonder though, how HTML pairs up with other technologies like XML, which this study did not dive into.</p><h2 id=\"next-steps\">Next steps</h2><p>This study on content accessibility on arXiv is a great example of how to engage and with mindful intent start moving the needle forward. It inspires me to take some next steps as well. I am a non-disabled person, so my forgetfulness about this topic is a reminder of my privilege to not have these issues on a day-to-day basis. It also highlights the importance of actively doing something about it, as not doing anything is bad enough to promote the status quo. </p><p>Practically and specifically, I will implement <a href=\"https://www.crossref.org/blog/accessibility-for-crossref-doi-links-call-for-comments-on-proposed-new-guidelines/?ref=chjh.nl\">accessible DOIs</a> into ResearchEquals upon my return next week. I also recognize I am fairly ignorant on disability studies and activism, so I am starting that journey by making these the first books I read in 2023:</p><ol><li>Disability Visibility: First-Person Stories from the Twenty-First Century (by Alice Wong)</li><li>Year of the Tiger: An Activist's Life (by Alice Wong)</li><li>I'll figure it out: How ableism impacts disabled people's lives (by Marina Carlos)</li></ol><p>If this topic of inaccessibility and ableism was new to you, what are your thoughts? I would love for people to explore this area more in 2023 and share in each other's journeys! Book recommendations welcome too &#x1F60A;</p>"},{"id":"63a460993a6782003dcb83c7","title":"Dipping my toes into 3D","link":"https://www.chjh.nl/dipping-my-toes-into-3d/","published":"Thu, 22 Dec 2022 14:02:50 GMT","description":"This week I am a bit at a loss what to write about - I had drafts on the weaponization of meta-research, how to write an R package in 2022 (but the year's almost out), the consequences of owning your digital...","isPermalink":false,"tags":[],"authors":[{"name":"Chris Hartgerink","url":null}],"image":"https://images.unsplash.com/photo-1655635949348-953b0e3c140a?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=MnwxMTc3M3wwfDF8c2VhcmNofDl8fDNkfGVufDB8fHx8MTY3MTcxNzc1MQ&ixlib=rb-4.0.3&q=80&w=2000","modified":null,"contentHtml":"<img src=\"https://images.unsplash.com/photo-1655635949348-953b0e3c140a?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=MnwxMTc3M3wwfDF8c2VhcmNofDl8fDNkfGVufDB8fHx8MTY3MTcxNzc1MQ&ixlib=rb-4.0.3&q=80&w=2000\" alt=\"Dipping my toes into 3D\"><p>This week I am a bit at a loss what to write about - I had drafts on the weaponization of meta-research, how to write an R package in 2022 (but the year's almost out), the consequences of owning your digital infrastructure.</p><p>But none of it really fell into place enough yet. So I'm happy to chat about how I've been trying out 3D design &#x2013; as an experiment to see what is feasible for an amateur like me.</p><p>Honestly, I have come to realise 3D may actually be easier than I expected nowadays. I thought I would have to learn the infamously difficult to learn Blender software, which always put me off. I ended up trying <a href=\"https://spline.design/?ref=chjh.nl\">Spline</a> instead and it's honestly like MS Paint for 3D.</p><p>After messing around for an hour or so I was able to recreate the Einstein's Foundation award introduction. Here's the original:</p><figure class=\"kg-card kg-embed-card\"><iframe width=\"200\" height=\"113\" src=\"https://www.youtube.com/embed/O1gojOdabCE?start=8&feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen title=\"The Einstein Foundation Award for Promoting Quality in Research &#x2013;&#xA0;Trailer\"></iframe></figure><p>And this is what I recreated without too much effort if I say so myself:</p><!--kg-card-begin: html--><iframe src=\"https://my.spline.design/untitled-7cc53b9a2c74340dc201d989eee1f398/\" frameborder=\"0\" width=\"100%\" height=\"100%\"></iframe><!--kg-card-end: html--><p>Sure, it is not the exact same thing, I would be a bit afraid if it was. For an hour worth of rummaging in the software this is a pretty good result. It takes a bit of getting used to moving things in three dimensional space, and to understand that you can animate by transitioning smoothly between two states. </p><p>So if you have thought about trying out 3D, I encourage you to try it with Spline (I did not get the paid plan for this). Hopefully I will come back next week with a bit more inspired of a post.</p>"},{"id":"63933d90afd2d5004dedb9e1","title":"Private open scholarship","link":"https://www.chjh.nl/private-open-scholarship/","published":"Mon, 12 Dec 2022 14:35:56 GMT","description":"A primary argument around open scholarship (i.e., open science) is that of publicly funded means publicly accessible. I dont like that argument because it reinforces the inverse: Privately funded means...","isPermalink":false,"tags":["Research Commons"],"authors":[{"name":"Chris Hartgerink","url":null}],"image":"https://images.unsplash.com/photo-1459347268516-3ed71100e718?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=MnwxMTc3M3wwfDF8c2VhcmNofDF8fHByaXZhdGV8ZW58MHx8fHwxNjcwNTkzNTkx&ixlib=rb-4.0.3&q=80&w=2000","modified":null,"contentHtml":"<img src=\"https://images.unsplash.com/photo-1459347268516-3ed71100e718?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=MnwxMTc3M3wwfDF8c2VhcmNofDF8fHByaXZhdGV8ZW58MHx8fHwxNjcwNTkzNTkx&ixlib=rb-4.0.3&q=80&w=2000\" alt=\"Private open scholarship\"><p>A primary argument around open scholarship (i.e., open science) is that of &#x201C;publicly funded means publicly accessible.&#x201D; I don&#x2019;t like that argument because it reinforces the inverse: Privately funded means privately accessible.</p><p>\"Privately funded means privately accessible\" is especially prevalent in an Intellectual Property Rights (IPR) era where patenting, copyrighting, and closing information/data down as trade secrets is commonplace. </p><p>By using the \"publicly funded means publicly accessible\" argument we may be &#xA0;implicitly reinforcing the IPR paradigm we are in. The ideas behind open scholarship as I understand them are exactly anti-IPR though &#x2014; one where we try to make knowledge more accessible to everyone, including the power that comes with it. </p><p>Hence, even implicitly promoting IPR for privately funded research as a way to forward publicly funded open scholarship is self-defeating, I would say. It also suggests that we bifurcate the standards by which we evaluate research: One set of standards for public research, one set for private research.</p><p>But are we really applying different standards to publicly and privately funded research? Can we even differentiate between public and private research, really?</p><p>An example where we (supposedly) apply the same standards to private and public research is when it becomes part of the scholarly literature and knowledge base. Take for example <a href=\"https://doi.org/10.1073/pnas.2022819118?ref=chjh.nl\">the experiment Facebook ran in 2012</a> on over half a million people. Facebook experimented with the valence of posts people saw in their feed, to study emotional contagion in people. They did not ask people for their consent, but simply argued the terms people agree to when signing up to Facebook are considered informed consent:</p><!--kg-card-begin: markdown--><blockquote>\n<p>it was consistent with Facebook&#x2019;s Data Use Policy, to which all users agree prior to creating an account on Facebook, constituting informed consent for this research</p>\n</blockquote>\n<!--kg-card-end: markdown--><p>You cannot provide informed consent to something without being informed about the specifics. As a result of this, an <a href=\"https://www.pnas.org/doi/10.1073/pnas.1412469111?ref=chjh.nl\">expression of concern</a> raised a problem of this public-private distinction: Who reviews the ethics of studies done by private entities?</p><p>More broadly than this example, privately funded research struggles to get legitimate ethics reviews done to begin with. For example, I am completely unable right now to get ethics reviews for my studies, because I am a privately funded researcher. There is no standard way to get ethics approval for human participant studies, which journals (technically) require nowadays. </p><p>At the same time, I am still expected to apply the same principles of responsible and ethical research. I am required to do so, as not doing so would mean I am not fulfilling my doctoral duties. Public research standards apply to my privately funded work but do not get supported. See the Catch-22?</p><p>It is also more and more common for those same (public) standards of responsible and ethical research to require transparency of research. It is via that route, the research culture that spans beyond any one institute, we might be able to reinforce open scholarship in privately funded research as well. But that means we must also support it - and the argument of &#x201C;publicly funded means publicly accessible&#x201D; means we forego that support by focusing on publicly funded work. </p><p>If we apply the logic of privately funded research as privately accessible, it presupposes an artificial distinction between public and private research that allows for these discrepancies to take root. Let us stop this divide and do more on how to support open scholarship in both public and private institutions.</p>"},{"id":"638d058be92108003d1cfe4f","title":"Constructive selfishness","link":"https://www.chjh.nl/constructive-selfishness/","published":"Mon, 05 Dec 2022 19:53:03 GMT","description":"In my reflections on the Shuttleworth Fellowship (forthcoming), I realised that I was given the gift of \"constructive selfishness.\" The gist is: If you make things work for you, you can make things work for...","isPermalink":false,"tags":[],"authors":[{"name":"Chris Hartgerink","url":null}],"image":"https://images.unsplash.com/photo-1582577698887-d4d58909e3e3?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=MnwxMTc3M3wwfDF8c2VhcmNofDV8fHZlZ2FuJTIwbnVnZ2V0fGVufDB8fHx8MTY3MDI2OTE3Mw&ixlib=rb-4.0.3&q=80&w=2000","modified":null,"contentHtml":"<img src=\"https://images.unsplash.com/photo-1582577698887-d4d58909e3e3?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=MnwxMTc3M3wwfDF8c2VhcmNofDV8fHZlZ2FuJTIwbnVnZ2V0fGVufDB8fHx8MTY3MDI2OTE3Mw&ixlib=rb-4.0.3&q=80&w=2000\" alt=\"Constructive selfishness\"><p>In my reflections on the Shuttleworth Fellowship (forthcoming), I realised that I was given the gift of \"constructive selfishness.\" The gist is: If you make things work for you, you can make things work for others as well.</p><p>Constructive selfishness includes others and means that by focusing on what you need, you can help others as well. Just being selfish disregards others, and in no way do I promote that. </p><p>I've been invited to run many a session by the Shuttleworth Foundation the past few years and the instruction was always that of constructive selfishness. What do you need or want to discuss? Focus on your needs and the conversation will be useful to you, plus others will find their own nuggets of information applicable to them.</p><p>The first time, I was wary &#x2014; how could this work? Wasn't I being too self-centered? But no: Session attendees felt like they could contribute to my work and that made them feel valued. They got new insights on their problems as well, because we tend to relate to the conversation from our own perspective anyway.</p><p>To my amazement I found little on the concept of constructive selfishness when I searched for it on Google. So I mentioned it a few times in the past few weeks in conversations and I got unanimous positive responses to the idea (to not oversell it: out of three conversations). Because of that, I am now sharing it in this blog, so that more people may benefit of knowing this idea. It's in no way my idea &#x2013; I was taught by Allen Gunner from <a href=\"https://aspirationtech.org/publications/manifesto?ref=chjh.nl\">Aspiration Tech</a>, so credit is due there!</p><p>Next time you're in a situation focusing on what others need, ask yourself what you need and how taking care of yourself can be the first step to help others. That's constructive selfishness and it can help you in your relationships, work, and elsewhere.</p><p></p><p></p>"},{"id":"636815f91c7946003d72d5b6","title":"Snaps of November (2022)","link":"https://www.chjh.nl/snaps-of-week/","published":"Fri, 02 Dec 2022 11:23:54 GMT","description":"I bought a new secondhand camera to kickstart my long-lost hobby from my adolescent days this month. I wanted to share some snaps here.","isPermalink":false,"tags":["Creative"],"authors":[{"name":"Chris Hartgerink","url":null}],"image":"https://images.unsplash.com/photo-1566863244489-a5e7946f46f1?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=MnwxMTc3M3wwfDF8c2VhcmNofDJ8fGZ1amlmaWxtfGVufDB8fHx8MTY2OTU0NzU1NQ&ixlib=rb-4.0.3&q=80&w=2000","modified":null,"contentHtml":"<img src=\"https://images.unsplash.com/photo-1566863244489-a5e7946f46f1?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=MnwxMTc3M3wwfDF8c2VhcmNofDJ8fGZ1amlmaWxtfGVufDB8fHx8MTY2OTU0NzU1NQ&ixlib=rb-4.0.3&q=80&w=2000\" alt=\"Snaps of November (2022)\"><p>I bought a new secondhand camera to kickstart my long-lost hobby from my adolescent days this month. I wanted to share some snaps here - you can also <a href=\"https://www.instagram.com/chrtgrnk/?ref=chjh.nl\">follow along on Instagram</a> nowadays (if that floats your goat &#x1F410;). </p><p>Back when I was around 15, I was too inhibited to take many pictures. I primarily used my youthful interest to learn about the technology. I knew about how aperture, ISO, and shutter speed interacted, and how to take pictures in theory. I did not really take many. Now I have more confidence in myself but I am still working on those inhibitions during Creative Fridays.</p><p>Here's some shots from the past month I wanted to share. I am a keen learner, so if you want to share feedback, reach out in the comments or otherwise. As you can see, I'm digging the black and white film simulation on my Fujifilm X-T3.</p><figure class=\"kg-card kg-gallery-card kg-width-wide\"><div class=\"kg-gallery-container\"><div class=\"kg-gallery-row\"><div class=\"kg-gallery-image\"><img src=\"https://www.chjh.nl/content/images/2022/11/09C2C71C-1313-4B27-A540-C23A44108911.jpeg\" width=\"1776\" height=\"1184\" loading=\"lazy\" alt=\"Snaps of November (2022)\" srcset=\"https://www.chjh.nl/content/images/size/w600/2022/11/09C2C71C-1313-4B27-A540-C23A44108911.jpeg 600w, https://www.chjh.nl/content/images/size/w1000/2022/11/09C2C71C-1313-4B27-A540-C23A44108911.jpeg 1000w, https://www.chjh.nl/content/images/size/w1600/2022/11/09C2C71C-1313-4B27-A540-C23A44108911.jpeg 1600w, https://www.chjh.nl/content/images/2022/11/09C2C71C-1313-4B27-A540-C23A44108911.jpeg 1776w\" sizes=\"(min-width: 720px) 720px\"></div><div class=\"kg-gallery-image\"><img src=\"https://www.chjh.nl/content/images/2022/11/700F17B7-02E3-4B77-ADCE-1572897BFE5F.jpeg\" width=\"1776\" height=\"1184\" loading=\"lazy\" alt=\"Snaps of November (2022)\" srcset=\"https://www.chjh.nl/content/images/size/w600/2022/11/700F17B7-02E3-4B77-ADCE-1572897BFE5F.jpeg 600w, https://www.chjh.nl/content/images/size/w1000/2022/11/700F17B7-02E3-4B77-ADCE-1572897BFE5F.jpeg 1000w, https://www.chjh.nl/content/images/size/w1600/2022/11/700F17B7-02E3-4B77-ADCE-1572897BFE5F.jpeg 1600w, https://www.chjh.nl/content/images/2022/11/700F17B7-02E3-4B77-ADCE-1572897BFE5F.jpeg 1776w\" sizes=\"(min-width: 720px) 720px\"></div><div class=\"kg-gallery-image\"><img src=\"https://www.chjh.nl/content/images/2022/11/A2F3FD29-5933-4E7D-B93E-1A487609FF16.jpeg\" width=\"1471\" height=\"1118\" loading=\"lazy\" alt=\"Snaps of November (2022)\" srcset=\"https://www.chjh.nl/content/images/size/w600/2022/11/A2F3FD29-5933-4E7D-B93E-1A487609FF16.jpeg 600w, https://www.chjh.nl/content/images/size/w1000/2022/11/A2F3FD29-5933-4E7D-B93E-1A487609FF16.jpeg 1000w, https://www.chjh.nl/content/images/2022/11/A2F3FD29-5933-4E7D-B93E-1A487609FF16.jpeg 1471w\" sizes=\"(min-width: 720px) 720px\"></div></div><div class=\"kg-gallery-row\"><div class=\"kg-gallery-image\"><img src=\"https://www.chjh.nl/content/images/2022/11/29112D69-C0FA-4F54-8E15-C3FC9DB91EB2.jpeg\" width=\"1321\" height=\"1059\" loading=\"lazy\" alt=\"Snaps of November (2022)\" srcset=\"https://www.chjh.nl/content/images/size/w600/2022/11/29112D69-C0FA-4F54-8E15-C3FC9DB91EB2.jpeg 600w, https://www.chjh.nl/content/images/size/w1000/2022/11/29112D69-C0FA-4F54-8E15-C3FC9DB91EB2.jpeg 1000w, https://www.chjh.nl/content/images/2022/11/29112D69-C0FA-4F54-8E15-C3FC9DB91EB2.jpeg 1321w\" sizes=\"(min-width: 720px) 720px\"></div><div class=\"kg-gallery-image\"><img src=\"https://www.chjh.nl/content/images/2022/11/4C39CC6F-28F6-42B6-9017-F5FF31FF8207.jpeg\" width=\"1776\" height=\"1184\" loading=\"lazy\" alt=\"Snaps of November (2022)\" srcset=\"https://www.chjh.nl/content/images/size/w600/2022/11/4C39CC6F-28F6-42B6-9017-F5FF31FF8207.jpeg 600w, https://www.chjh.nl/content/images/size/w1000/2022/11/4C39CC6F-28F6-42B6-9017-F5FF31FF8207.jpeg 1000w, https://www.chjh.nl/content/images/size/w1600/2022/11/4C39CC6F-28F6-42B6-9017-F5FF31FF8207.jpeg 1600w, https://www.chjh.nl/content/images/2022/11/4C39CC6F-28F6-42B6-9017-F5FF31FF8207.jpeg 1776w\" sizes=\"(min-width: 720px) 720px\"></div></div><div class=\"kg-gallery-row\"><div class=\"kg-gallery-image\"><img src=\"https://www.chjh.nl/content/images/2022/11/C78DA70F-B3FE-4318-9DE2-86D8A532AE03-5263-000000E2C4BBEB77.jpg\" width=\"1184\" height=\"1776\" loading=\"lazy\" alt=\"Snaps of November (2022)\" srcset=\"https://www.chjh.nl/content/images/size/w600/2022/11/C78DA70F-B3FE-4318-9DE2-86D8A532AE03-5263-000000E2C4BBEB77.jpg 600w, https://www.chjh.nl/content/images/size/w1000/2022/11/C78DA70F-B3FE-4318-9DE2-86D8A532AE03-5263-000000E2C4BBEB77.jpg 1000w, https://www.chjh.nl/content/images/2022/11/C78DA70F-B3FE-4318-9DE2-86D8A532AE03-5263-000000E2C4BBEB77.jpg 1184w\" sizes=\"(min-width: 720px) 720px\"></div><div class=\"kg-gallery-image\"><img src=\"https://www.chjh.nl/content/images/2022/11/413DB357-F9A5-435D-9E63-697961E4E8D6-13416-000002C12CC56620.jpg\" width=\"1184\" height=\"1776\" loading=\"lazy\" alt=\"Snaps of November (2022)\" srcset=\"https://www.chjh.nl/content/images/size/w600/2022/11/413DB357-F9A5-435D-9E63-697961E4E8D6-13416-000002C12CC56620.jpg 600w, https://www.chjh.nl/content/images/size/w1000/2022/11/413DB357-F9A5-435D-9E63-697961E4E8D6-13416-000002C12CC56620.jpg 1000w, https://www.chjh.nl/content/images/2022/11/413DB357-F9A5-435D-9E63-697961E4E8D6-13416-000002C12CC56620.jpg 1184w\" sizes=\"(min-width: 720px) 720px\"></div></div></div></figure>"},{"id":"638124daa13871003dc31d52","title":"Creative Fridays","link":"https://www.chjh.nl/creative-fridays/","published":"Mon, 28 Nov 2022 14:47:48 GMT","description":"After my summer vacation, I decided I was going to take Fridays off. For the past six weeks I have taken Creative Fridays.","isPermalink":false,"tags":["Creative"],"authors":[{"name":"Chris Hartgerink","url":null}],"image":"https://www.chjh.nl/content/images/2022/11/Screenshot-2022-11-27-at-11.52.56.png","modified":null,"contentHtml":"<!--kg-card-begin: markdown--><img src=\"https://www.chjh.nl/content/images/2022/11/Screenshot-2022-11-27-at-11.52.56.png\" alt=\"Creative Fridays\"><p>After my summer vacation, I decided I was going to take Fridays off. For the past six weeks I have taken Creative Fridays.</p>\n<p>At <a href=\"https://libscie.org/?ref=chjh.nl\">Liberate Science</a> my promise to the employees from the outset has been that we work four days a week. Despite fulfilling that promise to them in contracts and in practice, I never fulfilled that promise to myself consistently.</p>\n<p>I decided my way of delivering on that promise to myself was Creative Fridays. On this day, I work on being more expressive, creative, less inhibited. I don&#x2019;t work but get intionally creative. Having one day slotted for just that purpose helped me channel a desire to get creative that otherwise would evaporate throughout life.</p>\n<p>Every week, I keep a running list of things I might want to do on Creative Friday. Come Friday, I pick what&#x2019;s most appealing to me, for whatever reason, and go out and do that. Somedays, I go out for a walk and take my notebook with me, just to let my thoughts wander. Other days I have a desire to taste new food and find a place for lunch &#x2014; I already discovered some delicious tacos! I&#x2019;ve had long, intimate conversations on the phone that I otherwise would not have prioritised. I started taking pictures again; I am mixing and dancing to the music I&#x2019;ve missed partying to since 2020. The purpose is not to be productive, it's to be open to things coming into existence for no other reason than that.</p>\n<p>At first, Creative Friday was an experiment. I was afraid it would not be feasible with the workload from running Liberate Science, that I would feel too much pressure to get creative. But lo and behold, I get everything done in four days just as well. <a href=\"https://en.wikipedia.org/wiki/Parkinson%27s_law?ref=chjh.nl\">Parkinson&#x2019;s law states you&#x2019;ll take whatever time is allocated to some task</a>, and it seems to anecdotally work here. I also don't feel pressured as I am getting better at turning the switch.</p>\n<p>I now by default block my Fridays and prioritise my work to fit in four days. No amount of efficiency and time spent at the job will make me be able to do everything, so four days or five really only makes me more focused instead of less focused.</p>\n<p>Structurally taking time for myself provides me with a new sense of stability. It means I don&#x2019;t get caught up in the day to day as much, and have more space to see the bigger picture for what it is &#x2014; the day to day feels like <em>the</em> most important thing when stressed out, but of course it is not even if it is important. I am able to respond more empathetically and that makes me like my job more too!</p>\n<p>Taking that dedicated time also showed me how little I structurally did for myself - I (and maybe you too) tend to focus on others' needs first. It is something I have done all my life; giving myself permission to focus on me even for a day is liberating. I prioritise what I do and why I do it. It helps me not be excessively generous at the expense of myself on other days too.</p>\n<p>What do you do for yourself on a structural basis? Take yourself for lunch, get a mani-pedi? I&#x2019;d love to hear how you take care of yourself &#x1F60A;</p>\n<!--kg-card-end: markdown-->"},{"id":"637bf293471bbf004d9f8b93","title":"Thoughts on Mastodon (part 1?)","link":"https://www.chjh.nl/thoughts-on-mastodon/","published":"Mon, 21 Nov 2022 22:10:11 GMT","description":"The Twitter shitshow re-taught me a valuable lesson: All institutions we have come to rely on can be burnt down in just a few weeks. That means their maintenance requires effort and not changing things also...","isPermalink":false,"tags":[],"authors":[{"name":"Chris Hartgerink","url":null}],"image":"https://www.chjh.nl/content/images/2022/11/Mastodon-Elephant-Friend.webp","modified":null,"contentHtml":"<img src=\"https://www.chjh.nl/content/images/2022/11/Mastodon-Elephant-Friend.webp\" alt=\"Thoughts on Mastodon (part 1?)\"><p>The Twitter shitshow re-taught me a valuable lesson: All institutions we have come to rely on can be burnt down in just a few weeks. That means their maintenance requires effort and <em>not</em> changing things also takes effort. </p><p>I know this reenergises me about my work on changing science: Science and academia are also institutions that require maintenance to <em>not </em>change. This reaffirms Science as a system of power, just like any other in our society (it's why we can learn much more from the labour movement than we think).</p><p>Standing on the shoulders of the sysadmins, I decided I was going to make the jump to Mastodon and reduce my daily Twitter intake. </p><p>I am not deleting Twitter, for the same reason I'm feeling a pull towards Facebook nowadays: My business requires a presence to be successful. What is the value of an individualized choice in our connected world anyway? It's not linear, but cyclical: Individual choices can galvanise system change (see <a href=\"https://www.chjh.nl/direct-action-now/\">my recent post on direct action</a>) but you can't make all choices. Illusion of control and all that.</p><p>The transition to Mastodon is pretty great for me, I must say. I got a ton of dopamine when my introduction got a lot of attention (more than on Twitter) and I gained a ton of followers. Vanity aside, the platform feels like the Geocities of 2022. If you don't know what that is, I guess I've really transitioned from my early life. It feels indie: Fun, friendly, quirky. It might lose that of course as well.</p><figure class=\"kg-card kg-bookmark-card kg-card-hascaption\"><a class=\"kg-bookmark-container\" href=\"https://akademienl.social/@chartgerink/109298634121892507?ref=chjh.nl\"><div class=\"kg-bookmark-content\"><div class=\"kg-bookmark-title\">Chris Hartgerink (he/they) (@chartgerink@akademienl.social)</div><div class=\"kg-bookmark-description\">Attached: 1 image Realised I&#x2019;ve been rude and not introduced myself &#x1FAE0; #Belated #Introduction I finished my PhD in 2020 on building sustainable science, and the main point of my dissertation was that we need to reshuffle publishing from outcome based (e.g., papers) to process based. To realise&#x2026;</div><div class=\"kg-bookmark-metadata\"><img class=\"kg-bookmark-icon\" src=\"https://akademienl.social/packs/media/icons/apple-touch-icon-1024x1024-db6849588b44f525363c37b65ef0ac66.png\" alt=\"Thoughts on Mastodon (part 1?)\"><span class=\"kg-bookmark-author\">AkademieNL</span></div></div><div class=\"kg-bookmark-thumbnail\"><img src=\"https://cdn.masto.host/akademienlsocial/media_attachments/files/109/298/627/695/994/916/original/2c3e1e65a7818f2d.jpeg\" alt=\"Thoughts on Mastodon (part 1?)\"></div></a><figcaption>This toot (post on Mastodon) got a bunch more attention than I thought!</figcaption></figure><p>The biggest downside I&#x2019;ve noted is that I can&#x2019;t easily schedule my posts, and I end up spamming when I get a bout of energy to be active. Bear with me for now &#x1F60A;</p><p>All in all, I was hesitant to join because I wanted to make the perfect server choice. There is no perfect server I would like to tell myself. </p><p>It also does not really matter what server you choose. You can switch to another whenever you please. It's not like Twitter, where you're on or off. It's more like email if you have your own domain - just put your information elsewhere and point people there. Your email address remains the same.</p><p>That doesn't begin to explain Mastodon to you and sorry if you're looking for me to explain it here - I didn't intend to. I'm sharing thoughts as I try to keep myself to <a href=\"https://www.chjh.nl/10-posts-for-10-weeks/\">my 4th out of 10 posts I committed myself to</a>. Maybe I can write some more about Mastodon, if people like this kind of stuff &#x2014; I know it's on a lot of people's minds and I've come to realise I know things about this.</p><p>I'd be happy to consider a more detailed post if you let me know in the comments though. I might even do a behind the scenes on how to set up an instance and what the admins get to do, choose, and see. Because, if anything, you need to really trust your admins - they can do whatever they want with your data (and admins expose themselves to quite some legal risk if anybody can join too - content moderation and all that!).</p>"}]}