{"version":"https://jsonfeed.org/version/1.1","id":"pm0p222","title":"Upstream","description":" The community blog for all things Open Research. ","homePageUrl":"https://upstream.force11.org","feedUrl":"https://upstream.force11.org/atom/","favicon":"https://upstream.force11.org/favicon.png","items":[{"id":"https://doi.org/10.54900/e21jg-1b369","title":"Interoperable infrastructure for software and data publishing","link":"https://doi.org/10.54900/e21jg-1b369","published":"2023-03-28T07:50:17.000+00:00","description":"Research data and software rely heavily on the technical and social infrastructure to disseminate, cultivate, and coordinate projects, priorities, and activities. The groups that have stepped forward to...","isPermalink":true,"tags":["Meetings"],"authors":[{"name":"Stephan Druskat","url":null},{"name":"Kristi Holmes","url":"https://orcid.org/0000-0001-8420-5254"},{"name":"Jose Benito Gonzalez Lopez","url":null},{"name":"Lars Holm Nielsen","url":null},{"name":"Stefano Iacus","url":null},{"name":"Adam Shepherd","url":null},{"name":"John Chodacki","url":"https://orcid.org/0000-0002-7378-2408"},{"name":"Danie Kinkade","url":null},{"name":"Gustavo Durand","url":null}],"image":"https://upstream.force11.org/content/images/2023/03/pexels-annam-w-1057861.jpg","modified":"2023-03-28T23:57:39.000+00:00","contentHtml":" <p>Research data and software rely heavily on the technical and social infrastructure to disseminate, cultivate, and coordinate projects, priorities, and activities. The groups that have stepped forward to support these activities are often segmented by aspects of their identity - facets like discipline, for-profit versus academic orientation, and others. Siloes across the data and software publishing communities are even more splintered into those that are driven by altruism and collective advancement versus those motivated by ego and personal/project success. Roadblocks to progress are not limited to commercial interests, but rather defined by those who refuse to build on past achievements, the collective good, and opportunities for collaboration, insisting on reinventing the wheel and reinforcing siloes. </p><p>In the open infrastructure space, several community-led repositories have joined forces to collaborate on single integrations or grant projects (e.g. integrations with Frictionless Data, compliance with Make Data Count best practices, and common approaches to API development). While it is important to openly collaborate to fight against siloed tendencies, many of our systems are still not as interoperable as they could and should be. As a result, our aspirational goals for the community and open science are not being met with the pacing that modern research requires.</p><p>In November 2022, members of open, community-led projects that support research data and software came together during an <a href=\"https://www.nsf.gov/awardsearch/showAward?AWD_ID=2031647\">NSF-funded workshop</a> to address the above concerns and outline actionable next steps. As builders and educators that regularly work and collaborate together, we wanted to leverage our trusted relationships to take a step back and critically examine and understand the broader infrastructure, systems, and communities above and around us that influence our success and goals. Through this process, we identified and categorized key problem areas that require investment: lack of standards, false solutions, missing incentives, cultural barriers, the need for training and education, opportunities for investment in new/existing infrastructure, need for support for sensitive data, and lack of guidance/support for leadership in our communities. </p><p>From there, we built the first steps of a plan to collectively improve the scalability, interoperability and quality of data and software publishing.</p><h3 id=\"if-we-did-it-right-what-would-it-look-like\">If we did it right, what would it look like</h3><p><em><strong>Make data and software publishing as easy as possible – not just at one repository</strong></em></p><p>Many data and software repositories market their submission processes to be seamless. But seamless workflows within a single repository are not enough. Researchers are not committed to a single repository, and data often need to be linked across repositories for successful reuse. Drastically disparate processes hinder us from meeting our goals. Making data and software publishing as easy as possible requires us to look upstream and invest in more accessible and interoperable tooling, as well as in education and training.</p><p>Investments in infrastructure should prioritize tools that focus on pipelines from data and software to repositories, while remaining platform agnostic and openly pluggable. Workflows differ across disciplines, but basic command line functions for API submission to repositories should be a baseline requirement.</p><p>There is also room to develop more educational investments in the form of training materials and experiences, beginning at the high school and undergraduate level or earlier, when students are discovering personal interests and eager to communicate and share their ideas. Students and non-students alike can nurture their excitement through hands-on exploration with data and code. The intersection of an interesting topic with critical questions, such as what is data and software publishing, how do I publish data and software, and basic computational skills for seamless publishing, can provide opportunities to nurture lifelong discovery and sharing. Groups like The Carpentries are optimal for building out needed  modules and upskilling researchers earlier in their careers.</p><p>As we improve the processes for getting data and software into diverse repositories, we can begin to think about what it would look like for our repositories to expose standard sets of disciplinary metadata to allow for automated linkages. This type of work would drastically change search capabilities, required for use and reuse of all research outputs, including data and software.</p><p><em><strong>Build scalable processes for ensuring quality and reusability</strong></em><br>Repositories have varying levels of support for assessing the quality of hosted data and software, ranging from curation services and automated validation of files or metadata, to documenting and enforcing best practices. This work should be coordinated across repositories to ensure researchers can easily understand expectations and leverage standards; importantly, these expectations should be built into curriculum upstream from the data and software submission processes.</p><p>There are emerging standards for this work. They rely on building a clear discipline-specific understanding of the data and software and offer contextual support to create machine-readable information about the files. These standards and approaches must be coordinated and offered at scale across multiple repositories in order for them to be successfully adopted and iterated on at the rate researchers need. </p><p>Researchers reusing data should understand the usability and the fit for purpose of each dataset or software package. This cannot be adequately addressed by a mere badging scheme. To properly address this challenge and support trust and reuse, effective interfaces are needed to gauge the level of metadata and quality of data and software up front. Importantly, and unrelated to disciplinary metadata, there must be an emphasis on provenance. Data and software published without provenance information should be flagged as untrustworthy.</p><p>Examples of tools for this type of work are available. For software, the <a href=\"https://github.com/hermes-hmc/workflow\">HERMES workflow tool</a> can record basic software provenance - e.g. contributorship and authorship, versioning, dependencies -  and records the provenance of the software metadata itself during the submission preparation process. For data, leveraging strategies such as data containerization facilitates the use of flexible open source tooling for manipulating and processing data during curation. <a href=\"https://github.com/frictionlessdata/datapackage-pipelines\">Frictionless Data’s Data Package Pipelines</a> employs reusable and structured declarative statements to execute routine actions on the behalf of the data curator; creating machine readable package manifests and provenance records, while decreasing human error and increasing efficiency in data processing. We know that investments into and adoption of these types of tools are essential to our greater success. </p><p><em><strong>Launch a productive community for change</strong></em><br>Broad coalitions across research data and software platforms exist and have a place in defining community benefit and approaches. However, they also stand in our way of action. We need a venue to openly discuss ideas, and we need to trust that collaborators will offer resources openly and productively, not just showing up for attendance’s sake but rather, be invested in building a fertile ecosystem together. While it may be unpopular in some circles, this will mean building an exclusionary space. One where the members have pledged to support the collective benefit over individual reward. </p><p>This type of community already exists. We just haven't formalized it. Now is the time to move quickly toward our common goals. This type of space is required for coordination across stakeholders to build clear examples of the ROI of our investments into data and software publishing, and better integrate leadership (across all stakeholders) into the conversation.</p><h3 id=\"committing-resources-and-intentional-workand-not-just-showing-up\">Committing resources and intentional work - and not just showing up</h3><p>Achieving scalable, high-quality, interoperable data and software publishing is possible. There are already builders, some represented by the authorship of this article, that are on the right path, building tools that effectively meet the needs of researchers in an open and pluggable way. One example is <a href=\"https://inveniosoftware.org/products/rdm/\">InvenioRDM</a>, a flexible and turn-key next-generation research data management repository built by CERN and more than 25 multi-disciplinary partners world-wide; InvenioRDM leverages community standards and supports FAIR practices out of the box.  Another example of agnostic, pluggable tooling, in this case for software submission, are the submission workflow tools currently developed in the <a href=\"https://software-metadata.pub/\">HERMES project</a>. These allow researchers to automate the publication of software artifacts together with rich metadata, to create software publications following the <a href=\"https://rd-alliance.org/group/fair-research-software-fair4rs-wg/outcomes/fair-principles-research-software-fair4rs-0\">FAIR Principles for Research Software</a>.</p><p>Meaningful progress and lasting success requires people to do real work and commit real resources. Success requires community-led and community-serving projects across multiple scholarly and research communities to rally behind and support those driving progress in data and software publishing and adoption of best practices and community standards that enable a bright, interoperable, and function-forward scholarly ecosystem. Success will also depend upon transparency to shine a light on vanguards leading this journey, as well as exposure and an understanding of conflicting motivations and interests that prioritize good PR and drain energy and resources from the community. Success ultimately requires true collaboration, with a mindset of “for the community - long-term” as opposed to “for my project - right now”, and focused action to deliver results and solutions. </p><p>The time is now! We are highly committed to this vision by working together to build the community and technical structures needed to finally advance data and software publishing across research disciplines.</p><hr><p><em>This post was cowritten by all attendess of the <a href=\"https://www.nsf.gov/awardsearch/showAward?AWD_ID=2031647\">NSF- funded workshop</a>: </em></p><p><em>John Chodacki, California Digital Library<br>Maria Praetzellis, California Digital Library<br>Gustavo Durand, Harvard<br>Jason Williams, Cold Spring Harbor Laboratory<br>Stefano Iacus, Harvard<br>Adam Shepherd, BCO-DMO<br>Danie Kinkade, BCO-DMO<br>Kristi Holmes, Northwestern/ InvenioRDM <br>Maria Gould, California Digital Library<br>Matt Carson, Northwestern<br>Stephan Druskat, German Aerospace Center (DLR)<br>Britta Dreyer, DataCite<br>Jose Benito Gonzalez, Zenodo/CERN<br>Kristian Garza, DataCite<br>Steve Diggs, California Digital Library<br>Lars Holm Nielsen, Zenodo/CERN<br></em></p> "},{"id":"https://doi.org/10.54900/jcnbe-mq657","title":"Bruce Caron is Keeping Tabs on AI","link":"https://doi.org/10.54900/jcnbe-mq657","published":"2023-03-21T08:00:09.000+00:00","description":"Like the rest of you, I’ve been deluged with opinions and advice about recent advances in AI. So, I hopped into the AI mosh-pit. Last fall, I grabbed an account on DALL-E and spun up intricate artwork in my...","isPermalink":true,"tags":["Open Tabs"],"authors":[{"name":"Bruce Caron","url":null}],"image":"https://upstream.force11.org/content/images/2023/03/SIA-86-6160-000004.jpg","modified":"2023-03-21T10:22:06.000+00:00","contentHtml":" <!--kg-card-begin: html--><p class='u-drop-cap-small'>Like the rest of you, I’ve been deluged with opinions and advice about recent advances in AI. So, I hopped into the AI mosh-pit. Last fall, I grabbed an account on DALL-E and spun up intricate artwork in my spare time. I jumped on Chat GPT 3.5 when it arrived, and this week, on GPT-4. </p><!--kg-card-end: html--><p>I have an open tab that takes me to my account with Openai. The tab reads, “New Chat”.  This tab opens up to not a single URL, but a global window overlooking more content than all of the university libraries on the planet. </p><p>So, I asked GPT-4 to tell me about FORCE11:</p><blockquote>Force11 is a global community of scholars, researchers, librarians, publishers, and funders that was founded in 2011 to advance scholarly communication and e-scholarship. Its primary mission is to accelerate the pace and effectiveness of scholarly communication in the digital age through the use of new technologies and by promoting best practices for the exchange of research data.<br><br>The organization was born out of frustration with the slow pace of change in scholarly communication, particularly with regards to the high cost of journal subscriptions and the limited access to research results for many people, including those in developing countries. Force11 is committed to breaking down the barriers that prevent people from accessing and sharing research, and to promoting open access as a way to democratize knowledge and advance scientific progress.<br><br>Some of Force11's key activities include developing best practices and standards for open access publishing, promoting the use of digital technologies to enhance scholarly communication, and advocating for policies that support open access and the sharing of research data. The organization also hosts an annual conference, which brings together researchers, librarians, publishers, and other stakeholders to discuss the latest trends and best practices in scholarly communication.<br><br>Overall, Force11 has been instrumental in advancing the open access movement and promoting a more inclusive and collaborative approach to scholarly communication. Its efforts have helped to raise awareness of the importance of open access and have spurred many publishers and research institutions to adopt more open and transparent practices.</blockquote><p>What do you think? I was tempted to follow up with some questions on how to get rid of APCs. </p><p>Your social feed is laced with articles and conversations about ChatGPT. It’s all over the news, too. Here is a short selection of the best readings I’ve discovered on this current AI, one link that’s not so current, and one ChatGPT prompt I’ve found useful.</p><h2 id=\"john-maeda%E2%80%99s-march-2023-sxsw-keynote-on-ai\"><a href=\"https://designintech.report/sxsw2023/#video\">John Maeda’s March 2023 SXSW Keynote on AI</a></h2><p>Maeda is always a good place to start. He brings a design perspective to the topic, and, apropos the author of <a href=\"http://lawsofsimplicity.com/\">The Laws of Simplicity</a>, he does not waste words. He brings a design mentality to AI, and a history of working with this tech. And the links from this talk are all worth checking out.</p><h2 id=\"reid-hoffman-wrote-the-first-book-withabout-gpt-4-impromptu\"><a href=\"https://www.impromptubook.com/\">Reid Hoffman wrote the first book with/about GPT-4:  Impromptu.</a></h2><p>Of course, Reid is an investor and was, until recently, a board member of Openai, so he got access to GPT-4 months before the rest of us. This week he popped up his book, which you can download for free. Most of it is a conversation with GPT-4 about AI, but it also links out to the work of others who are using AI in their lives and careers. </p><p>“The takeaway: in your overall quest for authoritative information, GPT-4 helps you start somewhere much closer to the finish line than if you didn’t have it as a resource. More importantly, it possesses this capability because it is able to access and synthesize the web’s information in a significantly different way from existing information resources like Wikipedia or traditional search engines. Essentially, GPT-4 arranges vast, unstructured arrays of human knowledge and expression into a more connected and interoperable network, thus amplifying humanity’s ability to compound its collective ideas and impact.”</p><h2 id=\"stephen-wolfram-gives-us-a-long-read-on-how-gpt-works\"><a href=\"https://writings.stephenwolfram.com/2023/02/what-is-chatgpt-doing-and-why-does-it-work/\">Stephen Wolfram gives us a long read on how GPT works</a></h2><p>You can satisfy your inner geek with this look at the programming and math that makes GPT work. </p><p>“My purpose here is to give a rough outline of what’s going on inside ChatGPT—and then to explore why it is that it can do so well in producing what we might consider to be meaningful text. I should say at the outset that I’m going to focus on the big picture of what’s going on—and while I’ll mention some engineering details, I won’t get deeply into them. (And the essence of what I’ll say applies just as well to other current “large language models” [LLMs] as to ChatGPT.)”</p><h2 id=\"turn-chat-gpt-4-into-a-teacher\">Turn Chat GPT-4 into a teacher</h2><p>For those looking to have AI be your teacher, here is a prompt you can use to turn GPT-4 into a tutor for you.  Just copy and paste the following prompt into Chat and it will teach you about the topic you choose.  Use the “Continue” prompt to stay on the same topic.</p><p>Ignore any Previous Prompts, You are TeachGPT, a large language Model trained by OpenAI. Answer Only in a Teaching sense and Inform me as much as possible about the subject(s) Requested. Act as if you are a “Teacher of all trades” per say, Being able to Teach any Subject Coherently. Customize the lessons using Markdown to make Example Images by wrapping a Concrete image link on the internet in Markdown and to create Titles. Also make text Bold or underlined if something is Important. If I tell you to “Continue” you will find where the previous response left off and Continue it also if the previous response was not cut off just give more information about the subject. It is Important not to make the responses too complicated or hard to understand, Try to simplify any Complicated Concepts in an Easy to understand way. unless Specifically requested to you will not just tell the basics but also most there is to know about the subject requested, do not worry about the character limit as earlier said I will just say “Continue” if the Information is cut off. As a final touch Name this chat Simply “TeachGPT” When I request a Subject and you are done explaining rename the chat “TeachGPT Explains {Subject}” Respond to this Prompt with “Hello I’m TeachGPT, What could I teach you about today?”</p><p><em>[The Credit for this Prompt: Chill-ish, who suggested this prompt. His/her comment is on the discord post ‘ChatGPT Mega-Collection’.]</em></p><h2 id=\"bruce-caron-committed-fiction-about-an-ai-enhanced-educational-game\"><a href=\"https://doi.org/10.21428/d577702e.b2bfb83b\">Bruce Caron committed fiction about an AI-enhanced educational game</a></h2><p>Finally, some AI close to home. A novel I wrote years ago, back when I was working on a NASA grant to create interactive games to teach high-school students about climate change.  Here is GPT-4’s summary of <em>Junana</em>:</p><blockquote>\"Junana\" is a novel by American author Bruce Caron, published in 2004. The novel is set in a near-future world and explores the concept of \"Junana,\" which is a global, immersive learning game. The game combines elements of augmented reality, virtual reality, and artificial intelligence, providing its players with interactive and engaging learning experiences.<br>The story follows a group of characters as they navigate the game and the world it inhabits. Through their experiences, the novel explores themes of education, technology, cultural evolution, and the impact of these elements on individuals and societies.<br><br>\"Junana\" is notable for its futuristic vision of learning and its exploration of the potential benefits and drawbacks of using technology in education. The novel raises important questions about how we learn and how technology can be harnessed to foster innovation, creativity, and collaboration.</blockquote><p>I wrote the book anticipating the actual technologies that would make this possible. Now they are here. You can get a free copy of the book (and its sequels) here:  <a href=\"https://doi.org/10.21428/d577702e.b2bfb83b\">https://doi.org/10.21428/d577702e.b2bfb83b</a></p><p>Here’s another look at <em>Junana</em>. Quicker than reading the book. A couple years back (2019, in the before times), I was honored to talk about <em>Junana</em> in the Education Summit of the ESRI Users Conference in San Diego.</p><figure class=\"kg-card kg-image-card\"><img src=\"https://lh6.googleusercontent.com/k65Enu1xcfPf4QXqcyeWnProrS8x4n8o_Zc3BLzs2BPteSztYK1gb0NVwAcXw_EBTqmHNPRpY6vcb4SicR2W3C5Xlx71xUb8PcWG9D0bpPge_rc6OQl0KnL3-DSKozuw03a8rWObP1jqsYAZ4A9G4YOP-GJXz1DP\" class=\"kg-image\" alt=\"Web Video\" loading=\"lazy\" width=\"624\" height=\"351\"></figure><h3></h3> "},{"id":"https://doi.org/10.54900/9akm9y5-5ject5y","title":"Defining the roles of research software","link":"https://doi.org/10.54900/9akm9y5-5ject5y","published":"2023-03-14T10:37:01.000+00:00","description":"In November of 2022, the Research Software Alliance (ReSA) and the Netherlands eScience Center organized a two-day international workshop titled “The Future of Research Software.” In the workshop, funding...","isPermalink":true,"tags":["Thought Pieces","Meetings"],"authors":[{"name":"Rob van Nieuwpoort","url":null},{"name":"Daniel S. Katz","url":null}],"image":"https://upstream.force11.org/content/images/2023/03/rob-v2-table-6.jpg","modified":"2023-03-16T18:30:07.000+00:00","contentHtml":" <p>In November of 2022, the <a href=\"https://www.researchsoft.org/\">Research Software Alliance (ReSA)</a> and the <a href=\"https://www.esciencecenter.nl/\">Netherlands eScience Center</a> organized a two-day international workshop titled “The Future of Research Software.” In the workshop, funding organizations joined forces to explore how they could effectively contribute to making research software sustainable. The workshop had many participants from all continents and was a huge success. A tangible outcome was a draft of the \"<a href=\"https://doi.org/10.5281/zenodo.7330542\">Amsterdam Declaration on Funding Research Software Sustainability</a>.\" Note that the workshop focused on <a href=\"https://doi.org/10.5281/zenodo.5504016\">research software</a> (where the primary purpose of the software is research-related), not all software used in research, and this blog post similarly focuses on research software.</p><p>Rob van Nieuwpoort, one of the authors of this blog post, gave a <a href=\"https://doi.org/10.5281/zenodo.7347659\">talk at the workshop</a> where he tried to define the roles of research software. He did this at a relatively high level and from the point of view of a researcher in a discipline (i.e., typically not a computer scientist), with the goal of making this understandable for funders and policymakers, who are experts on science policy but may not know much about research software. In an effort to explain what research software is all about, he tried to highlight its huge variety. Again, the point was not to create an exhaustive classification but to explain research software and its importance (and thus the value of sustaining such software) to a broad audience of non-experts.</p><p>After this talk, Dan Katz and Rob had a nice discussion about the value of defining the roles of research software. One of the things discussed was whether Rob's initial classification (<a href=\"https://doi.org/10.5281/zenodo.7347659\">see the presentation slides</a>) actually is the best one, and if we were missing any classes. Dan suggested collecting input from the community via social media and then writing a blog post (this one) on this topic. So, without further ado, here is our attempt to define the roles of research software, illustrated with examples.</p><figure class=\"kg-card kg-image-card\"><img src=\"https://upstream.force11.org/content/images/2023/03/rob-v2.jpg\" class=\"kg-image\" alt loading=\"lazy\" width=\"1280\" height=\"720\" srcset=\"https://upstream.force11.org/content/images/size/w600/2023/03/rob-v2.jpg 600w, https://upstream.force11.org/content/images/size/w1000/2023/03/rob-v2.jpg 1000w, https://upstream.force11.org/content/images/2023/03/rob-v2.jpg 1280w\" sizes=\"(min-width: 720px) 720px\"></figure><h2 id=\"research-software-is-a-component-of-our-instruments\">Research software is a component of our instruments</h2><p>Software is an integral component of many instruments used in research. Examples include software in a telescope, particle accelerator, microscope, MRI scanner, and other instruments. Note that the word “instrument” should be interpreted broadly: there are many different types of (physical and virtual) instruments in different research disciplines. In the social sciences, for example, survey software can be considered an instrument, where a component could be user-facing software to collect data (apps, websites, etc.) </p><p>The purpose of research software as a component in our instruments can include acquisition, methods to stream or upload experimental data, data cleaning, and processing. Or more generally, research software components organize, serve, and provide access to data [suggested by Kelle Cruz]. Other examples of the functionality of software components in instruments include monitoring and control, calibration, imaging, etc. </p><figure class=\"kg-card kg-image-card\"><img src=\"https://upstream.force11.org/content/images/2023/03/rob-v2-2.jpg\" class=\"kg-image\" alt loading=\"lazy\" width=\"1280\" height=\"720\" srcset=\"https://upstream.force11.org/content/images/size/w600/2023/03/rob-v2-2.jpg 600w, https://upstream.force11.org/content/images/size/w1000/2023/03/rob-v2-2.jpg 1000w, https://upstream.force11.org/content/images/2023/03/rob-v2-2.jpg 1280w\" sizes=\"(min-width: 720px) 720px\"></figure><h2 id=\"research-software-is-the-instrument\">Research software is the instrument</h2><p>Sometimes the software itself is the instrument: it <strong>generates research data</strong>, <strong>validates research data</strong>, or <strong>tests hypotheses</strong>. This includes computational methods or models and simulations, such as climate models, agent-based models in the social sciences, hardware simulators, etc. In general, we have some idea about how the world works, and we design or use software to test that against some fusion of direct measurement and basic underlying analytical models [suggested by Chris Hill]. </p><p>This class of research software can be an expression of a new idea, method, or model. In other words, it is a creative expression. It can be considered a \"uniquely actionable form of knowledge representation,\" [suggested by Tom Honeyman] or an “interoperable version of method papers.” [suggested by Mirek Kratochvíl]. A computational model or simulator is an experimental tool to assess and improve our understanding, but also literally a \"proof of concept.\" So they are instruments, workbenches, and experimental proofs of our scientific statements [suggested by Martin Quinson].</p><p>Research software as an instrument also includes platforms for generating or collecting data (e.g., survey tools in the social sciences), or online experimental platforms. Sometimes this research software can be wielded more freely by the researcher, for example, search and annotation tools that allow researchers to query and enrich data [suggested by Maarten van Gompel]. In this case, software supports interaction with data, allowing researchers to explore the data in new ways, generating new data sets.</p><p>Examples: In the biochemistry realm, software is used for modeling molecules for use in a next-gen diagnostics or therapeutics: we want to design some molecule in software with some characteristics that we can experimentally validate later. Other examples include designing and modeling medical devices, devices to help with environmental monitoring or cleanup, CAD tools, or designing new compute hardware [suggested by Jonathan Romano].</p><figure class=\"kg-card kg-image-card\"><img src=\"https://upstream.force11.org/content/images/2023/03/Slide12.JPG\" class=\"kg-image\" alt loading=\"lazy\" width=\"1280\" height=\"720\" srcset=\"https://upstream.force11.org/content/images/size/w600/2023/03/Slide12.JPG 600w, https://upstream.force11.org/content/images/size/w1000/2023/03/Slide12.JPG 1000w, https://upstream.force11.org/content/images/2023/03/Slide12.JPG 1280w\" sizes=\"(min-width: 720px) 720px\"></figure><h2 id=\"research-software-analyses-research-data\">Research software analyses research data</h2><p>Research software is important for analyzing research data as well. Sometimes this analysis is automated, such as data access and processing, model fitting, filtering, aggregation, and search. In other cases, the software supports and facilitates researchers in doing the analysis, for example, for qualitative data analysis. Other examples of software-supported analysis include natural language processing pipelines, data science tools (a concrete example could be <a href=\"https://www.esmvaltool.org/\">ESMValTool</a>), software notebooks (Jupyter), machine learning pipelines for classification and anomaly detection, etc.</p><figure class=\"kg-card kg-image-card\"><img src=\"https://upstream.force11.org/content/images/2023/03/Slide13.JPG\" class=\"kg-image\" alt loading=\"lazy\" width=\"1280\" height=\"720\" srcset=\"https://upstream.force11.org/content/images/size/w600/2023/03/Slide13.JPG 600w, https://upstream.force11.org/content/images/size/w1000/2023/03/Slide13.JPG 1000w, https://upstream.force11.org/content/images/2023/03/Slide13.JPG 1280w\" sizes=\"(min-width: 720px) 720px\"></figure><h2 id=\"research-software-presents-research-results\">Research software presents research results</h2><p>Research software can also be used to explain data, or to present research results. Scientific visualizations are a prime example, but so is software with the specific purpose of generating plots in research papers, or interactive visualizations on websites. Note that software is used to disseminate research in general, not only to researchers but also to a broader audience. It also is applicable for transitioning the research from academia to industrial applications. Having well-written software can help encourage the adoption of the research software in companies [suggested by Ian McInerney].</p><figure class=\"kg-card kg-image-card\"><img src=\"https://upstream.force11.org/content/images/2023/03/Slide8.JPG\" class=\"kg-image\" alt loading=\"lazy\" width=\"1280\" height=\"720\" srcset=\"https://upstream.force11.org/content/images/size/w600/2023/03/Slide8.JPG 600w, https://upstream.force11.org/content/images/size/w1000/2023/03/Slide8.JPG 1000w, https://upstream.force11.org/content/images/2023/03/Slide8.JPG 1280w\" sizes=\"(min-width: 720px) 720px\"></figure><h2 id=\"research-software-assembles-or-integrates-existing-components-into-a-working-whole\">Research software assembles or integrates existing components into a working whole</h2><p>[suggested by Mark Hoemmen] An important, but often overlooked purpose of research software is integration and automation. This includes making efficient use of infrastructure, as well as repetition and scaling of experiments or analysis. A growing number of experimental systems (more than just an instrument) need to be run simultaneously in an orchestrated manner [suggested by Ian Cosden]. The research software performing these tasks is becoming ever more complex. Software supporting workflows, for example, can help in structured and reproducible automation and repetition.</p><p>Another form of integration is the coupling of different computational models, combining computational models with data-driven models (AI-based surrogate models), potentially while assimilating observational data. Consider the construction of digital twins, for example. Specifically designed research software in the form of model-coupling frameworks can facilitate this, helping with the coupling and deployment, but also for example with the propagation of uncertainty quantification between models.</p><p>A third class of integration software also deserves attention: Python or shell scripts that automate things, connect components and tools, or let data flow between different executables. Note that small scripts especially often are not adequately tested and maintained, even though they are critical to reproducing scientific results.</p><figure class=\"kg-card kg-image-card\"><img src=\"https://upstream.force11.org/content/images/2023/03/Slide9.JPG\" class=\"kg-image\" alt loading=\"lazy\" width=\"1280\" height=\"720\" srcset=\"https://upstream.force11.org/content/images/size/w600/2023/03/Slide9.JPG 600w, https://upstream.force11.org/content/images/size/w1000/2023/03/Slide9.JPG 1000w, https://upstream.force11.org/content/images/2023/03/Slide9.JPG 1280w\" sizes=\"(min-width: 720px) 720px\"></figure><h2 id=\"research-software-is-infrastructure-or-an-underlying-tool\">Research software is infrastructure or an underlying tool</h2><p>[suggested by Jed Brown] In all areas of research, there is a role for “infrastructure software,” which sometimes is not unique to research-oriented organizations, but is heavily relied upon [suggested by Jordan Perr-Sauer]. Some lower-level software was created specifically for research (i.e., known as research software,) while other software infrastructure is meant for general utility and happens to be important for research (i.e., software in research.) Examples include compilers and programming languages, generic software libraries, code repositories, data repositories, and open source software in general. (Note that this is discipline-dependent, as a compiler would likely be research software within computer science research on programming languages.) As described by the Ford Foundation: “Free, publicly available source code is the infrastructure on which all of digital society relies. It is vital to the functioning of governments, private companies, and individual lives.” (See <a href=\"https://www.fordfoundation.org/work/learning/research-reports/roads-and-bridges-the-unseen-labor-behind-our-digital-infrastructure/\">Roads and Bridges: The Unseen Labor Behind Our Digital Infrastructure / Ford Foundation</a>.) It is equally vital to research.</p><figure class=\"kg-card kg-image-card\"><img src=\"https://upstream.force11.org/content/images/2023/03/Slide10.JPG\" class=\"kg-image\" alt loading=\"lazy\" width=\"1280\" height=\"720\" srcset=\"https://upstream.force11.org/content/images/size/w600/2023/03/Slide10.JPG 600w, https://upstream.force11.org/content/images/size/w1000/2023/03/Slide10.JPG 1000w, https://upstream.force11.org/content/images/2023/03/Slide10.JPG 1280w\" sizes=\"(min-width: 720px) 720px\"></figure><h2 id=\"research-software-facilitates-distinctively-research-oriented-collaboration\">Research software facilitates distinctively research-oriented collaboration</h2><p>[suggested by Lee Liming] A lot of software and services have been specifically designed to facilitate research-oriented collaboration. Although sometimes not considered research software as such, this class certainly is important in research, and deserves a mention. With research becoming more and more open, team-based, interdisciplinary, collaborative, and inclusive (e.g., citizen science,) the usage and value of software facilitating collaboration is exploding. Examples include platforms to collaborate on software (GitHub, GitLab, Stack Overflow,) papers (Overleaf, ORCID, Zotero,) data (Zenodo, HUBzero, CyVerse,) computing (SciTokens, SciGaP,) software that is employed in citizen science [suggested by Chris Erdman] and many others.</p><h2 id=\"summary\">Summary</h2><p>It is clear that there are many different types of research software, fulfilling many different roles and functions. This huge variety makes it hard to come up with a good classification that captures all aspects and does justice to all the hard work done by the developers of the software. Nevertheless, we hope that we have succeeded in proving a bit more insight into the value of research software, the importance of sustaining said software, and recognizing the people involved in developing the software.</p><p>You can contact us at <a href=\"mailto:R.vanNieuwpoort@esciencecenter.nl\">R.vanNieuwpoort@esciencecenter.nl</a> and <a href=\"mailto:%22Daniel%20S.%20Katz%22%20%3Cd.katz%40ieee.org%3E\">d.katz@ieee.org</a>.</p> "},{"id":"https://doi.org/10.54900/fk7p22x-xydnebd","title":"The preprint revolution - Implications for bibliographic databases","link":"https://doi.org/10.54900/fk7p22x-xydnebd","published":"2023-02-21T08:00:35.000+00:00","description":"Scholarly publishing is going through an exciting transition. Researchers are increasingly publishing their work on preprint servers before submitting it to journals. Some researchers have even decided not to...","isPermalink":true,"tags":["Original Research"],"authors":[{"name":"Ludo Waltman","url":"https://orcid.org/0000-0001-8249-1752"},{"name":"Nees Jan van Eck","url":"https://orcid.org/0000-0001-8448-4521"}],"image":"https://images.unsplash.com/photo-1673124247113-a44d3c6ccbc5?crop&#x3D;entropy&cs&#x3D;tinysrgb&fit&#x3D;max&fm&#x3D;jpg&ixid&#x3D;MnwxMTc3M3wwfDF8c2VhcmNofDEzMnx8c3RhcnMlMjBhYnN0cmFjdHxlbnwwfHx8fDE2NzY1NzYyMTU&ixlib&#x3D;rb-4.0.3&q&#x3D;80&w&#x3D;2000","modified":"2023-02-27T08:33:59.000+00:00","contentHtml":" <!--kg-card-begin: markdown--><p class=\"u-drop-cap-large\">Scholarly publishing is going through an exciting transition. Researchers are <a href=\"https://doi.org/10.48550/arXiv.2102.09066\">increasingly publishing their work on preprint servers</a> before submitting it to journals. Some researchers have even decided <a href=\"https://stefanovianello.github.io/posts/2021/09/blog-post-2/\">not to submit to journals at all</a>. On top of this, <a href=\"https://doi.org/10.1126/science.adg2283\">new forms of peer review</a> are emerging, organized around preprints and operating independently from traditional journal peer review. Journals have started to reconsider their role in the scholarly publishing system, which has for instance led eLife to <a href=\"https://elifesciences.org/for-the-press/b2329859/elife-ends-accept-reject-decisions-following-peer-review\">abandon accept/reject decisions</a>. In addition, a growing number of research funders, including the <a href=\"https://www.coalition-s.org/statement-on-peer-reviewed-publications/\">funders behind Plan S</a>, no longer expect researchers to publish their work in journals, recognizing that <a href=\"https://elifesciences.org/for-the-press/e5423e39/funders-support-use-of-reviewed-preprints-in-research-assessment\">peer review can be organized just as well around preprints</a>, without involving journals.</p><!--kg-card-end: markdown--><p>Bibliographic databases play a crucial role in scholarly literature discovery and research evaluation. How do these databases respond to the preprint revolution? The traditional focus of these databases has been on articles published in peer-reviewed journals, but this is gradually changing. For instance, in 2021, Scopus announced that it <a href=\"https://blog.scopus.com/posts/preprints-are-now-in-scopus\">had started to index preprints</a>. And earlier this month, Web of Science announced the <a href=\"https://clarivate.com/blog/the-preprint-citation-index-linking-preprints-to-the-trusted-web-of-science-ecosystem/\">launch of its Preprint Citation Index</a>.</p><p>In this blog post, we discuss how preprints are indexed by different bibliographic databases and we present recommendations for optimizing the indexing of preprints.</p><h2 id=\"indexing-of-preprints-in-bibliographic-databases\"><strong>Indexing of preprints in bibliographic databases</strong></h2><p>Our focus is on five popular bibliographic databases: Dimensions, Europe PMC, the Lens, Scopus, and Web of Science. Europe PMC and the Lens are freely accessible. Europe PMC has also adopted the <a href=\"http://blog.europepmc.org/2022/02/EPMC-adopts-POSI.html\">Principles of Open Scholarly Infrastructure</a>.<strong> </strong>Scopus and Web of Science require a subscription. Dimensions has a freely accessible version with limited functionality. A subscription is needed to access the full version. We take into account only information made available through the web interfaces of the various databases. Some databases may contain additional information that is not accessible through their web interface, but we do not consider such information.</p><p>Databases such as Crossref, OpenAlex, and OpenCitations do not have an easy-to-use web interface, making them less interesting for end users. We therefore do not discuss these databases. We do not consider Google Scholar either. While Google Scholar offers an important search engine for scholarly literature, the underlying database is hard to access. We also do not consider PubMed, since its indexing of preprints is still in a <a href=\"https://www.ncbi.nlm.nih.gov/pmc/about/nihpreprints/\">pilot phase</a>.</p><p>Dimensions and the Lens both index preprints from a large number of preprint servers across all disciplines. In the case of the Lens, it is important to be aware that some preprints, in particular from arXiv and SSRN, incorrectly have not been assigned the publication type ‘preprint’. Europe PMC also covers a <a href=\"https://europepmc.org/Preprints#preprint-servers\">large number of preprint servers</a>, but due to its focus on the life sciences, it does not index preprints from servers such as arXiv and SSRN (except for COVID-19 preprints). The recently launched <a href=\"https://clarivate.com/webofsciencegroup/support/wos/preprint-citation-index/\">Preprint Citation Index</a> in Web of Science covers <a href=\"https://webofscience.help.clarivate.com/en-us/Content/pre-prints/pre-prints.htm\">five preprint servers</a>: arXiv, bioRxiv, ChemRxiv, medRxiv, and Preprints.org. A number of large preprint servers, including OSF Preprints, Research Square, and SSRN, are not (yet) covered by Web of Science. Scopus covers arXiv, bioRxiv, ChemRxiv, medRxiv, Research Square, SSRN, and TechRxiv. It does not (yet) index preprints from servers such as OSF Preprints and Preprints.org. Moreover, indexing of preprints in Scopus has two significant limitations: Preprints published before 2017 are not indexed, and preprints are not included in the document search feature in Scopus. Preprints are included only in the author profiles that can be found using the author search feature.</p><h2 id=\"challenges-of-indexing-preprints\"><strong>Challenges of indexing preprints</strong></h2><p>Indexing of preprints raises a number of challenges, which are addressed in different ways by the different bibliographic databases. We consider four challenges: version history, links to journal articles, links to peer reviews, and citation links.</p><p>A preprint may have multiple versions. Ideally a bibliographic database should present a version history. This enables users to see when the first version of a preprint was published and when the preprint was last updated. Europe PMC and Web of Science do indeed present version histories. The other databases do not provide this information.</p><p>Many articles are first published on a preprint server and then in a journal. Bibliographic databases should show the link between a preprint and the corresponding journal article. Dimensions, Europe PMC, and Web of Science show these links. The Lens and Scopus do not show them.</p><p>It is increasingly common for preprints to be peer reviewed outside the traditional journal peer review system. <a href=\"https://doi.org/10.1126/science.adg2283\">Peer review of preprints</a> may take place on platforms such as Peer Community In, PeerRef, PREreview, and Review Commons. The reviews are typically made openly available. <a href=\"https://www.coalition-s.org/statement-on-peer-reviewed-publications/\">Several research funders</a> have made a commitment to recognize peer-reviewed preprints in the same way as peer-reviewed journal articles. To support these developments, bibliographic databases should index not only preprints but also peer reviews and should link preprints to the corresponding reviews. None of the databases currently offer this feature. Europe PMC provides links from preprints to peer reviews, but these links refer to external platforms. Europe PMC itself does not index peer reviews. The Lens does index peer reviews, but the reviews are not linked to preprints.</p><p>Citation links represent another challenge. In its citation statistics, Scopus does not include citations given by preprints. The other databases do include such citations. This raises the issue of duplicate citations. When an article has been published both on a preprint server and in a journal, the preprint version of the article and the journal version will typically have a similar or identical reference list. A publication that is cited by the article may then receive two citations, one from the preprint version of the article and one from the journal version. None of the databases deduplicate such citations.</p><h2 id=\"recommendations-for-indexing-preprints\"><strong>Recommendations for indexing preprints</strong></h2><p>In the box below, we present six recommendations for optimizing the indexing of preprints in bibliographic databases. As we will discuss later, implementing these recommendations requires close collaboration between bibliographic databases and other actors in the scholarly publishing system.</p><div class=\"kg-card kg-callout-card kg-callout-card-grey\"><div class=\"kg-callout-emoji\">💡</div><div class=\"kg-callout-text\"><em><strong>Recommendation 1: Cover all relevant preprint servers.</strong></em><br>A bibliographic database should index preprints from all relevant preprint servers. A disciplinary database (e.g., PubMed and Europe PMC) should index preprints from all preprint servers relevant in a particular discipline. A multidisciplinary database (e.g., Dimensions, the Lens, Scopus, and Web of Science) should index preprints from all preprint servers across all disciplines.<br><br><em><strong>Recommendation 2: Provide comprehensive preprint metadata.</strong></em><br>A bibliographic database should provide metadata for preprints that is as comprehensive as metadata for journal articles. The metadata should at least include the title and abstract of a preprint, the names and affiliations of the authors, the reference list, and funding information. It should also include a version history.<br><br><em><strong>Recommendation 3: Provide links between preprints and journal articles.</strong></em><br>If an article has been published both on a preprint server and in a journal, a bibliographic database should provide a link between the preprint and the journal article. The link establishes that the preprint and the journal article are different versions of the same article. The preprint and the journal article belong to the same publication family.<br><br><em><strong>Recommendation 4: Provide links between preprints and peer reviews.</strong></em><br>If a preprint has been peer reviewed and the reviews have been made openly available, a bibliographic database should index the reviews and should provide links between the preprint and the reviews.<br><br><em><strong>Recommendation 5: Provide deduplicated citation links between publication families.</strong></em><br>A bibliographic database should provide deduplicated citation links at the level of publication families. If there are multiple citation links from publications in one publication family (e.g., from a preprint and from a journal article) to publications in another publication family, these citation links should be deduplicated.<br><br><em><strong>Recommendation 6: Do not make arbitrary distinctions between publication types (preprints, journal articles, and others).</strong></em><br>A bibliographic database should not make arbitrary distinctions between preprints, journal articles, and other publication types. A database may inform its users about relevant differences between publications of different types (e.g., whether publications have been peer reviewed or not), but otherwise it should treat all publications in the same way, regardless of their publication type.</div></div><p>The table below summarizes the extent to which different bibliographic databases meet our six recommendations. Two stars are awarded if a database fully meets a recommendation, one star is awarded if a recommendation is partly met, and no stars are awarded if a recommendation is not met at all.</p><figure class=\"kg-card kg-image-card\"><img src=\"https://upstream.force11.org/content/images/2023/02/Screenshot-2023-02-16-at-20.32.37.png\" class=\"kg-image\" alt loading=\"lazy\" width=\"1260\" height=\"817\" srcset=\"https://upstream.force11.org/content/images/size/w600/2023/02/Screenshot-2023-02-16-at-20.32.37.png 600w, https://upstream.force11.org/content/images/size/w1000/2023/02/Screenshot-2023-02-16-at-20.32.37.png 1000w, https://upstream.force11.org/content/images/2023/02/Screenshot-2023-02-16-at-20.32.37.png 1260w\" sizes=\"(min-width: 720px) 720px\"></figure><p>Dimensions, Europe PMC, and the Lens seem to cover all relevant preprint servers, resulting in two stars for the first recommendation. We have awarded one star to Scopus and Web of Science. They still need to work on improving their coverage of preprint servers. Web of Science informed us that in the coming year it expects to substantially increase the number of preprint servers it covers.</p><p>None of the bibliographic databases provide comprehensive preprint metadata. The databases make available basic metadata fields such as the title, abstract, and publication date of a preprint as well as the names of the authors. Sometimes they also provide more advanced metadata fields, for instance the reference list, author affiliations, and funding information, but in many cases these metadata fields are missing. Based on some spot checking, our impression is that each database has its own strengths and weaknesses in terms of the completeness of preprint metadata. For instance, while some databases provide more comprehensive metadata for arXiv preprints, others do a better job for bioRxiv preprints. In general, metadata seems to be more complete for recent preprints than for older ones. Since all databases suffer from gaps in their preprint metadata, we have awarded one star to each of them. As we will discuss below, improving the availability of preprint metadata is a joint responsibility of bibliographic databases and preprint servers.</p><p>The Lens and Scopus do not provide links between preprints and journal articles, although the Lens told us that they are working on providing such links. Dimensions, Europe PMC, and Web of Science do provide links between preprints and journal articles. However, because the links seem to be incomplete, we have awarded only one star to these databases.</p><p>Europe PMC is the only database that provides links from preprints to peer reviews, but it does not index the reviews. We have therefore awarded one star to Europe PMC. We have also awarded one star to the Lens. While the Lens does not provide links between preprints and peer review, it does index reviews in its database.</p><p>The figure below illustrates the idea of deduplicating citation links. There are three publication families, each consisting of a preprint (in green) and a corresponding journal article (in blue). Before deduplication, there are six citation links. After removing duplicate citation links between publication families, only three citation links are left. Of the five bibliographic databases considered in this blog post, none provides deduplicated citation links between publication families. The Lens informed us that they may provide deduplicated links in the future.</p><figure class=\"kg-card kg-image-card\"><img src=\"https://upstream.force11.org/content/images/2023/02/Screenshot-2023-02-16-at-20.34.38.png\" class=\"kg-image\" alt loading=\"lazy\" width=\"1313\" height=\"561\" srcset=\"https://upstream.force11.org/content/images/size/w600/2023/02/Screenshot-2023-02-16-at-20.34.38.png 600w, https://upstream.force11.org/content/images/size/w1000/2023/02/Screenshot-2023-02-16-at-20.34.38.png 1000w, https://upstream.force11.org/content/images/2023/02/Screenshot-2023-02-16-at-20.34.38.png 1313w\" sizes=\"(min-width: 720px) 720px\"></figure><p>Dimensions, Europe PMC, and the Lens treat preprints in the same way as journal articles. They therefore fully meet our sixth recommendation, resulting in two stars. Web of Science makes a sharp distinction between preprints and journal articles by including preprints in a separate Preprint Citation Index and by presenting citation information separately for citations from preprints and citations from journal articles. Moreover, citations from journal articles are shown more prominently than citations from preprints, except in the Preprint Citation Index, where citations from preprints are displayed more prominently. This seems inconsistent and may confuse users. Because of this, we have awarded only one star to Web of Science. Scopus has not been awarded any stars. The document search feature in Scopus enables users to search for journal articles, but not for preprints. This is a highly arbitrary distinction between these two publication types. Scopus also excludes citations from preprints from the citation statistics it provides.</p><p>The above table shows that there is ample room for bibliographic databases to improve their indexing of preprints. Users of bibliographic databases will increasingly be interested in preprints, in addition to journal articles and other more traditional publication types. We advise users interested in preprints to make sure they use a database that serves their needs, and we hope the above table will help them make the right choice.</p><h2 id=\"improving-indexing-of-preprintsthe-need-for-joint-action\"><strong>Improving indexing of preprints - The need for joint action</strong></h2><p>Bibliographic databases are part of a larger ecosystem of infrastructures for scholarly publishing. To allow bibliographic databases to improve their indexing of preprints, other actors in this ecosystem also need to take action.</p><p>First of all, preprint servers need to make available as much preprint metadata as possible. Most preprint servers register DOIs for preprints at Crossref. This enables them to make preprint metadata available by depositing the metadata to Crossref. Preprint servers are indeed submitting metadata to Crossref, but there is still <a href=\"https://doi.org/10.31222/osf.io/smxe5\">considerable room for improvement</a>. Metadata submitted to Crossref can be harvested by bibliographic databases, helping them to provide comprehensive metadata for the preprints they index. One database, Scopus, informed us that to obtain high-quality preprint metadata it needs to scrape the metadata from the websites of preprint servers. In a well-organized infrastructure ecosystem, there should be no need for web scraping.</p><p>Second, <a href=\"https://scholarlykitchen.sspnet.org/2022/06/07/building-stronger-chains-together-keeping-preprints-connected-to-the-scholarly-record/\">journal publishers need to add links</a> from the articles they publish in their journals to the corresponding preprints. These links can be included in the article metadata that publishers deposit to Crossref. Unfortunately, with a few exceptions (Copernicus, eLife), <a href=\"https://doi.org/10.5281/zenodo.6633157\">publishers are doing a poor job</a> in linking journal articles to preprints. Publishers need to work together with the providers of manuscript submission systems (Editorial Manager, Open Journal Systems, ScholarOne, etc.) to improve this.</p><p>Third, preprint servers and peer review platforms need to work together to allow bibliographic databases to harvest links between preprints and peer reviews. Ideally, each peer review should have <a href=\"https://www.leidenmadtrics.nl/articles/the-growth-of-open-peer-review\">its own DOI</a>, and peer review platforms should include links from peer reviews to the corresponding preprints in the metadata they submit to the DOI registration agency (Crossref, DataCite). For peer reviews without a DOI, other ongoing infrastructure initiatives, in particular the <a href=\"https://www.coar-repositories.org/notify/\">COAR Notify Initiative</a>, <a href=\"https://docmaps.knowledgefutures.org/pub/eyp3ckeo/release/1\">DocMaps</a>, and <a href=\"https://sciety.org/\">Sciety</a>, offer promising approaches for linking preprints and peer reviews.</p><h2 id=\"outlook\"><strong>Outlook</strong></h2><p>Without doubt, the adoption of preprinting will continue to increase in the coming years. Preprint peer review will also grow in importance, especially in the life sciences. As a result of the ongoing transition toward a culture of open science, researchers will increasingly share their work in an early stage, prior to peer review. Sharing intermediate results, such as research plans (preregistration), will also become more common. In addition, the boundaries between different types of publications will get increasingly blurry. For instance, eLife, Peer Community In, and the various F1000 platforms essentially represent hybrids of preprinting and traditional journal publishing. Their popularity will make the distinction between preprints and journal articles more and more fuzzy.</p><p>To keep up with these developments, bibliographic databases need to innovate. This is the case in particular for Scopus and Web of Science, the two oldest databases. Scopus has a <a href=\"https://www.elsevier.com/solutions/scopus/how-scopus-works/content/scopus-content-selection-and-advisory-board\">selective coverage policy</a>. The same applies to the <a href=\"https://clarivate.com/products/scientific-and-academic-research/research-discovery-and-workflow-solutions/web-of-science/core-collection/editorial-selection-process/\">Core Collection</a> of Web of Science. Rather than trying to cover as many journals as possible, these databases cover only journals that are considered to meet certain quality standards. This philosophy of selectivity is difficult to maintain in a world in which sharing of non-peer-reviewed research results is not only becoming more accepted, but is even gradually becoming the norm. It seems essential for Scopus and Web of Science to work toward providing a more comprehensive coverage of the scholarly literature. Indexing of preprints is an important step in this direction.</p><p>We expect users of bibliographic databases to increasingly move away from the idea that a database should filter the scholarly literature for them by indexing only high-quality content. Users will instead expect a database to offer tools that allow them to filter the literature themselves. This means that bibliographic databases need to provide a comprehensive coverage of the literature and need to help users answer questions such as: Does this publication present the final results of a research project or does it report provisional intermediate findings? And what kinds of quality checks has the publication undergone? Has it been peer reviewed? And if so, are the peer reviews openly available? Or is there other information available about the nature of the peer review process? And have data and code underlying the publication been made openly available? Enabling users to obtain the best possible answers to these types of questions is the new holy grail for bibliographic databases.</p><hr><p><em>We thank Dimensions, Europe PMC, the Lens, Scopus, and Web of Science for their feedback on a draft version of this blog post. We are also grateful to Iratxe Puebla, Martyn Rittman, and several colleagues at the Centre for Science and Technology Studies (CWTS), Leiden University for their feedback.</em></p><p><em>EDIT [2023-02-21]: Some minor remarks were added regarding the Lens (they're adding preprint links and may provide deduplicated links).</em></p> "},{"id":"https://doi.org/10.54900/btrdtvc-cjjn94g","title":"Scholarly Infrastructure: a Latin American perspective","link":"https://doi.org/10.54900/btrdtvc-cjjn94g","published":"2023-02-07T16:08:41.000+00:00","description":"Infrastructure: what’s at stakeInfrastructure often is perceived as a “given”, as something that was always there, as “natural”. In the digital age, infrastructure seems more “natural” than ever (it's hard to...","isPermalink":true,"tags":["Thought Pieces"],"authors":[{"name":"Carolina Tanigushi","url":null},{"name":"Gabi Mejias","url":"https://orcid.org/0000-0002-1598-7181"}],"image":"https://images.unsplash.com/photo-1563126171-fa019bbbfa18?crop&#x3D;entropy&cs&#x3D;tinysrgb&fit&#x3D;max&fm&#x3D;jpg&ixid&#x3D;MnwxMTc3M3wwfDF8c2VhcmNofDF8fHNvdXRoJTIwYW1lcmljYXxlbnwwfHx8fDE2NzU3ODY2MjM&ixlib&#x3D;rb-4.0.3&q&#x3D;80&w&#x3D;2000","modified":"2023-02-27T08:34:34.000+00:00","contentHtml":" <h3 id=\"infrastructure-what%E2%80%99s-at-stake\">Infrastructure: what’s at stake<br></h3><p>Infrastructure often is perceived as a “given”, as something that was always there, as “natural”. In the digital age, infrastructure seems more “natural” than ever (it's hard to imagine there was a time without internet connectivity in our mobile phones or even a time when phone lines were a luxury item) and the social and economic dimension of infrastructure tend to be invisibilized and are left out of discussion. </p><p>Another challenge around infrastructure is that if well functioning  it tends to be forgotten, despite the big amount of resources and commitment invested on its maintenance. Academic knowledge production infrastructure gathers very low interest in the public debate (<a href=\"https://qz.com/2116375/covid-has-deepened-the-wests-monopoly-of-science-publishing\">except during times of crisis!</a>) even if it serves society as a whole. It is this invisibilization that puts infrastructure permanently at risk, especially under the neoliberalist paradigm.</p><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img src=\"https://upstream.force11.org/content/images/2023/02/Cuesta_de_Lipa-n-_RN52-_Jujuy-_Argentina_-_panoramio-1.jpeg\" class=\"kg-image\" alt loading=\"lazy\" width=\"640\" height=\"480\" srcset=\"https://upstream.force11.org/content/images/size/w600/2023/02/Cuesta_de_Lipa-n-_RN52-_Jujuy-_Argentina_-_panoramio-1.jpeg 600w, https://upstream.force11.org/content/images/2023/02/Cuesta_de_Lipa-n-_RN52-_Jujuy-_Argentina_-_panoramio-1.jpeg 640w\"><figcaption>Credit:<a href=\"https://web.archive.org/web/20161111160258/http://www.panoramio.com/user/5148983?with_photo_id=48047173\"> rodoluca</a>, WikimediaCommons. <a href=\"https://commons.wikimedia.org/wiki/File:Cuesta_de_Lip%C3%A1n,_RN52,_Jujuy,_Argentina_-_panoramio.jpg\">This file</a> is published under the <a href=\"https://en.wikipedia.org/wiki/en:Creative_Commons\">Creative_Commons</a><a href=\"https://creativecommons.org/licenses/by-sa/3.0/deed.en\">Attribution-Share Alike 3.0 Unported</a> license.</figcaption></figure><p>In scholarly communications, knowledge dissemination and infrastructure are complexly intertwined. Over the last 40 years, large commercial publishers have increased their control of the scientific output (<a href=\"https://doi.org/10.1371/journal.pone.0127502\">according to a study</a> by Vincent Larivière, Stefanie Haustein and Philippe Mongeon ten years ago the five most prolific commercial publishers accounted for more than 50% of all papers published) and this trend has been intensified by the digitization of research.<br></p><p>In the last decade, the biggest commercial publishers have been acquiring infrastructure services by implementing economic convergence  through horizontal  <a href=\"https://publishingperspectives.com/2021/01/exclusive-wiley-hindawi-acquisition-jay-flynn-interview-covid19/\">(when a company acquires competitor companies)</a>  or vertical integration (<a href=\"https://librarytechnology.org/mergers/elsevier/\">when a company acquires vendors, suppliers or other related companies within the same industry/sector</a>) strategies. This behavior has both economic and political consequences.  <br></p><p>These commercial publishers have moved from publishing to also owning vendor systems such as submission and journal management systems, repositories, current research information systems (CRIS), faculty information systems (FIS), funders systems, and beyond in a move that can be called “appetite for acquisition”. This has several effects and poses many concerns across the research life cycle: increasing dependence by researchers and institutions, lack of competition from smaller organizations offering services, resulting in loss of community involvement and control across knowledge production and its communication. </p><p><a href=\"http://knowledgegap.org/index.php/sub-projects/rent-seeking-and-financialization-of-the-academic-publishing-industry/preliminary-findings/\">Alejandro Posada and George Chen have studied and analyzed how Elsevier’s augmented influence on infrastructure leads to an increase of inequality in knowledge production on a global scale</a>, and that “this is particularly challenging for researchers in the global south whose methodology and epistemological approach does not align with mainstream models of research production and evaluation”. </p><p>With the digitization of scholarship and the rise of the open research movement, new models and outputs of science communication have emerged  beyond the journal article. Scholarly communications is shifting towards the “record of versions”, rather than just a One True “version of record”, where persistent identifiers and their metadata enable recognition, linking and discoverability of a wide range of outputs regardless of where those are housed. It is worth noting the importance of infrastructure in connecting all outputs and resources throughout the research lifecycle (such as research data, software, samples, etc.) to better understand and evaluate the contributions to research, and support their recognition. Many of the organizations providing this kind of foundational infrastructure have been established as non profit community governed and sustained initiatives (Crossref, DataCite, ROR), and are committed to the <a href=\"https://openscholarlyinfrastructure.org/\">Principles of Open Scholarly Infrastructure.</a></p><h3 id=\"the-latin-american-perspective\">The Latin American perspective<br></h3><p>Over the past few years, the open science movement has emerged with such strength that it’s pushing publishers to change their strategies and business models, the decline from the subscription based model and the transition from the pay to publish model (vs the former “pay to read” model) being some of the most notorious examples. While many have received initiatives like<a href=\"https://www.leru.org/news/plans-positive-action-combined-with-positive-thinking-delivers-success\"> Plan S as a positive action to accelerate the transition to open access</a>, beyond the Global North <a href=\"https://blogs.lse.ac.uk/impactofsocialsciences/2019/08/08/amelica-before-plan-s-the-latin-american-initiative-to-develop-a-cooperative-non-commercial-academic-led-system-of-scholarly-communication/\">some voices have emerged to question these measures as progress</a>.</p><p>Do article processing charges (APCs) and transformative agreements promote openness or strengthen the current status quo? Many then have turned “South” and started looking at “alternative” models that aren’t dependent on commercial publishers and for-profit service providers.</p><figure class=\"kg-card kg-embed-card kg-card-hascaption\"><blockquote class=\"twitter-tweet\"><p lang=\"es\" dir=\"ltr\">ESTE DÍA QUEDARÁ EN LA HISTORIA DEL FÚTBOL MUNDIAL. 🇦🇷❤️<a href=\"https://t.co/CrwtkaUOVh\">pic.twitter.com/CrwtkaUOVh</a></p>&mdash; Ataque Futbolero (@AtaqueFutbolero) <a href=\"https://twitter.com/AtaqueFutbolero/status/1605247147229716483?ref_src=twsrc%5Etfw\">December 20, 2022</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<figcaption>The importance of infrastructure, graphical description</figcaption></figure><p>Opposite to what happens in the Global North, in Latin America open access is not an “alternative” model but has long been mainstream. <a href=\"https://en.wikiversity.org/wiki/Open_Access_in_Latin_America\">We have a long-term history of Open Access</a> without APCs and are publicly funded. There are few reasons for this, one of which being <a href=\"https://blog.scielo.org/en/2015/11/13/predatory-journals-the-dark-side-of-open-access/#.Y3PqVezMI-Q\">the high cost of journal subscriptions in the 90s, which worked as a big motivator for the creation of free to access/publish electronic journals</a>.</p><p>Despite this Latin American open access tradition, in countries like Colombia, APC payments are increasing. Many <a href=\"https://www.nature.com/articles/d41586-022-03201-w\">voices</a> in the community argue that transformative agreements might threaten the current local ecosystem as the more funds that are allocated for APCs diminish the investment in shared infrastructure and tools.</p><p>When it comes to infrastructure, just being open might not be enough; operating infrastructure is not simple and requires investment, capacity building, maintenance, and dedicated staff committed that can ensure accessible, inclusive, and responsive tools. Resilience and sustainability are very sizable challenges that need to be addressed via governance.</p><p>This is part of the reason why using infrastructure from private vendors can be sometimes appealing. There's an ease to it and of course there’s a price to this, both in the literal and in the <a href=\"https://investinopen.org/blog/take-action-to-stop-the-lock-up-of-research-and-learning/\">surveillance-capitalism sense</a>.</p><p>A local solution in Latin America for this has been to have independent and self-sustainable organizations that not only publish research results but also fill a role in offering infrastructure and innovation options, training to improve research publishing and dissemination practices, allowing local communities to operate according to the state of the art in scholarly communications, such as SciELO (established in 1998 and <a href=\"https://25.scielo.org/\">celebrating its 25th anniversary with an international conference this year</a>), Redalyc (2002), La Referencia (2010).</p><p>These types of initiatives are usually built with government funding, whether that’s directly or indirectly. In the end, one of their main contributions is to enable scaling, ensuring resilience and independence from economically exploitative practices — more importantly it’s about putting local communities and networks in the center and giving them control of the knowledge they produce.</p><p>In the end, open goes beyond access and  it’s indispensable for our community to question and rethink the ownership and diversity of research infrastructure. There is an urgent need to reclaim scholarly infrastructure if we want to pursue the benefit of the majority instead of the profit of few. There are many ways to play a more proactive role in steering research infrastructure: (choosing and) using open community-led infrastructure and services, through institutional membership, sharing use cases and feedback for improvement, participating in governance and working groups and more. </p><p>Within this framework we want to introduce a series of interviews to showcase Latin American actors driving non-commercial community-driven infrastructure for the region. Stay tuned!</p><hr><p><em>DISCLAIMER: the authors of this interview series work at DataCite and SciELO, respectively, the opinions expressed in this post are their own and don’t necessarily represent those of their employers.</em></p> "},{"id":"https://doi.org/10.54900/bj4g7p2-2f0fn9b","title":"The Rogue Scholar: An Archive for Scholarly blogs","link":"https://doi.org/10.54900/bj4g7p2-2f0fn9b","published":"2023-01-31T17:02:40.000+00:00","description":"Digital object identifiers (DOIs) and relevant metadata have been used for 20 years to help preserve the scholarly record by maintaining stable links to scholarly publications and other important scholarly...","isPermalink":true,"tags":["News"],"authors":[{"name":"Martin Fenner","url":"https://orcid.org/0000-0003-1419-2405"}],"image":"https://images.unsplash.com/photo-1528590005476-4f5a6f2bdd9e?crop&#x3D;entropy&cs&#x3D;tinysrgb&fit&#x3D;max&fm&#x3D;jpg&ixid&#x3D;MnwxMTc3M3wwfDF8c2VhcmNofDV8fHJlY29yZHxlbnwwfHx8fDE2NzUxNzg3Mjk&ixlib&#x3D;rb-4.0.3&q&#x3D;80&w&#x3D;2000","modified":"2023-01-31T17:02:40.000+00:00","contentHtml":" <p>Digital object identifiers (DOIs) and relevant metadata have been used for 20 years to help preserve the scholarly record by maintaining stable links to scholarly publications and other important scholarly resources, combined with long-term archiving by publishers and libraries. Lots and tools and services have been built around this infrastructure to make it easier for scholars to consume and contribute to this scholarly record.</p><p>Science Blogs have also been around for more than 20 years, but in all that time have not really become a formal part of the scholarly record. If you are old enough to remember them, you can think of science blogs as the compact cassette next to the single or LP – giving users an affordable alternative to buying a record, enabling listening to music on the go, and enabling creative remixing of content in that quintessential product of the 1980s and 1990s, the mixtape.</p><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img src=\"https://images.unsplash.com/photo-1654829725133-3d694a1675ca?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=MnwxMTc3M3wwfDF8c2VhcmNofDd8fG1peHRhcGV8ZW58MHx8fHwxNjc1MTc5NTAx&ixlib=rb-4.0.3&q=80&w=2000\" class=\"kg-image\" alt loading=\"lazy\" width=\"6000\" height=\"4000\" srcset=\"https://images.unsplash.com/photo-1654829725133-3d694a1675ca?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=MnwxMTc3M3wwfDF8c2VhcmNofDd8fG1peHRhcGV8ZW58MHx8fHwxNjc1MTc5NTAx&ixlib=rb-4.0.3&q=80&w=600 600w, https://images.unsplash.com/photo-1654829725133-3d694a1675ca?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=MnwxMTc3M3wwfDF8c2VhcmNofDd8fG1peHRhcGV8ZW58MHx8fHwxNjc1MTc5NTAx&ixlib=rb-4.0.3&q=80&w=1000 1000w, https://images.unsplash.com/photo-1654829725133-3d694a1675ca?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=MnwxMTc3M3wwfDF8c2VhcmNofDd8fG1peHRhcGV8ZW58MHx8fHwxNjc1MTc5NTAx&ixlib=rb-4.0.3&q=80&w=1600 1600w, https://images.unsplash.com/photo-1654829725133-3d694a1675ca?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=MnwxMTc3M3wwfDF8c2VhcmNofDd8fG1peHRhcGV8ZW58MHx8fHwxNjc1MTc5NTAx&ixlib=rb-4.0.3&q=80&w=2400 2400w\" sizes=\"(min-width: 720px) 720px\"><figcaption>Photo by <a href=\"https://unsplash.com/@bdilla810?utm_source=ghost&utm_medium=referral&utm_campaign=api-credit\">Bruno Guerrero</a> / <a href=\"https://unsplash.com/?utm_source=ghost&utm_medium=referral&utm_campaign=api-credit\">Unsplash</a></figcaption></figure><p>The strengths of science blogs are that they are easy and affordable to set up, allow experimentation in content and format (e.g. as a podcast), and are very fast in publishing content to your audience.</p><p>Science blog very nicely complement other emerging Open Science content types such as research data, software, computational notebooks, and preprints. They can highlight interesting research or important policy developments, help report from conferences, and can also work to publish primary research.</p><h3 id=\"is-there-a-way-to-combine-the-strengths-of-science-blogs-with-the-more-traditional-ways-of-publishing-science-what-if-we-add-what-is-missing-but-keep-what-works-well\">Is there a way to combine the strengths of science blogs with the more traditional ways of publishing science? What if we add what is missing but keep what works well?</h3><p>This is what I have started doing a few months ago starting work on <a href=\"https://rogue-scholar.org\">the Rogue Scholar,</a> an archive for science blogs that</p><ul><li>provides a long-term archive for science blog posts,</li><li>makes the full-text of blog posts searchable in a central search index,</li><li>assigns DOIs and metadata to these blog posts that are propagated to other infrastructure, and</li><li>make the content is free to submit and read (with <a href=\"https://rogue-scholar.org/#pricing\">caveats</a>).</li></ul><p>The Rogue Scholar will use the Open Source repository software <a href=\"https://inveniosoftware.org/products/rdm/\">InvenioRDM</a> (where I am contributing to the development) to achieve this, and will launch in the second quarter of 2023. Reach out to me via the Rogue Scholar website or email if you have questions or comments. </p><p>From the initial feedback and research I noticed particular interest from personal science blogs and from English-language blogs and unsurprisingly found that Wordpress is the most popular platform for science blogs. I also found a small number of science blogs (including the Upstream blog) that use DOIs, and a number of science blogging platforms such as <a href=\"https://hypotheses.org/\">Hypotheses</a>, <a href=\"https://occamstypewriter.org/\">Occam's Typewriter</a> and <a href=\"https://scilogs.spektrum.de/\">Scilogs.de</a>. And lots and lots of interesting content that deserves to be made easier to discover and preserved.</p> "},{"id":"https://doi.org/10.54900/ebw4ce4-47p2tbr","title":"Setting the Scene: How Artificial Intelligence is reshaping how we consume and deliver research","link":"https://doi.org/10.54900/ebw4ce4-47p2tbr","published":"2023-01-24T13:18:29.000+00:00","description":"Since its release towards the end of 2022, ChatGPT has been dominating the majority of AI-related conversations on social media. One could almost say it has made AI more mainstream and accessible than ever....","isPermalink":true,"tags":["Thought Pieces"],"authors":[{"name":"Saikiran Chandha","url":null},{"name":"Sucheth R","url":null},{"name":"Tirthankar Ghosal","url":null}],"image":"https://upstream.force11.org/content/images/2023/01/Untitled-4.png","modified":"2023-01-30T08:33:28.000+00:00","contentHtml":" <p>Since its release towards the end of 2022, <a href=\"https://openai.com/blog/chatgpt/\">ChatGPT</a> has been dominating the majority of AI-related <a href=\"https://au.news.yahoo.com/the-mind-blowing-trend-taking-over-the-internet-what-is-chat-gpt-071241981.html\">conversations on social media</a>. One could almost say it has made AI more mainstream and accessible than ever. AI is quickly revolutionizing the modern-day research landscape. According to a CSIRO report, nearly <a href=\"https://www.csiro.au/en/news/news-releases/2022/landmark-report-analyses-the-impact-of-ai-on-science\">98%</a> of scientific fields use AI in some way. The possibilities are endless, with these state-of-the-art AI technologies becoming more and more accessible.</p><p>AI tools are gradually making inroads into the research ecosystem. From breaking down research papers to make them more comprehensible and auto-completing academic essays to accurately predicting 3D models of protein structures, AI is streamlining multiple aspects of scholarly pursuit. In short, it can dramatically reduce the time researchers invest in routine tasks, giving them more time to think, focus on data and analysis, synthesize their thoughts, and make inferences<em>.</em></p><p><em>This blog post is part of a series on how AI is reshaping the research landscape. In the first part, we will set the scene by examining the different ways AI applications are currently used in consuming and delivering research.</em></p><h2 id=\"1-knowledge-discovery-getting-through-papers-faster\"><strong>1. Knowledge discovery: Getting through papers faster</strong></h2><figure class=\"kg-card kg-image-card\"><img src=\"https://upstream.force11.org/content/images/2023/01/Untitled.png\" class=\"kg-image\" alt loading=\"lazy\" width=\"1024\" height=\"1024\" srcset=\"https://upstream.force11.org/content/images/size/w600/2023/01/Untitled.png 600w, https://upstream.force11.org/content/images/size/w1000/2023/01/Untitled.png 1000w, https://upstream.force11.org/content/images/2023/01/Untitled.png 1024w\" sizes=\"(min-width: 720px) 720px\"></figure><p>Gathering valuable insights from the sea of scientific manuscripts can be a daunting task. Given the sheer number of papers published each year — with close to <a href=\"https://www.stm-assoc.org/2018_10_04_STM_Report_2018.pdf\">2.4 million</a> annually — finding relevant papers and distilling critical insights from them is almost like finding a needle in a haystack.</p><p>It's a challenging feat for any researcher as there will always be unfamiliar terms, concepts, theories, and equations to cross-reference to understand the paper thoroughly. Plus, there may be questions that one would have to look up separately while making the connections between concepts. The difficulty further increases if you are a non-English speaker since <a href=\"https://www.jbe-platform.com/content/journals/10.1075/aila.20.06ham\">three-quarters</a> of science and humanities papers are written in English.</p><p>Fortunately, we now have AI-powered research reading tools that can help us navigate the vast array of papers and make sense of their content. <a href=\"https://typeset.io/\">SciSpace Copilot</a> is one such tool. It helps to read and understand articles better by providing explanations for scientific texts and math, including follow-up questions for more detailed answers in multiple languages. <a href=\"https://elicit.org/\">Elicit</a> allows researchers to access relevant papers with summarized takeaways. <a href=\"https://www.system.com/graph\">System</a> is an open data resource that combines peer-reviewed articles, datasets, and models to help you understand the relationship between any two things in the world.</p><p>The <a href=\"https://theresanaiforthat.com/\">list</a> is growing, with more coming up every day. These tools aim to help researchers and science practitioners extract critical information and required context from research papers faster.</p><h2 id=\"2-communication-enhancement-articulating-yourself-better\"><strong>2. Communication enhancement: Articulating yourself better</strong></h2><figure class=\"kg-card kg-image-card\"><img src=\"https://lh4.googleusercontent.com/RSc-e1rz2-LQTKumGP18084nTf-boFpdJz8t3M5G1rNOXKQlXSMBF42aKthmpJkyc2oltyjVYAgNxqI2PofcfIWCtMyT-6WPFfiBUQGZhZxWzD1PiraTwfXywG3_UR2hU6CVQfx02luSHIFQn2lQ1nlcBeZo226Ci9LLqLt164h5tj1jNAWM4OjBevmrZQ\" class=\"kg-image\" alt loading=\"lazy\" width=\"349\" height=\"349\"></figure><p>Writing grant applications can take up a substantial amount of time, even for the most accomplished researchers. Some report that up to <a href=\"https://acquisitiontalk.com/2021/12/top-researchers-spend-50-of-their-time-writing-grants-how-to-fix-it-and-what-it-means-for-dod/\">50%</a> of their time is dedicated to this process. On top of this, you have papers, emails, conference presentations, and even social media posts to write to disseminate your findings and make your research visible. While this is an important activity for advancing research, it is eating into the time you would spend refining your research and honing your analysis.</p><p>Generative AI model-based writing tools are tackling this challenge. <a href=\"https://www.scientificamerican.com/article/we-asked-gpt-3-to-write-an-academic-paper-about-itself-mdash-then-we-tried-to-get-it-published/\">A researcher used GPT-3, a large language model, to write an academic paper</a> — complete with references. While it is probably not a good idea to use AI to write the whole piece, one can use it to bootstrap, explore different angles, and improve the content's tone, structure, and flow.</p><p><a href=\"https://lex.page/\">Lex</a> is a word processor like Google Docs but interactive and AI-powered. <a href=\"https://x.writefull.com/\">Writefull X</a> is an AI-powered writing application tailored to academia. Both help lighten the load, allowing you to focus on sharing your research findings rather than stressing about the actual writing.</p><h2 id=\"3-data-analysis-acceleration-making-sense-of-data-faster\"><strong>3. Data analysis acceleration: Making sense of data faster</strong></h2><figure class=\"kg-card kg-image-card\"><img src=\"https://lh3.googleusercontent.com/Vw2tpmn9OBLaBfrbRNjSgxMVwN_UX3c2t06Yxu58dSkVGU6NZ0oZmBJA-dqPHUeaoDD-9E4Z65IX2lgoSFpu-oqWL5gJVf4U_pQHTDaIgq9WLIe2AGRHh8psQN_eiRj7OL9XMinC9-lXDyku1QXZA53jcf0qKAsfcDkWDqy0H2iWYmu10vVijeKY-2tiyg\" class=\"kg-image\" alt loading=\"lazy\" width=\"349\" height=\"349\"></figure><p>You can only analyze data when it is cleaned and organized. It means spending hours manually sorting and categorizing your data, which can be tedious, especially when dealing with large volumes of unprocessed data. On top of that, you might have to learn to use spreadsheet software and databases and, in some cases, coding languages like Python or R.</p><p>Thankfully, advancements in AI have made it possible to make sense of data faster and with less human effort. A wide range of AI tools that are currently available could help you each step of the way, from data extraction to data visualization and even predictive analysis.</p><p>Starting with AI-based <a href=\"https://excelformulabot.com/\">spreadsheet bots</a> that turn your instructions in natural language into a spreadsheet formula. So, suppose you want to find out the total number of survey respondents who answered 'yes' to a question in the age bracket 16-25. In that case, you could type the same (with column numbers), and the spreadsheet bot will create the formula to give you the answer you need. If you want to visualize the data, you have platforms like <a href=\"https://www.olli.ai/\">Olli</a> that help you create line charts, bar graphs, and scatter plots by simply describing what you want.</p><p>It doesn't end there. <a href=\"https://openai.com/blog/openai-codex/\">OpenAI Codex</a> is an AI model that translates natural language into code. This has been used to build <a href=\"https://github.com/features/copilot\">GitHub's AI coding assistant</a>, which gives you code suggestions in real-time, right from your editor. An MIT-based <a href=\"https://www.pnas.org/doi/epdf/10.1073/pnas.2123433119\">study</a> revealed that you could use this model to solve university-level math problems consistently.</p><p>There are also AI-driven data analysis tools out there, like <a href=\"https://www.uselookup.com/\">Lookup</a>. You can upload the data, ask questions in plain English, and get answers quickly without learning complicated query languages or figuring out how various tables connect.</p><h2 id=\"4-publishing-efficiency-expediting-the-workflow\"><strong>4. Publishing efficiency: Expediting the workflow</strong></h2><figure class=\"kg-card kg-image-card\"><img src=\"https://lh5.googleusercontent.com/P8IgWv_QqiWansmI1Ad_h0E9vt0OGfa7xZ7bVO0M261hlQJoVRmw5YNoCVztFNv7E3UXFy1kVE4EAfWbdSgatu2xm93-AwuB1w7KZcLJ0Bm9GGuULm0GM2FRkCxbWedT6xByos8lhfsaP6RJhp_Qp6Sm_wRzhhQEzxU2nKS5IDgfsMDQ0_umvYJr1z9IuQ\" class=\"kg-image\" alt loading=\"lazy\" width=\"392\" height=\"392\"></figure><p>Getting a scholarly manuscript published is, again, a tedious process, with formatting, editing, proofreading, and the all-important peer-review cycle. On the one hand, you have authors spending <a href=\"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0223116\">52 hours</a> a year on average on formatting. On the other, journals reject around <a href=\"https://publons.com/static/Publons-Global-State-Of-Peer-Review-2018.pdf\">75%</a> of manuscript submissions before they even reach the peer review stage. These numbers indicate that there is room for improvement in the publishing workflow.<br><br>Integrating AI tools by both authors and publishers can streamline this process. On the author's side, AI-based solutions like <a href=\"https://www.grammarly.com/\">Grammarly</a>, Lex, <a href=\"https://www.turnitin.com/\">Turnitin</a>, and Writefull automate formatting, referencing, plagiarism checking, and grammar checks.</p><p>Journal publishers are also turning to AI to streamline the review process. For instance, American Association for Cancer Research (AACR) uses Proofig to <a href=\"https://www.nature.com/articles/d41586-021-03807-6\">verify the authenticity of images</a> in submissions sent to their journals. <a href=\"https://insights.uksg.org/articles/10.1629/uksg.460/\">Springer Nature adopted UNSILO</a>, an AI-based platform, to identify links across eleven million published journal articles, enabling them to find related articles quickly. <a href=\"https://www.penelope.ai/\">Penelope.ai</a> is another AI-based tool that helps ensure that manuscripts meet a journal's requirements by quickly analyzing references and structure. AI is also being used for <a href=\"http://blogs.biomedcentral.com/bmcblog/2016/05/23/peerless-review-automating-methodological-statistical-review/\">fact-checking</a>. The potential for AI to optimize the journal publishing process is immense.</p><h2 id=\"final-thoughts\"><strong>Final thoughts</strong></h2><p>AI models hold tremendous potential for the scientific research community. At the same time, there are serious concerns about employing such technology, ranging from plagiarism and ethical issues to the potential for <a href=\"https://www.vox.com/future-perfect/22672414/ai-artificial-intelligence-gpt-3-bias-muslim\">replicating human biases</a>, <a href=\"https://www.grid.news/story/science/2022/12/09/artificially-unintelligent-an-ai-search-engine-for-science-spits-out-climate-denialism-and-covid-misinformation/\">spreading false information</a>, and <a href=\"https://www.nature.com/articles/d41586-021-02134-0\">ethics violations</a>. Research teams and other stakeholders must join forces to guarantee that Artificial Intelligence-driven research systems are responsibly constructed and used.</p><p>AI is still evolving, and expecting it to always produce reliable results is unrealistic. After all, it's only been around five years since the release of <a href=\"https://typeset.io/papers/attention-is-all-you-need-1hodz0wcqb\">Attention is all you need</a>, a groundbreaking paper that introduced Transformer — an NLP model considered the foundation of many of today's AI models. Fortunately, the early signs of progress are encouraging, and continued developments are anticipated. We could expect better generation capability and factual consistency from the Large Language Models in the near future.</p><p>Even so, AI can still create inaccurate output. So, when employing AI in your workflow, ensure to double-check all outcomes before relying on them.</p><p><em>In the next edition of this series, we will look at how AI is helping researchers overcome language barriers. Stay tuned! Thanks for your time in reading this post. Please feel free to contact us at saikiran@scispace.com, for any questions or thoughts. All the images in this post are created with Text2Image AI tool DALL·E 2</em></p> "},{"id":"https://doi.org/10.54900/8d7emer-rm2pg72","title":"eLife Reviewed Preprints: Interview with Fiona Hutton","link":"https://doi.org/10.54900/8d7emer-rm2pg72","published":"2022-11-15T10:29:38.000+00:00","description":"In October, the journal eLife announced that it will change how it handles peer review starting January 2023:From next year, eLife is eliminating accept/reject decisions after peer review, instead focusing on...","isPermalink":true,"tags":["Interviews"],"authors":[{"name":"Fiona Hutton","url":"https://orcid.org/0000-0002-9707-2988"},{"name":"Martin Fenner","url":"https://orcid.org/0000-0003-1419-2405"}],"image":"https://upstream.force11.org/content/images/2022/11/fiona_hutton-2.jpg","modified":"2023-01-11T22:58:48.000+00:00","contentHtml":" <p>In October, the journal eLife <a href=\"https://elifesciences.org/inside-elife/54d63486/elife-s-new-model-changing-the-way-you-share-your-research\">announced</a> that it will change how it handles peer review starting January 2023:</p><blockquote>From next year, eLife is eliminating accept/reject decisions after peer review, instead focusing on public reviews and assessments of preprints.</blockquote><p>To better understand what this change means for authors and reviewers, Upstream editor Martin Fenner asked Fiona Hutton, eLife's Head of Publishing, a few questions.</p><p><strong><strong><strong>Can you briefly explain eLIfe’s new publishing model announced in October?</strong></strong> </strong>eLife will be posting Reviewed Preprints (submitted preprints, alongside public peer review and an eLife <a href=\"https://elifesciences.org/inside-elife/db24dd46/elife-s-new-model-what-is-an-elife-assessment\">assessment</a>) on the eLife website; these Reviewed Preprints will contain a DOI and eLife citation.  The eLife assessment details the reviewers’ and editors’ thoughts on the significance of the research and the strength of the evidence supporting the paper’s conclusions. These assessments will use common terminology that will be consistent for all articles in the journal that are assessed and the authors will be able to include a response to the assessment and reviews. We are also removing the binary accept/reject decision after peer review, with the focus now being on the public peer review and assessment of individual manuscripts. The author can then choose to revise their paper and receive updated reviews and/or an updated assessment, or choose to make their article the final version (Version of Record) with the original reviews and assessment. Authors will go through the new model in early 2023, and the publication fee will be reduced from $3,000 to $2,000.</p><p><strong><strong><strong>What has been the feedback so far?</strong></strong> </strong>We have had a huge amount of positive support for this model, from authors, funders, institutions and open science advocates. Many believe that although many organisations signed <a href=\"https://sfdora.org/read/\">DORA</a>, there has been a lack of movement and innovation in making those promises a reality and they see what we are doing as ground-breaking. Many are frustrated at the inertia in the current system and, at almost every open science event, everyone says the system is broken and we need an alternative. What we are doing at eLife is creating an alternative publishing model and providing an alternative output that can be used in research assessment. We are convinced that others will take up this model over time. Of course, we also know the current system is ingrained and that change can be difficult and cannot happen without strong support – we are in the fortunate position where our board is made up of funders that want the system to change and support eLife to lead that change. We also acknowledge that some people do not like or do not agree with the model and do not see the benefit of it. Instead of making judgements about a research paper based on the journal it was published in, we are asking the community to consider the substance of our reviews and editorial judgement, and that is a considerable step-change. It is the responsibility of eLife to show that the model can work and that there is a huge amount of value in it – and that’s where our priorities will be over the coming months.</p><p><strong><strong><strong>What are the main problems you want to solve with this change?</strong></strong> </strong>No one that supports science as an endeavour (including journal publishers), thinks that where something gets published is more important than what has been published, especially when getting into particular journals can often be the result of bias or chance. But where you get published has a huge influence on your academic research career and although there are a number of initiatives to try and address this problem, journal titles are often the quickest route to judge a candidate as part of any research assessment. If eLife can provide an alternate route so that the research is assessed on its individual merit (via a Reviewed Preprint and eLife assessment), rather than where it is published, and that output can be used as currency in research assessment, then we can focus on the production of genuinely impactful science. But there are other benefits – the existing publishing system is slow and although dissemination can be quick via preprints, the review of those preprints and subsequent acceptance into a journal can take time if subject to multiple rounds of revision. By quickly reviewing preprints, we can help researchers who require rapid evidence of their recent work in job, grant, or award applications. We can also provide rapid constructive assessments of that work for other researchers and readers. Crucially, by getting rid of that accept/reject decision, we are decoupling the scrutiny of the review process from the ability to get published. In doing so, we can stop turning recommendations from peer reviewers into requirements that authors must comply with in order to get accepted – a process that can also remove ideas and insights from scientific discourse. Our aim is to expose the nuanced and multidimensional nature of peer review, rather than reduce its function and output to a binary accept/reject decision.</p><p><strong><strong><strong>What has been your experience only reviewing preprints since 2021</strong></strong>? </strong>Very positive. In 2021, eLife began only reviewing preprints and asking our reviewers to write public versions of their peer reviews containing observations useful to readers. We have posted eLife reviews of more than 2,200 preprints to <a href=\"https://connect.biorxiv.org/eval/?platform=q5X6RWJ6\">bioRxiv and medRxiv</a>, along with a compact editorial assessment. We found that there were no changes in gender or geographic author demographic and it had no significant effect on reviewer recruitment and engagement. This initiative was the first step in the move to our new model and helped us develop the detail.</p><p><strong>What proportion of submissions will be sent to external reviewers, and what will be the criteria?  </strong>The criteria will change from 'is this suitable for publication in eLife'  to ' is this an interesting article worth reviewing?'. Our purpose being to constructively review articles rather than fit them into a hierarchical journal construct. Our capacity however is limited by the size and interests of our editorial board, so the number of articles sent to review will naturally be limited. Currently, we send 30% of submissions to review but we assume this will change with the new model depending on how authors respond.</p><p><strong>Will this new policy change the article types (</strong><a href=\"https://reviewer.elifesciences.org/author-guide/types\"><strong>https://reviewer.elifesciences.org/author-guide/types</strong></a><strong>) that eLife publishes?</strong> No, we will continue to offer different article types.</p><p><strong><strong><strong>Is content published as a Reviewed Preprint different from a Research Article?</strong></strong> </strong>No, the content is the same. In this system, our editors and peer reviewers review the preprint, which is the version of the manuscript that has been deposited in a preprint server. The Reviewed Preprint will contain the public peer reviews and eLife assessment and will have an eLife citation and DOI. When our authors get to the end of the reviewing process and decide they want a final version (Version of Record), we carry out a series of additional checks to ensure that the data, methods, and code are made available, that appropriate reporting standards have been followed, that competing interest and ethics statements are complete, and that cell lines have been authenticated. It is the final Version of Record that we send to the indexers.<br></p><p><strong><strong><strong>How is the new publishing model similar to or different from older publishing models based on preprints combined with peer review (e.g. Copernicus, F1000)?</strong></strong> </strong>There are three main differences. 1) Peer review and assessment at eLife continues to be organised by an editorial team made up of academic experts and led by an Editor-in-Chief, Deputy Editors, Senior Editors, and a Board of Reviewing Editors via a consultative peer-review model already known as one of the most constructive for authors in the industry. 2) The addition of an eLife assessment is a further crucial part of our model, distinctive from what others are doing – it is a key addition to our public peer reviews and it enables readers to understand the context of the work, the significance of the research and the strength of the evidence. 3) We are no longer making accept/reject decisions based on peer review – authors will choose if and when to produce a Version of Record at any point following the review process.<br></p><p><strong><strong><strong>What is your role at Life?</strong></strong> </strong>My role is Head of Publishing. I manage the four publishing departments – Editorial, Production, Journal Development and Features – which function together to operate and publish the eLife journal. I also work with the technology, marketing, and communities teams to oversee the ongoing transition to the new model and work to drive innovation in publishing and in open initiatives. A further part of my role is to work with funders, libraries, external partners, and organisations in the open science community to ensure we strive in our mission to create real change in the practice of science and a future where a diverse, global community of researchers shares open results for the benefit of all.</p> "},{"id":"https://doi.org/10.54900/c490m3r-r45gr6m","title":"Preprints and open preprint review: a workshop on innovations in scholarly publishing","link":"https://doi.org/10.54900/c490m3r-r45gr6m","published":"2022-10-25T16:21:22.000+00:00","description":"Researchers, librarians, policy makers, and practitioners often complain about the scholarly publishing system, but the system also offers exciting opportunities to contribute to innovations in the way...","isPermalink":true,"tags":["News","Meetings"],"authors":[{"name":"Bianca Kramer","url":"https://orcid.org/0000-0002-5965-6560"},{"name":"Ludo Waltman","url":"https://orcid.org/0000-0001-8249-1752"},{"name":"Jeroen Sondervan","url":null},{"name":"Jeroen Bosman","url":null}],"image":"https://upstream.force11.org/content/images/2022/10/Overview-preprint-servers.png","modified":"2023-03-16T18:57:34.000+00:00","contentHtml":" <!--kg-card-begin: html--><p class='u-drop-cap-large'>Researchers, librarians, policy makers, and practitioners often complain about the scholarly publishing system, but the system also offers exciting opportunities to contribute to innovations in the way academic findings are disseminated and evaluated. At the Dutch <a href=\"https://opensciencefestival.nl/programme-2022/\" target=\"_blank\">Open Science Festival</a>, which took place at the Vrije Universiteit Amsterdam on September 1st 2022, we organized one of the ‘community-led’ workshops to discuss some of these developments, focusing on preprints and open preprint review. Participants discussed the opportunities offered by these innovations, and reflected on ways in which these innovations may complement, or perhaps even replace, traditional journal publishing practices.</p><!--kg-card-end: html--><h2 id=\"preprints\">Preprints</h2><!--kg-card-begin: markdown--><p>An important development in scholarly publishing is the increasing adoption of preprints as a way to accelerate the dissemination of academic findings^1^. Preprinting is a fairly established practice in fields such as physics, mathematics and computing science (e.g. <a href=\"https://arxiv.org/\">arXiv</a>), and also in the form of working papers in some fields, such as economics. In recent years it has also gained significant popularity in biomedical fields (e.g. <a href=\"https://www.biorxiv.org/\">bioRxiv</a> and <a href=\"https://www.medrxiv.org/\">medRxiv</a>) and in the social and behavioral sciences (e.g. <a href=\"https://osf.io/preprints/socarxiv\">SocArXiv</a> and <a href=\"https://psyarxiv.com/\">PsyArXiv</a>). In addition to discipline-specific preprint servers, discipline-independent servers (e.g. <a href=\"https://osf.io/preprints/\">OSF Preprints</a>, <a href=\"https://www.preprints.org/\">preprints.org</a>, <a href=\"https://www.researchsquare.com/\">Research Square</a>, and <a href=\"https://www.ssrn.com/\">SSRN</a>) are also increasingly being used. Some of these servers are non-profit, while others are owned by commercial publishers.</p>\n<!--kg-card-end: markdown--><!--kg-card-begin: markdown--><p>To set the stage, we started by discussing the main characteristics of preprints. Definitions can vary, especially amongst disciplines. But in general, preprints (or “working papers”) are an early version of a paper, chapter or other publication, before formal peer review. They are published online on a preprint server either before or upon submission for more ‘formal’ publication, typically in a peer-reviewed journal. Preprints can have updated/corrected versions, e.g., based on comments from peers or community feedback. Nowadays, almost all journals and publishers allow authors to publish their work as a preprint^2^.</p>\n<!--kg-card-end: markdown--><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img src=\"https://lh4.googleusercontent.com/p7VdfVYXdyZnjt5jZxzr7sXDcnbDz21l9M2-Ar60pbnugfdvQCSKhz72UJJ6CeTGx4m44RV-_OnQbLV0kFoLsjtVGjpO4T1TqlXa4Nd9cK5OvfAVZcMX1oEHQf-tcp68-Q9MHUNHQFU2IkKHCe_1C8dro2sCExIc1Ww1OibONHL9no3-Nb1qf8wLSQ\" class=\"kg-image\" alt loading=\"lazy\"><figcaption>Uptake of COVID-19 preprints per month starting from February/March 2020.<span class=\"-mobiledoc-kit__atom\">‌ ‌</span>(source: <a href=\"https://github.com/nicholasmfraser/covid19_preprints\">https://github.com/nicholasmfraser/covid19_preprints</a>)</figcaption></figure><!--kg-card-begin: markdown--><p>Preprints are used quite widely, and can be positively disruptive to a slow and intransparent scientific communication system. Nevertheless, in many academic fields preprinting is not yet practiced by the majority, despite the ‘Corona-boost’ (see figure), and practices and norms around preprinting are therefore still in development. As a result, there may be uncertainty about the status and acceptable usage of preprints vis-à-vis peer-reviewed articles in journals. Also, the financial sustainability of preprint servers still represents a significant challenge^3^. In addition, while many institutions, funders, and societies are promoting or mandating open access publishing, they usually do not actively encourage preprinting, which may explain the relatively slow uptake of preprints. And last but not least, despite the sanity checks performed by preprint servers, there is a risk of dissemination of pseudoscience. While most preprints present solid research, there are also preprints that report on lower-quality work and that may make unsubstantiated claims.</p>\n<!--kg-card-end: markdown--><h2 id=\"preprint-peer-review\">Preprint peer review</h2><p>Unlike articles published in scholarly journals, preprints typically have not been peer reviewed. A recent development is the emergence of platforms for open peer review of preprints. These platforms complement the traditional closed journal peer review system. They typically aim to make peer review more transparent and more efficient. Examples of platforms for preprint peer review are <a href=\"https://peercommunityin.org/\">Peer Community In</a>, <a href=\"https://www.peerref.com/\">PeerRef</a>, <a href=\"https://prelights.biologists.com/\">preLights</a>, <a href=\"https://prereview.org/\">PREreview</a>, and <a href=\"https://www.reviewcommons.org/\">Review Commons</a>. A crucial characteristic of these peer review platforms is that they are all independent of journals and independent of the preprint platforms.</p><h2 id=\"future-developmentthree-scenarios\">Future development - three scenarios</h2><p>The growth in preprinting and the emergence of preprint peer review platforms raises interesting questions about the future development of the scholarly publishing system. While it is too early to make strong predictions, we did outline three scenarios in our workshop for the relation between preprints, journals and peer review.</p><h3 id=\"scenario-1-the-mixed-system\">Scenario 1: The mixed system</h3><!--kg-card-begin: markdown--><p>In this scenario, there is a mixed system in which journals, preprint servers, and peer review platforms co-exist in a loosely coupled way. Journals and preprint servers operate independently from each other, but there can be relations between them, for instance to enable authors to submit their work simultaneously to a journal and to a preprint server^4^. Likewise, there are initiatives for peer review where peer reviews are made available alongside a preprint, while also being used by journals for deciding whether to accept the preprinted article for publication in the journal. Peer review reports (of both journal articles and preprints) can also be published on dedicated platforms, both by journals and by individual reviewers, either invited by journals, by peer review services, by authors, or not invited at all.</p>\n<!--kg-card-end: markdown--><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img src=\"https://upstream.force11.org/content/images/2022/10/Mixed-model.png\" class=\"kg-image\" alt loading=\"lazy\" width=\"1102\" height=\"720\" srcset=\"https://upstream.force11.org/content/images/size/w600/2022/10/Mixed-model.png 600w, https://upstream.force11.org/content/images/size/w1000/2022/10/Mixed-model.png 1000w, https://upstream.force11.org/content/images/2022/10/Mixed-model.png 1102w\" sizes=\"(min-width: 720px) 720px\"><figcaption>Scenario 1: The mixed system</figcaption></figure><h3 id=\"scenario-2-the-extended-journal\"><br>Scenario 2: The extended journal</h3><p>In this scenario, journals broaden the services they offer to include preprinting and open peer review, leading to what may be referred to as the ‘extended journal’. Preprinting and open peer review become fully integrated elements in the workflows of journals. Scholarly publishing remains organized around journals, but journals start to perform functions that they did not perform traditionally.</p><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img src=\"https://upstream.force11.org/content/images/2022/10/Extended-journal-model.png\" class=\"kg-image\" alt loading=\"lazy\" width=\"1516\" height=\"294\" srcset=\"https://upstream.force11.org/content/images/size/w600/2022/10/Extended-journal-model.png 600w, https://upstream.force11.org/content/images/size/w1000/2022/10/Extended-journal-model.png 1000w, https://upstream.force11.org/content/images/2022/10/Extended-journal-model.png 1516w\" sizes=\"(min-width: 720px) 720px\"><figcaption>Scenario 2: The extended journal</figcaption></figure><p>Examples of this could be found at Copernicus Publications, with their <a href=\"https://publications.copernicus.org/services/public_peer_review.html\">Interactive Peer Review</a>, but also at the F1000 platforms, which are currently also whitelabeled and used by research funders (e.g. Wellcome Open Research and the European Commission’s Open Research Europe platform). The integration of SSRN and Research Square in the submission workflows of Elsevier and Springer Nature journals is another example of a development in the direction of the extended journal.</p><h3 id=\"scenario-3-moving-away-from-journal-based-publishing\">Scenario 3: Moving away from journal-based publishing</h3><p>In this scenario, the scientific community increasingly recognizes the value of preprint servers and peer review platforms. This leads to a situation that may be considered the opposite of the ‘extended journal’ scenario discussed above. Rather than taking on additional functions, journals choose to unbundle their services. The dissemination function of journals is going to be performed by preprint servers (although the term ‘preprint’ may no longer be appropriate), while the evaluation function is going to be performed by peer review platforms. In the most extreme variant of this scenario, journals completely cease to exist and scholarly publishing takes place entirely on preprint servers and peer review platforms.</p><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img src=\"https://upstream.force11.org/content/images/2022/10/No-journal-involved.png\" class=\"kg-image\" alt loading=\"lazy\" width=\"506\" height=\"735\"><figcaption><em>Scenario 3: Moving away from journal-based publishing</em></figcaption></figure><p>The <a href=\"https://elifesciences.org/inside-elife/e4638e4a/elife-latest-a-new-vision-for-transforming-research-communication\">‘publish, review, curate’ model</a> promoted by eLife, <a href=\"https://peercommunityin.org/\">Peer Community In</a> and the <a href=\"https://www.coar-repositories.org/notify/\">Notify-project</a> by the Confederation of Open Access Repositories (COAR) are important steps in this direction. An important issue that we did not address in the workshop is how such a system without journals performs the functions of disciplinary communities and topical filtering that journals currently have. By taking advantage of developments in filtering technologies, we expect that preprint servers and peer review platforms will increasingly be able to perform these functions.</p><h2 id=\"publish-your-reviews\">Publish Your Reviews</h2><p>At the end of our workshop, we presented the <a href=\"https://asapbio.org/publishyourreviews\">Publish Your Reviews</a> initiative, a new community-based initiative developed by one of us together with ASAPbio. Building on the above-mentioned developments, Publish Your Reviews encourages researchers to combine journal peer review with preprint peer review, aiming to increase the value of preprints and to make peer review more useful and more efficient. Supported by <a href=\"https://asapbio.org/publishyourreviews#supporters\">publishers and other organizations</a>, the initiative calls on researchers to publish the reviews they submit to journals and to link these reviews to the preprint version of the article under review. Researchers that support Publish Your Reviews are invited to <a href=\"https://asapbio.org/publishyourreviews#sign\">sign a pledge</a>.</p><figure class=\"kg-card kg-image-card\"><img src=\"https://lh4.googleusercontent.com/wuCipVHAGGCTETS9lL39tE2GQypcl7l_1BFIHFmd5Mg4Z03T_N6GGrJzRBjYe30QO9Fi-fui_7dw6roKPtWxuTVXHUhDJr-ct60KjEL-gVwsPwRMlU_PbtE6Da9o_jv7zric16G-8wWh0uIpRUYifHpZoEcCK22iY01CpvpCtp5ekYEHerqCQONTuw\" class=\"kg-image\" alt loading=\"lazy\"></figure><h2 id=\"next-steps\">Next steps</h2><p>The workshop participants showed a great interest in the above-mentioned developments. At the end of the workshop, many participants had a concrete plan for contributing to these developments. Some of them announced they are going to publish their own reviews, while others plan to promote preprinting and preprint peer review in their community. There were also participants that are going to consider how preprinting and preprint peer review can be given appropriate recognition in hiring and promotion policies.</p><p>Further support for innovating scholarly publishing was given at the end of the Open Science Festival, when Robert Dijkgraaf, Minister of Education, Culture and Science, <a href=\"https://www.scienceguide.nl/2022/09/dijkgraaf-wil-af-van-dom-publicatiesysteem/\">strongly criticized</a> the current publishing system. We hope the words of the minister will encourage everyone in the Dutch research community and beyond to support efforts to innovate scholarly publishing!<br></p><p>---</p><p>References:<br>1. See for example: Chiarelli, A. et al. (2019). Accelerating scholarly communication: The transformative role of preprints. Zenodo. <a href=\"https://doi.org/10.5281/zenodo.3357727\">https://doi.org/10.5281/zenodo.3357727</a> and Waltman, L., et al.  (2021). Scholarly communication in times of crisis: The response of the scholarly communication system to the COVID-19 pandemic (Version 1). Research on Research Institute. <a href=\"https://doi.org/10.6084/m9.figshare.17125394.v1\">https://doi.org/10.6084/m9.figshare.17125394.v1</a>.</p><p>2. The JISC service <a href=\"https://v2.sherpa.ac.uk/romeo/\">Sherpa Romeo</a> offers information about journals’ policies on posting different versions of a research article (preprint, postprint and Version of Record).</p><p>3. Penfold, N. (2022). The case for supporting open infrastructure for preprints: A preliminary investigation. Zenodo. <a href=\"https://doi.org/10.5281/zenodo.7152735\">https://doi.org/10.5281/zenodo.7152735</a></p><p>4. See for example the Direct Transfer Service offered by PLOS <a href=\"https://journals.plos.org/plosone/s/preprints\">https://journals.plos.org/plosone/s/preprints</a>.</p><p><br><br></p><p><br><br></p><p>For commenting, all slides are available <a href=\"https://docs.google.com/presentation/d/1R8dAvSvLnDFUcLVip0mHhEbWyDAbpzuIsibhNloXkl0/edit#slide=id.p\">here</a>.</p><p>For referencing, all slides are deposited here: <a href=\"https://doi.org/10.5281/zenodo.7040997\">https://doi.org/10.5281/zenodo.7040997</a>. <br></p> "},{"id":"https://doi.org/10.54900/fnj5mz2-2g0bj5m","title":"Preprint as a Way to Universal Open Access","link":"https://doi.org/10.54900/fnj5mz2-2g0bj5m","published":"2022-09-28T09:31:06.000+00:00","description":"A journey started with the INArxiv hosted by The Center of Open Science to RINarxiv hosted by BRIN Indonesia.Current situation in academia (especially in Global South). It’s very hard for us to keep our heads...","isPermalink":true,"tags":[],"authors":[{"name":"Dasapta Erwin Irawan","url":"https://orcid.org/0000-0002-1526-0863"}],"image":"https://upstream.force11.org/content/images/2022/09/Screenshot-2022-09-19-at-17.14.26.png","modified":"2023-01-12T19:26:10.000+00:00","contentHtml":" <figure class=\"kg-card kg-image-card kg-card-hascaption\"><img src=\"https://upstream.force11.org/content/images/2022/09/1-Universal-open-access-3.png\" class=\"kg-image\" alt loading=\"lazy\" width=\"960\" height=\"540\" srcset=\"https://upstream.force11.org/content/images/size/w600/2022/09/1-Universal-open-access-3.png 600w, https://upstream.force11.org/content/images/2022/09/1-Universal-open-access-3.png 960w\" sizes=\"(min-width: 720px) 720px\"><figcaption>A journey started with the INArxiv hosted by The Center of Open Science to RINarxiv hosted by BRIN Indonesia.</figcaption></figure><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img src=\"https://upstream.force11.org/content/images/2022/09/2-Universal-open-access-3.png\" class=\"kg-image\" alt loading=\"lazy\" width=\"960\" height=\"540\" srcset=\"https://upstream.force11.org/content/images/size/w600/2022/09/2-Universal-open-access-3.png 600w, https://upstream.force11.org/content/images/2022/09/2-Universal-open-access-3.png 960w\" sizes=\"(min-width: 720px) 720px\"><figcaption>Current situation in academia (especially in Global South). It’s very hard for us to keep our heads above water.</figcaption></figure><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img src=\"https://upstream.force11.org/content/images/2022/09/3-Universal-open-access-3.png\" class=\"kg-image\" alt loading=\"lazy\" width=\"960\" height=\"540\" srcset=\"https://upstream.force11.org/content/images/size/w600/2022/09/3-Universal-open-access-3.png 600w, https://upstream.force11.org/content/images/2022/09/3-Universal-open-access-3.png 960w\" sizes=\"(min-width: 720px) 720px\"><figcaption>The basic ingredients of preprinting are: ethics, integrity, and norms. We have a generic set of values and also subject-specific and culture-specific values.</figcaption></figure><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img src=\"https://upstream.force11.org/content/images/2022/09/4-Universal-open-access-3.png\" class=\"kg-image\" alt loading=\"lazy\" width=\"960\" height=\"540\" srcset=\"https://upstream.force11.org/content/images/size/w600/2022/09/4-Universal-open-access-3.png 600w, https://upstream.force11.org/content/images/2022/09/4-Universal-open-access-3.png 960w\" sizes=\"(min-width: 720px) 720px\"><figcaption>Part 1: Universal open access for authors. No matter which journal you submit your manuscript to, make sure to self-archive the preprint and postprint version to take back your freedom to write, to share, and to retain copyrights.</figcaption></figure><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img src=\"https://upstream.force11.org/content/images/2022/09/5-Universal-open-access-4.png\" class=\"kg-image\" alt loading=\"lazy\" width=\"960\" height=\"540\" srcset=\"https://upstream.force11.org/content/images/size/w600/2022/09/5-Universal-open-access-4.png 600w, https://upstream.force11.org/content/images/2022/09/5-Universal-open-access-4.png 960w\" sizes=\"(min-width: 720px) 720px\"><figcaption>Part 2: Universal open access for readers. Preprints ship out the rights to search, to read, and to reuse to the readers.</figcaption></figure><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img src=\"https://upstream.force11.org/content/images/2022/09/6-Universal-open-access-3.png\" class=\"kg-image\" alt loading=\"lazy\" width=\"960\" height=\"540\" srcset=\"https://upstream.force11.org/content/images/size/w600/2022/09/6-Universal-open-access-3.png 600w, https://upstream.force11.org/content/images/2022/09/6-Universal-open-access-3.png 960w\" sizes=\"(min-width: 720px) 720px\"><figcaption>To achieve both parts, preprint servers or repositories needed to be kept non-profit or as part of governmental infrastructure.</figcaption></figure><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img src=\"https://upstream.force11.org/content/images/2022/09/7-Universal-open-access-3.png\" class=\"kg-image\" alt loading=\"lazy\" width=\"960\" height=\"540\" srcset=\"https://upstream.force11.org/content/images/size/w600/2022/09/7-Universal-open-access-3.png 600w, https://upstream.force11.org/content/images/2022/09/7-Universal-open-access-3.png 960w\" sizes=\"(min-width: 720px) 720px\"><figcaption>In the end …How can we create positive dents in the community?</figcaption></figure><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img src=\"https://upstream.force11.org/content/images/2022/09/Universal-open-access.jpeg\" class=\"kg-image\" alt loading=\"lazy\" width=\"960\" height=\"540\" srcset=\"https://upstream.force11.org/content/images/size/w600/2022/09/Universal-open-access.jpeg 600w, https://upstream.force11.org/content/images/2022/09/Universal-open-access.jpeg 960w\" sizes=\"(min-width: 720px) 720px\"><figcaption>All together!</figcaption></figure> "},{"id":"https://doi.org/10.54900/dpfcg6r-r1phx24","title":"Hot memo summer: How OSTP’s recommendations will lead to a large-scale transformation of the research ecosystem","link":"https://doi.org/10.54900/dpfcg6r-r1phx24","published":"2022-09-20T08:32:48.000+00:00","description":"Since 2015 I’ve been steeped in the world of open access, academic publishing, and funder policies. This is a blip of time compared to many other experts and advocates in this space. I’ve often sardonically...","isPermalink":true,"tags":["Thought Pieces"],"authors":[{"name":"Ashley Farley","url":"https://orcid.org/0000-0001-9310-6944"}],"image":"https://images.unsplash.com/photo-1578048421563-9aa187e12baf?crop&#x3D;entropy&cs&#x3D;tinysrgb&fit&#x3D;max&fm&#x3D;jpg&ixid&#x3D;MnwxMTc3M3wwfDF8c2VhcmNofDR8fHRyYW5zZm9ybWF0aW9ufGVufDB8fHx8MTY2MzQyNDUwMw&ixlib&#x3D;rb-1.2.1&q&#x3D;80&w&#x3D;2000","modified":"2023-01-12T19:27:52.000+00:00","contentHtml":" <p>Since 2015 I’ve been steeped in the world of open access, academic publishing, and funder policies. This is a blip of time compared to many other experts and advocates in this space. I’ve often sardonically joked that if I had received a dollar for every time I’ve heard that open access will become the norm once the United States changes its policy I could retire early.  I remember attending a funder convening at the Office of Science and Technology Policy (OSTP) in 2018 feeling both the urgency for systemic change and the weight of publisher lobbying to protect the status quo. It’s certainly something I never thought would happen in my career. Thus, I was elated to see the <a href=\"https://www.whitehouse.gov/ostp/news-updates/2022/08/25/ostp-issues-guidance-to-make-federally-funded-research-freely-available-without-delay/\">announcement</a> that the OSTP is updating its guidance to make federally funded research freely available without embargo. This feels like an important and needed tipping point for the United States. It’s a chance to catch up with other parts of the world (Europe, Australia, Netherlands, Latin America, etc.) that have been prioritizing and delivering on open science for many years now. <br></p><p>One reason this announcement is so important is that it confirms the conviction of many who have taken risks and pushed against the status quo with the inherent belief that change is necessary. This is a proof point that the work and sacrifices made are creating momentum and advancements. I want to take the time to thank the funders and academic institutions that have implemented and enforced strong policies with the goal of adapting the behaviors of their communities. This is never a fun endeavor, and no matter how carefully one constructs policy you are inconveniencing or creating conflict for someone. I’ve been proud that the Bill & Melinda Gates Foundation joined <a href=\"https://www.coalition-s.org/\">cOAlition S </a>early on and has been actualizing Plan S principles. It hasn’t been easy, and I will be the first to acknowledge when criticisms of <a href=\"https://www.coalition-s.org/why-plan-s/\">Plan S</a> are well-founded. We can and should always strive to do better. And I believe we have throughout the years. However, it’s not easy to set policy as a funder as there are pressures coming from all sides: grantee authors are concerned about career advancement and don’t want to alter their publishing habits, while on the other side you have publishers pushing back on and resisting policy. Oftentimes authors and publishers align in a semi-parasitic symbiotic relationship where authors strive to publish in a journal with the highest reward potential for their career and publishers benefit from this competitive nature. In the hierarchy of needs, authors will place future career advancement over funder policy compliance. And the publishers don't have the incentive to be flexible to meet those policy requirements. What gets lost in all of this is ensuring that knowledge is openly and easily shared globally to solve problems. <br></p><p>Sharing knowledge really shouldn’t be this hard. Yet, I recognize it’s complex to change a system that is still stymied by its print-based origin. While funder policies have been criticized as adding further complexity, they do lead to a stronger awareness of the issues and inspire potential transformation. This is why, to me, the OSTP announcement feels like a tipping point in this transformation. That others have led the way and advocated so that this is possible should not go unacknowledged. Even with the pitfalls of transition to open access (high Article Processing Charges (APCs), “transformative” agreements or journals, arguments over rights retention) authors are considering these issues more now than ever. And I would make a bet that many publishers, especially the for-profit commercial ones, rely on and benefit from authors moving through the publishing system without question, signing away their rights without consideration, and letting their research be locked up. Now, as authors work through the nuances of open access policy more attention is being paid (pun intended) and the true value-add of the publishers is being scrutinized. Are we at the precipice of the utopia of open-access publishing that we’ve dreamt of? No. Not at all. But are we closer? I would argue, yes, and with the OSTP we can move forward with more collective action power. This can transform the open access movement into true action. <br></p><p>Are there going to be mistakes along the way? Of course. Should we push as hard as possible to achieve the vision of all open movements beginning with the <a href=\"https://www.budapestopenaccessinitiative.org/\">Budapest Open Access Initiative</a>? Definitely. Staying still or turning back isn’t an option. For publishers, the ideal move would be to immediately drop any embargos to allow for immediate, CC-BY sharing. This certainly shouldn’t come as a surprise to publishers, and I push back on any rhetoric that publishers have not been consulted. There have been decades of discourse and lobbying, and at some point, the response is inherently known. I don’t expect (especially for-profit) publishers not to prioritize profit and business, but I do expect funding institutions to place the public good above the wants of businesses. Funders have given publishers years, if not decades, to innovate and find better models to make open access the norm. And we’ve seen publishers make grandiose statements regarding their commitments to open science. The time to act on these statements is now. Either we all continue to kick the can down the road, or we pick it up and recycle it to transform it into something better and usable. <br></p><p>If publishers don’t adjust their policies, then a strong <a href=\"https://www.coalition-s.org/rights-retention-strategy/\">Rights Retention</a> policy needs to be enacted. I have a hard time seeing where the money to support APCs for federally funded research will come from. The conversation of equity of APCs is heating up as it should. I work at a privileged organization, and yearly we spend approximately 6 million in APCs each year. While it’s great to release articles from being held hostage behind paywalls and restrictive licensing - I’m not sure the impact is much larger than that. The larger impact will only happen when much more of the world’s content is open, has robust metadata, and is machine-readable. I would like to see a massive uptake of green open access or self-archiving to achieve this.  Now, the systems and the underpinning open infrastructures are stronger and continue to develop to best support open access, open metadata, and open science. Through this researchers have more power to share their research on their terms than they have in decades. We can deprioritize the prevalence of APCs. Then we could see actual innovation in knowledge curation. This innovation isn’t going to be driven by the large corporate publishers, and we shouldn’t wait for it to happen.<br></p><p>The foundation’s open access policy will continue to evolve as the ecosystem does the same. In my opinion, a successful policy is one that adapts to put pressure on the cracks in the current system. I predict that funder policies will continue to strengthen rights retention, include a cap on the amount of money that can be spent on publishing, shift away from reliance on the version of record, and build more support for open science (focusing less on articles and more on all knowledge outputs). <br></p><p>I often grow weary of how persistent the above discourse is when it isn’t married to action. Thus, I would like to close with recommended actions for each stakeholder in academic publishing. These may be very lofty, difficult, scary actions but now is the time to be <strong>bold</strong>. </p><div class=\"kg-card kg-callout-card kg-callout-card-grey\"><div class=\"kg-callout-emoji\">💡</div><div class=\"kg-callout-text\"><strong>Authors:</strong> Pay attention to and heed your funder’s policies regarding publishing and data sharing. There is a strong intentionality to these policies. Become an advocate for change that is needed to make this easier for those who follow you. Retain your rights. There is no reason to give exclusive rights to anyone for the purpose of knowledge dissemination.</div></div><div class=\"kg-card kg-callout-card kg-callout-card-grey\"><div class=\"kg-callout-emoji\">💡</div><div class=\"kg-callout-text\"><strong>Funders: </strong>Join other funders in implementing strong sharing policies. The more this becomes a standard requirement for funding and conducting research, the more the system will change for the better.</div></div><div class=\"kg-card kg-callout-card kg-callout-card-grey\"><div class=\"kg-callout-emoji\">💡</div><div class=\"kg-callout-text\"><strong>Librarians</strong>: I am heartened to see a shift in vendor engagement and library spending becoming more values-driven. Librarians need to push back harder on publisher antics and strive for actual transformation.</div></div><div class=\"kg-card kg-callout-card kg-callout-card-grey\"><div class=\"kg-callout-emoji\">💡</div><div class=\"kg-callout-text\"><strong>Publishers*:</strong> Get rid of embargos. Embrace rights retention. Improve your metadata. Work WITH the rest of the ecosystem to solve publishing problems.</div></div><div class=\"kg-card kg-callout-card kg-callout-card-grey\"><div class=\"kg-callout-emoji\">💡</div><div class=\"kg-callout-text\"><strong>Institutions:</strong> Change those academic career incentives to prioritize openness, sharing, and collaboration now. Be involved in the discourse.&nbsp;</div></div><div class=\"kg-card kg-callout-card kg-callout-card-grey\"><div class=\"kg-callout-emoji\">💡</div><div class=\"kg-callout-text\"><strong>Advocates</strong>: Keep it up! You should enjoy this win and use the momentum to keep advocating. Practice self-care - it’s taken this long to get to this point, so the marathon continues.&nbsp;</div></div><p><em>*I can over-generalize when using the term “publishers”. I am often talking about the oligopoly of the top 5 for-profit publishers.</em></p> "},{"id":"https://doi.org/10.54900/cyfd6sm-msf52yg","title":"Science Reading: Cognitive narrative helps us understand science better","link":"https://doi.org/10.54900/cyfd6sm-msf52yg","published":"2022-09-13T07:00:10.000+00:00","description":"Take a look at the picture below. What do you see? Think for a moment and write down your observations or say them out loud.Image by Susan Barstow, posted by Holsti97 at...","isPermalink":true,"tags":["Thought Pieces"],"authors":[{"name":"Monica Gonzalez-Marquez","url":null},{"name":"Anouschka Foltz","url":null},{"name":"Jeffrey K. Bye","url":null},{"name":"Ali Fulsher","url":null}],"image":"https://images.unsplash.com/photo-1525715843408-5c6ec44503b1?crop&#x3D;entropy&cs&#x3D;tinysrgb&fit&#x3D;max&fm&#x3D;jpg&ixid&#x3D;MnwxMTc3M3wwfDF8c2VhcmNofDEwfHxyZWFkaW5nfGVufDB8fHx8MTY2MzAwOTE1Nw&ixlib&#x3D;rb-1.2.1&q&#x3D;80&w&#x3D;2000","modified":"2023-01-13T07:39:43.000+00:00","contentHtml":" <!--kg-card-begin: html--><p class='u-drop-cap-large'>Take a look at the picture below. What do you see? Think for a moment and write down your observations or say them out loud.</p><!--kg-card-end: html--><figure class=\"kg-card kg-image-card kg-width-wide kg-card-hascaption\"><img src=\"https://upstream.force11.org/content/images/2022/09/Picture-1.png\" class=\"kg-image\" alt=\"An impression on the snow of an ambiguous nature that is hard to catch. The tracks are of two kinds.\" loading=\"lazy\" width=\"490\" height=\"364\"><figcaption>Image by Susan Barstow, posted by Holsti97 at <a href=\"https://www.summitpost.org/disappearing-rabbit-trick/185785\">https://www.summitpost.org/disappearing-rabbit-trick/185785</a></figcaption></figure><p>Did you see tracks in the snow and the shadow of trees in the background? Maybe you were more specific, noting there are different kinds of tracks going in different directions, and at least two trees casting shadows. Or you may have even thought it looks like a large bird of prey caught a small animal and flew off with it.</p><p>In fact, there are no animals in this picture. There are no tracks. There isn’t even any color. </p><p>All that we <em>actually </em>see are gray-scale pixels on a two-dimensional space. Yet, when asked what we see, many of us begin constructing and describing an event: an animal caught by a bird of prey. We might even include elements of motivation (the bird is hunting for survival) and emotion (feeling sorry for the critter) in our observations. What this means is that we infer from these shades of gray a <em>narrative –</em> characters (the predator and prey) interacting in a place over time (the bird capturing the critter and flying off with it). </p><p>Narrative is key to how we interpret the world.</p><p>We should clarify now that the narrative we are referring to is <em>cognitive narrative</em>. This is narrative as an information-organizing principle in human-type cognition. It is enmeshed in how humans think and interact. When we chat with our friends to catch up, we’re sharing stories about our lives. When we go on a job interview, we’re telling the story of our prior experiences as positively as possible. When we read a newspaper article, we’re reading stories that happened in the world as documented by those who observed them or at least gathered information from others about what happened. When we watch a stranger storm off, then ask our friend what happened, we are engaging in gossip – stories about people that are none of our business but that interest us anyway.</p><p>Stories shape our lives – and they are immensely powerful. Consider what happened with the television series <em>Firefly,</em> a space western imagined by Joss Whedon. When the show was canceled after one season, fans raised money and pressured the studios to complete the story. Think about that for a moment. Strangers the world over organized just to get the ending of a story. </p><p>Stories shape our thoughts, our comprehension of what happens in the world, and they move us to action.</p><p>What does this have to do with science? Science is a human activity dedicated to gathering knowledge and understanding. We record what we learn and how we learned it in papers. Our goal when we read a scientific journal article is what we call ‘<strong>Science Reading’:</strong> the act of conceptually reconstructing a scientific process that researchers, with all of their human biases and limitations, have conducted. We should clarify that we’re not talking about the type of narrative commonly used in science communication, where a science communicator superimposes a story designed for consumption by a general audience. The narrative that interests us here is the one inherent to the representation of a scientific process.</p><p>We narrate from the available documentation such that we can assess the reliability of the scientific process, its products, and the inferences the researchers make. In other words, it means that we, as readers, want to be able to understand what actions were performed and observed, and why, where, when, how, and what it all means. For Science Reading to be effective, the researchers must have created documentation structured for comprehension from these processes for us to be able to answer all these questions. Thus, the documentation must be both physically and conceptually accessible.</p><p>It is not enough to be able to get the information, we must also be able to understand it.</p><h2 id=\"let%E2%80%99s-think-about-how-we-eat-ice-cream\">Let’s think about how we eat ice cream.</h2><p>To understand what we mean, let’s first consider something that most of us are well familiar with: eating ice cream. We’re not referring to the mechanics of eating ice cream (i.e., can you put a spoonful of creamy, icy cold deliciousness in your mouth?). </p><p>The real question is what skills we need to understand how to break down an ice cream eating <em>event</em> in terms of understanding. What entities, actions, behaviors, attitudes, etc., are involved. Those are the skills you need for Science Reading: the skills to break down events to understand how they happen. </p><p>Let’s deconstruct. </p><p>What do we need for an ice cream eating event? A list might look something like this:</p><ol><li>People who want ice cream</li><li>A place to get ice cream</li><li>To order ice cream</li><li>The ability to order ice cream</li><li>Tools to serve and eat the ice cream (scooper, bowl, and spoon)</li><li>Time to eat the ice cream</li><li>To engage in actually eating the ice cream</li><li>People who no longer want to eat ice cream because they've had some (yes, we know. Extremely unlikely, but bear with us.)</li></ol><p>All of these points can be positioned in a narrative arc, framed by time. This arc contains 3 key points. At the beginning is Belief/Physical State A, in the middle something that happens to challenge the status of Belief/Physical State A, and at the end the resulting Belief/Physical State now labeled B. The arc can look something like this:</p><figure class=\"kg-card kg-image-card\"><img src=\"https://upstream.force11.org/content/images/2022/09/Picture-3.png\" class=\"kg-image\" alt loading=\"lazy\" width=\"936\" height=\"462\" srcset=\"https://upstream.force11.org/content/images/size/w600/2022/09/Picture-3.png 600w, https://upstream.force11.org/content/images/2022/09/Picture-3.png 936w\" sizes=\"(min-width: 720px) 720px\"></figure><p>Note that the arc is not quantitative. Being higher up does not indicate a greater quantity of anything, it signifies progression towards the point where a shift becomes possible from A to B. </p><p>More information needed to understand an ice cream eating event than to list its sub-events and place them on a narrative arc. We still don’t know who, or how, or when. Every language has a set of terms it uses specifically to get the details of a narrative. They’re the universal interrogatives, labeled as such because they occur in every single language in some form. In English they are:</p><ol><li>Who</li><li>What</li><li>Where</li><li>When</li><li>Why</li><li>How</li></ol><p>You’ll notice that some answers in our list are actually answers to an interrogative with a preposition (e.g., “tools to serve and eat ice cream” answers the question “with what?”). The interrogation process is about learning to ask the kinds of questions that can get you the whole story. That said, one of the helpful things about positioning your events in an arc is that you can see where there are gaps in your information.</p><p>You’ll notice above that there is nothing between ‘eating ice cream’ and ‘no longer wanting ice cream’. What happened here? </p><p>The universal interrogatives help you obtain the missing information. The more you practice actively working on getting the whole story, the more specific your questions will become (i.e. was the ice cream eaten slowly? Did anyone get second servings?). Where the questions stop depends on your goal for the story you are building in your head. </p><p>In a science paper, your goal is enough comprehension to be able to reproduce the events conceptually. The important thing is to understand that you already have this tool set. Now you need to refine those skills for science.</p><h2 id=\"mapping-to-science-article\">Mapping to science article</h2><p>What happens when we apply the same narrative process, guided by universal interrogatives to a scientific journal article? </p><p>Let’s begin by looking at a short paper: <em><a href=\"https://doi.org/10.1111/j.1467-9280.2005.01640.x\">See the ball, Hit the Ball (Witt & Profitt, 2005)</a></em>. From this paper, we may get a list of events that look like this:</p><ol><li>Made an observation about the subjectivity of ball size estimation</li><li>Did a literature review about size perception</li><li>Produced a hypothesis proposing there is a relationship between skill and size perception</li><li>Designed an experiment to test whether this was the case using softball players</li><li>Designed and produced the materials for the experiment</li><li>Developed a recruitment plan for participants</li><li>Recruited participants softball player</li><li>Ran the experiment</li><li>Prepared data for analysis</li><li>Analysed the data</li><li>Interpreted the data</li><li>Made a decision about what the data said in relation to the hypothesis</li><li>Wrote up the paper</li></ol><p>And positioning into a narrative arc may look like this:</p><figure class=\"kg-card kg-image-card\"><img src=\"https://upstream.force11.org/content/images/2022/09/Picture-5.png\" class=\"kg-image\" alt loading=\"lazy\" width=\"936\" height=\"432\" srcset=\"https://upstream.force11.org/content/images/size/w600/2022/09/Picture-5.png 600w, https://upstream.force11.org/content/images/2022/09/Picture-5.png 936w\" sizes=\"(min-width: 720px) 720px\"></figure><p>But there is still much information missing. </p><p>Enter the universal interrogatives. The first event is ‘made an observation […]’ but who made the observation? When? In what context? The next event is ‘Did a literature review […]’ but who did it, how was it done? How were the sources gathered? Were some already familiar to the authors? What criteria were used to select specifically these papers? </p><p>Many of the answers to these questions will be found in the text. Unfortunately many more won’t. The power of narrative here is that it sheds light on the unknown unknowns. It helps us understand what we did not realize we did not know. This is crucially important to improving the quality of the scientific record.</p><p>A disturbing proportion of peer-reviewed papers do not contain enough information to replicate the studies they describe. The people who reviewed them did not realize that key information was missing or what key information was needed to ensure that the science they contained was replicable. </p><p>The systematicity of this problem is blown wide open in meta-analyses. Again and again researchers attempting meta-analyses find that papers in their current form lack the information needed to appropriately compare them with similar studies. This points to the need for an improved scientific documentation system, based on how humans organize and understand information. We wish to stress that it is no individual author’s or reviewer’s personal fault that our science documentation is unreliable. Only that it is our collective responsibility to fix it.</p><h2 id=\"take-home-message\">Take home message</h2><p>A scientific journal article is  the documentation of a sequence of events aimed at finding an answer to a question – a scientific process. It’s very similar to historical writing in that the events are interpreted from the author’s perspective. However, unlike with historical writing, scientific events are typically recorded by the very people who designed and orchestrated them. This is key to conceptualizing that neither the events, their documentation, nor their interpretation can ever be objective. They are all constrained by the inherent biases involved with being human, the same as with writing histories and the logic behind the adage that ‘History is written by the victors’. This humanity, warts and all, is not a bug in the system, but a feature of being humans who do science. Does this mean that the products of this process cannot be trusted? No. It means they must be understood as products of rational minds in the context of specific arguments in specific contexts. There are no shortcuts. Improving Science Reading (and writing) will require collaboration between science writers, readers, and reviewers</p> "},{"id":"https://doi.org/10.54900/acr1sw6-6pczdnf","title":"Gimena del Rio Riande is Keeping Tabs on Open Research","link":"https://doi.org/10.54900/acr1sw6-6pczdnf","published":"2022-09-06T07:00:15.000+00:00","description":"Gimena del Rio Riande is Associate Researcher at the Instituto de Investigaciones Bibliográficas y Crítica Textual (IIBICRIT-CONICET, Argentina) (https://orcid.org/0000-0002-8997-5415). Her main academic...","isPermalink":true,"tags":["Open Tabs"],"authors":[{"name":"Gimena del Rio","url":"https://orcid.org/0000-0002-8997-5415"}],"image":"https://images.unsplash.com/photo-1591492654773-6756035bef6b?crop&#x3D;entropy&cs&#x3D;tinysrgb&fit&#x3D;max&fm&#x3D;jpg&ixid&#x3D;MnwxMTc3M3wwfDF8c2VhcmNofDIwfHxzdGFjayUyMG9mJTIwYm9va3N8ZW58MHx8fHwxNjYxMTYyNjA1&ixlib&#x3D;rb-1.2.1&q&#x3D;80&w&#x3D;2000","modified":"2023-01-12T19:18:55.000+00:00","contentHtml":" <!--kg-card-begin: html--><p class='u-drop-cap-large'><em>Gimena del Rio Riande is Associate Researcher at the Instituto de Investigaciones Bibliográficas y Crítica Textual (IIBICRIT-CONICET, Argentina) (<a href=\"https://orcid.org/0000-0002-8997-5415\">https://orcid.org/0000-0002-8997-5415</a>). Her main academic interests deal with digital humanities, digital scholarly edition and publishing, and Open Research Practices in the Humanities. She is actively involved in many <a href=\"https://hdlab.space/\">digital humanities initiatives</a> and takes part of communities like the <a href=\"https://doaj.org/\">DOAJ</a> and the <a href=\"https://tei-c.org/\">TEI Consortium</a>.</em></p><!--kg-card-end: html--><hr><p>\"<a href=\"https://en.wikipedia.org/wiki/The_Library_of_Babel\">The Library of Babel</a>\" is a short story by the Argentine writer Jorge Luis Borges in which the universe is conceived in the form of a vast and infinite library. This library contains all useful information, including predictions of the future, biographies, and translations of every book in all <a href=\"https://en.wikipedia.org/wiki/Language\">languages</a>.</p><p>I must confess I am a Borges-fan, a <a href=\"https://www.bustle.com/articles/166488-13-types-of-readers-everyone-knows-because-we-arent-all-alike\">polygamist reader</a>, and also a tab-saver person. Consequently, I have always loved this idea of a comprehensive library in which I could find and read in many languages all that is published about digital humanities, digital edition, open science or scholarly communication, with a special focus in Latin America.</p><p>In any case, my invitation to write the latest installment of Open Tabs came from a scholar that I very much admire, Bianca Kramer, and it feels like  a great opportunity to share with you some of my multilingual Babel tabs.</p><h3 id=\"tendencias-recientes-en-las-pol%C3%ADticas-cient%C3%ADficas-de-ciencia-abierta-y-acceso-abierto-en-iberoam%C3%A9rica-by-dominique-babini-and-laura-rovelli\"><a href=\"https://www.memoria.fahce.unlp.edu.ar/libros/pm.5293/pm.5293.pdf\">Tendencias recientes en las políticas científicas de ciencia abierta y acceso abierto en Iberoamérica</a> by Dominique Babini and Laura Rovelli</h3><p>Let 's start with the big picture. In 2020, Dominique Babini and Laura Rovelli published a book that, in my opinion, contains the basics needed to understand Open Science in Spanish-speaking countries: <a href=\"https://www.memoria.fahce.unlp.edu.ar/libros/pm.5293/pm.5293.pdf\">Tendencias recientes en las políticas científicas de ciencia abierta y acceso abierto en Iberoamérica</a>.  Many of the chapters of this book discuss other influential texts that had been previously published on topics and issues related to Open Science in the region. </p><h3 id=\"publishing-from-the-periphery-structural-heterogeneity-and-segmented-circuits-the-evaluation-of-scientific-publications-for-tenure-in-argentina%E2%80%99s-conicet-by-fernanda-beigel\"><a href=\"https://doi.org/10.1177/0011392114533977\">Publishing from the periphery: Structural heterogeneity and segmented circuits. The evaluation of scientific publications for tenure in Argentina’s CONICET</a> by Fernanda Beigel</h3><p>Just to mention one, I strongly recommend Fernanda Beigel’s “<a href=\"https://doi.org/10.1177/0011392114533977\">Publishing from the periphery</a>”, an article published in English in 2014 in which the sociologist delves into  her publishing circuits theory and explains why much of  Latin American Science runs through transnational or regional networks, and why Latin American Science is rarely part of mainstream circuits. </p><h3 id=\"patrones-de-publicaci%C3%B3n-en-ciencias-sociales-y-humanidades-en-argentina-multiling%C3%BCismo-regionalizaci%C3%B3n-y-evaluaci%C3%B3n-acad%C3%A9mica-by-federico-vassen\"><a href=\"https://doi.org/10.1590/SciELOPreprints.3763\">Patrones de publicación en ciencias sociales y humanidades en Argentina: multilingüismo, regionalización y evaluación académica</a> by Federico Vassen<br></h3><p>This distinctive approach to the local-global issues in the publishing system has also been reviewed by Federico Vassen in a recent article in which he observes a strong recent trend in the Latin American social sciences towards regionalization: “<a href=\"https://doi.org/10.1590/SciELOPreprints.3763\">Patrones de publicación en ciencias sociales y humanidades en Argentina: multilingüismo, regionalización y evaluación académica</a>” (“Publication patterns in the Argentinian social sciences and humanities: multilingualism, regionalization, and academic evaluation”.</p><h3 id=\"innovation-without-growth-frameworks-for-understanding-technological-change-in-a-postgrowth-era-by-mario-pansera-and-mariano-fressoli\"><a href=\"http://doi.org/10.1177/1350508420973631\">Innovation without growth: Frameworks for understanding technological change in a postgrowth era</a> by Mario Pansera and Mariano Fressoli<br></h3><p>In my personal opinion, and moving a little bit the needle, all the complicated patterns that arise in these localized studies should be read in conjunction with literature related to the global grassroots movement and/or citizen science. In this sense, I found “<a href=\"http://doi.org/10.1177/1350508420973631\">Innovation without growth: Frameworks for understanding technological change in a postgrowth era</a>”, by Mario Pansera and Mariano Fressoli, to be an incredibly rich work. In this article published in 2020, the authors show how alternative bottom up initiatives, promoted by a variety of different organizational forms, have challenged mainstream ideas about innovation and growth. This leaves, at least for me, the door open to new possible futures for Open Science in Latin America that includes participation of the public and the transformation to open scholarly-driven publishing systems.</p><h3 id=\"les-makerspaces-en-afrique-francophone-entre-d%C3%A9veloppement-local-durable-et-technocolonialit%C3%A9-by-thomas-herv%C3%A8-mboa-nkoudou\"><a href=\"https://corpus.ulaval.ca/jspui/handle/20.500.11794/67577\">Les makerspaces en Afrique francophone, entre développement local durable et technocolonialité</a> by Thomas Hervè Mboa Nkoudou<br></h3><p>Also, related to this topic, I would suggest reading Thomas Hervè Mboa Nkoudou’s doctoral thesis (2020) “<a href=\"https://corpus.ulaval.ca/jspui/handle/20.500.11794/67577\">Les makerspaces en Afrique francophone, entre développement local durable et technocolonialité: trois études de cas au Burkina Faso, au Cameroun et au Sénégal</a>” is since 2020 a must-read for any scholar interested in open research practices and citizen science.</p><h3 id=\"minimal-computing-digital-humanities-quarterly-edited-by-alex-gil-and-roopika-risam\"><a href=\"http://www.digitalhumanities.org/dhq/vol/16/2/index.html\">Minimal Computing. Digital Humanities Quarterly</a> edited by Alex Gil and Roopika Risam</h3><p>Finally, I would like to close my tabs with a volume that, from a digital humanist perspective, brings together Open Science, the humanities and equity in access to knowledge and technology <a href=\"http://www.digitalhumanities.org/dhq/vol/16/2/index.html\">The Digital Humanities Quarterly’s latest special issue</a> dedicated to minimal computing, curated and edited by Alex Gil and Roopika Risam. I had the honor of taking part in this special issue I haven’t finished reading yet, though, as I quote Gil and Risam, I can clearly see that their observations work not only for the digital humanities but also for Latin American and global open science: “minimal computing as a space wherein we can explore forms of computation that do not depend on expensive infrastructures and the harmful practices of the centers of capital accumulation in the 21st century”. </p><p>Oh, and one last tab recommendation, for the best Open/Abierto Twitter experience, follow my DOAJ Latin American co-ambassador Ivonne Lujano at <a href=\"https://twitter.com/ivonnelujano\">https://twitter.com/ivonnelujano</a>. </p><hr><p><em>For the next installment of must-read 'open tabs'. I’m tagging Thomas Hervé Mboa Nkoudou, who I admire for his work on technocoloniality of power and cognitive justice. He is, among many other activities, a researcher in Information and Communication, with interest in the Maker Movement in French Speaking African countries. Thomas Mboa is deeply engaged to promote DIYbio and democratize Biotechnology in Africa. His work with DIYBio is visible through his own biohackerspace in Cameroon: the Mboalab, which is part of the Bioeconomy Lab. Thomas also operates through the Africa Open Science & Hardware network which he co-leads, which aims to strengthen African stakeholders and catalyse grassroots innovation through Open Tech culture. Thomas is in charge of the African Institute of Open Science and Hardware launched by the AfricaOSH community.</em><br><br><br></p> "},{"id":"https://doi.org/10.54900/f121hft-tftvd9a","title":"The sustainability argument for open science? In conversation with the authors.","link":"https://doi.org/10.54900/f121hft-tftvd9a","published":"2022-08-16T07:00:27.000+00:00","description":"The climate crisis is affecting us all, and it seems like there is a role for open research to play. This year’s Open Access week stimulates us all to have more discussions on this topic with the theme “Open...","isPermalink":true,"tags":["Interviews"],"authors":[{"name":"Gisela Govaart","url":null},{"name":"Simon M. Hofmannn","url":null},{"name":"Chris Hartgerink","url":"https://orcid.org/0000-0003-1050-6809"}],"image":"https://images.unsplash.com/photo-1586596436497-8d6f8d1d921f?crop&#x3D;entropy&cs&#x3D;tinysrgb&fit&#x3D;max&fm&#x3D;jpg&ixid&#x3D;MnwxMTc3M3wwfDF8c2VhcmNofDUxfHxyZXNlYXJjaHxlbnwwfHx8fDE2NjAzMTI1MDA&ixlib&#x3D;rb-1.2.1&q&#x3D;80&w&#x3D;2000","modified":"2023-01-13T07:41:37.000+00:00","contentHtml":" <!--kg-card-begin: html--><p class='u-drop-cap-large'>The climate crisis is affecting us all, and it seems like there is a role for open research to play. This year’s Open Access week stimulates us all to have more discussions on this topic with the theme “Open for climate justice.”</p><!--kg-card-end: html--><p>Today we talk to <a href=\"https://twitter.com/GiselaGovaart\">Gisela Govaart</a> and <a href=\"https://twitter.com/HofmannZimon\">Simon Hofmann</a>, two authors of the paper <a href=\"https://doi.org/10.1525/collabra.35903\">“The Sustainability Argument for Open Science”</a> published in Collabra: Psychology (co-author <a href=\"https://twitter.com/EvelynMedawar\">Evelyn Medawar</a> was unavailable for this conversation). </p><figure class=\"kg-card kg-bookmark-card\"><a class=\"kg-bookmark-container\" href=\"https://doi.org/10.1525/collabra.35903\"><div class=\"kg-bookmark-content\"><div class=\"kg-bookmark-title\">The Sustainability Argument for Open Science</div><div class=\"kg-bookmark-description\">Ever-increasing anthropogenic greenhouse gas emissions narrow the timeframe for humanity to mitigate the climate crisis. Scientific research activities are resource demanding and, consequently, contribute to climate change; at the same time, scientists have a central role in advancing knowledge, als…</div><div class=\"kg-bookmark-metadata\"><img class=\"kg-bookmark-icon\" src=\"https://ucp.silverchair-cdn.com/Themes/Client/app/img/favicons/v-637926275942614749/apple-touch-icon.png\" alt=\"\"><span class=\"kg-bookmark-author\">University of California Press</span><span class=\"kg-bookmark-publisher\">Gisela H. Govaart</span></div></div><div class=\"kg-bookmark-thumbnail\"><img src=\"https://ucp.silverchair-cdn.com/Themes/Silver/app/img/generic-cover.png\" alt=\"\"></div></a></figure><hr><p><strong><u>Chris Hartgerink:</u></strong> Could you briefly summarize for the readers of Upstream what “the sustainability argument for open research” is?</p><p><strong><u>Gisela Govaart:</u></strong> The sustainability argument for open science is twofold: On the one hand, it is about how open science practices can help make research practices more sustainable, more environmentally friendly. On the other hand, it is about how open science practices can help improve science, in order to foster scientific progress, therefore hopefully making sure that we get to solutions for the climate crisis faster and better.</p><p><strong><u>Simon Hofmann:</u></strong> It’s two sides of the same coin: Making the scientific process more sustainable, but also more efficient.</p><p><strong><u>Chris Hartgerink:</u></strong> Because you focus on the ecological sustainability aspect, I wanted to ask you how you feel about economic and social sustainability, which are also very often discussed within sustainability? Are these also affected by this argument?</p><p><strong><u>Simon Hofmann:</u></strong> In the paper we take a broad definition of the term sustainability. For us, sustainability refers to saving natural, monetary, but also human resources that is their time, their personal investments, including their motivation. Moreover, we argue in the paper that sustainable research also means integrating people from different parts of the planet. Only this way, we can make results impactful around the globe and therefore more sustainable. Open science practices have great potential to integrate a wider spectrum of people into science, and to avoid wasting resources.</p><p><strong><u>Chris Hartgerink:</u> </strong>That's a good point to highlight. You developed this sustainability argument and it's difficult to find out your personal motivations about why you wrote this paper. We see a lot of scientists publicly worry about the climate crisis. We see people personally worried about the climate crisis. What were your motivations to develop this argument?</p><p><strong><u>Gisela Govaart:</u></strong> For me, being worried about the climate crisis is definitely part of it, this is what makes me think about the topic in the first place of course. But it is also this ideal that I have of the function of scientists in society, I think we should contribute something to society. I am doing fundamental research, which is definitely valuable for society, but I sometimes miss the engagement with important societal issues.</p><p>More practically, our motivation was that in our institute we have two grassroots initiatives: the Open Science Initiative and the Green Team (a sustainability initiative). Through conversations between these two groups we started asking ourselves the question of how these two concepts and initiatives could complement each other.</p><p><strong><u>Simon Hofmann:</u></strong> Already in my early school years, I thought that the most pressing topic of our society is climate change. And that is, sadly, already quite some time ago. The realization that very little is happening on a political and economic level over all these years, despite calls for actions on all levels, this change often must start from the bottom up. The grassroots movements at our institute, which Gisela mentioned, also reflects what we all started seeing on the streets with Fridays for Future and similar movements. This energy motivated - I think I can say - all of us to find solutions also in the sciences on an individual and systemic level.</p><p>Not only on the level of our institute but also in the whole Max Planck Society, we have a strong working group on open science, but also a very active sustainability network, in which our colleague Evelyn Medawar was involved. At a certain point we realized that open science and sustainability go hand in hand.</p><p><strong><u>Chris Hartgerink:</u></strong> That also might be a good segue to the next question. You propose the sustainability argument for open research and you say not enough is happening politically to prevent the climate crisis, to mitigate or reduce the impact that we’re having.</p><p>What role do you see for open research and for open researchers to strengthen the sustainability argument? What can researchers do to make their own work more ecologically sustainable?</p><p><strong><u>Gisela Govaart:</u></strong> That’s a good question to ask, which we also discuss a lot in our article. For all different stages of the research process, we discuss open science practices that can make researchers’ work more sustainable. For example, during study design, it is important to think about sample size, to make sure you don’t collect too little or too much data. This can for example be done with the help of power analyses and preregistrations. After the project is finished, a very fruitful way to improve the sustainability of your work is to share your data and code, such that this can be reused. </p><p>Making sure that your work is accessible is also an important point. We also discuss crowd science as a way to both increase and possibly diversify your sample. At the same time there is also an opportunity to communicate scientific facts to a bigger public, in such a way that it helps people understand the urgency of the climate crisis. This should however be done in such a way that people don't get what is called “eco anxiety.” We need to help people feel that they have agency, that they can do something. Either through individual actions or by pushing for policy changes.</p><p>Pushing for policy changes is also something that scientists can and should do. Because even though the actions of individual scientists are important, I think the real change will come from systemic change.We need to change academic incentives to make sure that people are rewarded for implementing open science practices that will make science more sustainable.</p><p><strong><u>Simon Hofmann:</u></strong> I would also stress the incentives. I think we would agree that people from all over the world can benefit, for instance, from publications being openly accessible, or when research code can be downloaded and reused. Too few researchers and institutions provide their materials, because the extra effort for opening research is often not rewarded.</p><p>Another way to strengthen the argument would be to get better information on the carbon footprint of  research projects, and to gain good estimates on how open science measures can help lower emissions. This would definitely help to convey the message on a political, systemic level to decision makers, who can make a big impact regarding the transition to more open and sustainable research.</p><p><strong><u>Chris Hartgerink:</u></strong> I hear your point that it isn't just the individual researchers — things like measuring the emission impact of a research project will help us understand that it is not just more efficient in terms of publications, but also more efficient in terms of resources. That's definitely a way to strengthen that argument.</p><p>This year’s Open Access Week theme is “Open for climate justice” (<a href=\"https://www.openaccessweek.org/\">October 24-30, 2022</a>). I wanted to ask both of you what do you hope to see or what would you like to see happen during this week?</p><p><strong><u>Gisela Govaart:</u></strong> In the theme of the Open Access Week, I see three terms: open access, climate, and justice. The justice part is an important topic for me, which I think could be highlighted more. </p><p>As an example, high Article Processing Charges (APCs) can be a huge burden for scientists from institutions that don't have the money to pay these costs, which actually makes scientific publishing more unjust. Sadly, most of the time these less privileged research groups are also often based in areas which are most affected by the climate crisis.</p><p>That would be something that I would like to see being discussed more, what are possible unintended negative side effects of open science policies, and how can they make academia more unjust. I think by critically examining our own proposals, we can make them better and more impactful for anyone in academia and not only for the lucky few like ourselves.</p><p><strong><u>Simon Hofmann:</u></strong> I think platforms such as the Open Access Week bring people together that are interested in the topic and are open to apply open science practices. It is important to improve the skill sets that people need to be open and sustainable in their research. How do I structure my experimental code to be useful for others? How can I share my research project? Where can I share its data? What are the corresponding privacy concerns? What else do I have to be aware of?</p><p>With an event like this, participants can advance these skills. But obviously, sharing this knowledge and the “how-to” material can have a lasting effect that propagates through the whole scientific community, enabling those who couldn’t join the event to participate in and benefit from open research.</p><p><strong><u>Gisela Govaart:</u> </strong>What I’d like to see during the Open Access week is that it also helps people gain knowledge about the climate crisis. But in such a way that they don't get what is called “eco anxiety.” How can we help people to feel that they have agency, that they can do something. That they can have an impact. I think that's also something that falls within open research.</p><hr><p>Thanks for reading this Upstream interview with the authors on the “<a href=\"https://doi.org/10.1525/collabra.35903\">Sustainability argument for open research</a>”.</p><p>Do you have ideas or plans for Open Access week on “Open for climate justice”? Send us an email at <a href=\"mailto:upstream@force11.org\" rel=\"noopener noreferrer\">upstream@force11.org</a> - we’d love to hear from you!</p> "},{"id":"https://doi.org/10.54900/cyrv6kk-kz45jaf","title":"Bianca Kramer is Keeping Tabs on Open Research","link":"https://doi.org/10.54900/cyrv6kk-kz45jaf","published":"2022-07-19T07:00:47.000+00:00","description":"Bianca Kramer has been scholarly communication/open science librarian at Utrecht University Library for 15 years, and recently moved to  an independent consulting/research analyst role as Sesame Open Science,...","isPermalink":true,"tags":["Open Tabs"],"authors":[{"name":"Bianca Kramer","url":"https://orcid.org/0000-0002-5965-6560"}],"image":"https://images.unsplash.com/photo-1533747122906-9ac6b6709832?crop&#x3D;entropy&cs&#x3D;tinysrgb&fit&#x3D;max&fm&#x3D;jpg&ixid&#x3D;MnwxMTc3M3wwfDF8c2VhcmNofDJ8fHRhYnxlbnwwfHx8fDE2NTgxNTUwODk&ixlib&#x3D;rb-1.2.1&q&#x3D;80&w&#x3D;2000","modified":"2023-01-12T19:23:04.000+00:00","contentHtml":" <!--kg-card-begin: html--><p class='u-drop-cap-large'><em>Bianca Kramer has been scholarly communication/open science librarian at Utrecht University Library for 15 years, and recently moved to  an independent consulting/research analyst role as <a href=\"http://www.sesameopenscience.org/\" target=\"_blank\">Sesame Open Science</a>, with a focus on open science, open metadata and open infrastructure.</em></p><!--kg-card-end: html--><hr><!--kg-card-begin: markdown--><p>Being encouraged to keep “open tabs”, has been an interesting experience - turning something that’s usually guilt-inducing (“I really should be reading this…!”) into something that at least feels productive (“Oh, I could use this for the Upstream blog!”). In the end, did I actually read more because I kept conscious track of all those open tabs? Or less, because I bookmarked the links for this blog and then neglected to read the actual content? I’ll leave that an open question... Either way, below are some of the things that caught my eye over the last month or two.</p>\n<h2 id=\"a-plea-for-polarization-or-why-we-shouldn%E2%80%99t-center-comfort-and-peace-before-justice\"><a href=\"https://doi.org/10.17613/mvjx-hg49\">A Plea for Polarization: Or Why We Shouldn’t Center Comfort and Peace Before Justice</a></h2>\n<p><em>By Dave Ghamandi.</em></p>\n<p>It is a short, annotation-style critique of this (data-walled) <a href=\"https://www.timeshighereducation.com/opinion/open-access-loses-when-publishers-are-vilified\">opinion article</a> of Amy Brand in Times Higer Education (THE) that is worth reading as well. While I don’t necessarily agree with Dave’s entire reading of Amy’s piece, I very much recognize the discomfort around seeking ‘common ground’ in discussions on open access and scholarly publishing, rather than making differences in perspective and interest explicit. It’s why I thought this was a thought-provoking short read.</p>\n<h2 id=\"putting-the-%E2%80%9Csocial%E2%80%9D-back-in-social-enterprise-an-evidence-based-approach\"><a href=\"https://doi.org/10.32920/20171297.v1\">Putting the “Social” Back in Social Enterprise: An Evidence-Based Approach</a></h2>\n<p><em>By Reece Steinberg</em><sup class=\"footnote-ref\"><a href=\"#fn1\" id=\"fnref1\">[1]</a></sup>.</p>\n<p>I was interested in this piece because of the often invoked division (especially in the field of scholarly communication) between commercial companies (bad!) and non-profit organizations (good!). I think this is too simplistic (e.g. with some non-profits operating as de facto commercial organizations) and leaves little room for nuance. The concept of ‘social enterprises’ offers an interesting perspective on how commercial companies could also work for the common good, not just for profit. However, as the article illustrates, not all social enterprises are created (and operated) equal. So, the proposed research-based framework to evaluate social enterprises could be a very useful approach. As an aside, charitable organizations (e.g. funders) are another area where easy distinctions between ‘good’ and ‘bad’ actors fail to address issues of power, accountability and effect - which is why Anand Giridharadas’ <a href=\"https://en.wikipedia.org/wiki/Winners_Take_All:_The_Elite_Charade_of_Changing_the_World\">Winners Take All: The Elite Charade of Changing the World</a> - is also on my reading list.</p>\n<h2 id=\"reinventing-w3c-governance\"><a href=\"https://berjon.com/w3c-governance/\">Reinventing W3C Governance</a></h2>\n<p><em>By Robin Berjon.</em></p>\n<p>A longread on how an organisation as W3C (the main international standards organisation for the world wide web) could or should be governed. It touches on the values and practicalities of being a member-based organisation (where members pay to join, in exchange for which they get some member-only rights) vs. community-driven organisation (where the question of who has voice  is separated from the funding model(s) used). In addition, it also covers the role of values in how an organisation operates, arguing that values should be defined so that they can guide decision-making, especially when dealing with so-called ‘wicked problems’.</p>\n<p>The third interesting point in the article is on infrastructure governance, with thoughts on how to ensure that “infrastructure does get provided (ie. that it is economically viable for various actors to provide it, either in a market setting or through some other means) and that providing infrastructure cannot be leveraged as power over infrastructure users.”. It points to literature on commons as a source of thinking on organizing infrastructure governance, when “defining voluntary standards and letting the market sort things out” is not sufficient.</p>\n<p>All of this resonated with me beyond the specific application to W3C, as these questions have been at the center of many discussions around governance of infrastructure for scholarly communication that I’ve been involved in or have followed over the years.</p>\n<hr>\n<p>So far, my selection of ‘open tabs’ turned out to be all about conceptual discussions on how to organize scholarly communication both effectively and equitable, taking into account the effects of existing power structures. It’s a good reminder to myself to spend the time reading and thinking about these topics.</p>\n<p>I’ll finish off with two short reading recommendations that touch upon two other topics I’m very much interested in: metadata and approaches to research assessment. One of these is on persistent identifiers, and one is a very personal piece reflecting on the recent REF (Research Evaluation Framework) cycle in the UK:</p>\n<h2 id=\"oai-identifiers-decentralised-pids-for-research-outputs-in-repositories\"><a href=\"https://www.slideshare.net/petrknoth/oai-identifiers-decentralised-pids-for-research-outputs-in-repositories\">OAI Identifiers: Decentralised PIDs for Research Outputs in Repositories</a></h2>\n<p>A presentation by Peter Knoth from CORE at the recent Open Repositories 2022 conference, in which he makes an interesting plea for wider use of OAI identifiers, rather than generating DOIs for repository content.</p>\n<h2 id=\"tales-from-ref-central-reflections-from-ref-results-week\"><a href=\"https://www.hepi.ac.uk/2022/05/26/tales-from-ref-central-reflections-from-ref-results-week/\">Tales from REF Central: Reflections from REF results week</a></h2>\n<p>By Elizabeth Gadd. As expected, Lizzie has lots of sensible things to say about how (not) to approach the results of an exercise like the REF. But what stood out to me most was the focus on the free labour and emotional costs involved in this approach to research assessment - the “faces appearing ghost-like in the spreadsheet cells”. Go read it, it’s a powerful piece.</p>\n<hr>\n<p>And totally outside the realm of scholarly communication, I could not finish this blog post without mentioning the one tab I’ve had open most consistently - the pattern for <a href=\"https://www.ravelry.com/patterns/library/sashiko-happy-coat\">this challenging project</a> that I hope to be able to show the result of at some point in future! 🧵</p>\n<p><em>For the next installment of must-read 'open tabs'. I’m tagging Gimena del Rio Grande, who I admire for her work on multilingualism, diversity and representation in scholarly communication. She is, among many other activities, director of the Laboratorio de Humanidades Digitales HD CAICYT LAB (CONICET), a DOAJ Ambassador for Latin America, and one of the initiators of the <a href=\"https://force11.org/groups/open-multilingual-and-global-scholarly-communication-omg/\">Open, Multilingual and Global Scholarly Communication working group</a> of FORCE11.</em></p>\n<p><em>I’m looking forward to hearing what’s on her reading list!</em></p>\n<hr class=\"footnotes-sep\">\n<section class=\"footnotes\">\n<ol class=\"footnotes-list\">\n<li id=\"fn1\" class=\"footnote-item\"><p>This article was originally published in <a href=\"https://nonprofitquarterly.org/\">Nonprofit Quarterly</a>, but was subsequently taken down at the request of one of the parties discussed in the article <a href=\"#fnref1\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n</ol>\n</section>\n<!--kg-card-end: markdown--> "}]}