{"version":"https://jsonfeed.org/version/1.1","id":"sxp4r07","title":"Daniel S. Katz's blog","description":null,"language":"en","license":"https://creativecommons.org/licenses/by/4.0/legalcode","category":"Engineering and Technology","homePageUrl":"https://danielskatzblog.wordpress.com","feedUrl":"https://danielskatzblog.wordpress.com/feed/","favicon":"https://s0.wp.com/i/buttonw-com.png","generator":"http://wordpress.com/","items":[{"id":"http://danielskatzblog.wordpress.com/?p=1703","title":"Evaluating research software proposals","link":"https://danielskatzblog.wordpress.com/2023/02/27/evaluating-research-software-proposals/","published":"Mon, 27 Feb 2023 12:00:28 +0000","description":"Research software is an essential part of most research today, as I&#8217;ve written about before. One of the important models that allows people to develop and maintain it is grant funding: someone proposes...","isPermalink":false,"tags":["RSE","open source","peer review","software"],"authors":[{"name":"danielskatz","url":null}],"image":"https://0.gravatar.com/avatar/3f59e90625547fce79de3e9c0d46867d?s=96&d=identicon&r=G","modified":null,"contentHtml":"\n<p>Research software is an essential part of most research today, as I&#8217;ve written about before. One of the important models that allows people to develop and maintain it is grant funding: someone proposes building and/or maintaining software to a funder as an effort that aligns with the funder&#8217;s mission and programs. The funder, which could be a public agency, a philanthropic organization, a company, etc., then needs to evaluate the proposal, but how should this be done? What are current good/best practices?</p>\n\n\n\n<p>This topic has come up in discussion in the <a href=\"https://www.researchsoft.org/funders-forum/\">Research Software Funders Forum</a> over the past several months, where funders of research software come together and talk to each other. I&#8217;ve been a facilitator of this discussion, which has given me the opportunity to think about some of the points that are made, and I also spent four years co-running a <a href=\"http://nsf.gov/si2\">research software funding program</a> at the US <a href=\"https://www.nsf.gov/\">National Science Foundation</a>, so I have some of my own opinions as well. It has been a pleasure to hear about the efforts of various global funders in this area, including <a href=\"https://chanzuckerberg.com/eoss/\">The Chan Zuckerberg Initiative&#8217;s Essential Open Source Software for Science (EOSS) program</a> and <a href=\"https://fapesp.br/index.php/en/escience\">FAPESP&#8217;s Research Program on eScience and Data Science</a>. My thinking has also been influenced by <a href=\"https://doi.org/10.5281/zenodo.7330542\">a November workshop</a> in Amsterdam hosted by the <a href=\"https://www.researchsoft.org/\">Research Software Alliance (ReSA)</a> and the <a href=\"https://www.esciencecenter.nl/\">Netherlands eScience Center</a> to set the future agenda for national and international funders to support sustainable research software, and a preceding workshop organized by Tom Honeyman of the <a href=\"https://ardc.edu.au/\">Australian Research Data Commons</a>, as well as many talks and discussion in those two meetings, in particular talks by Carole Goble, Fabio Kon, and Rob van Nieuwpoort.</p>\n\n\n\n<p>This post is not intended to solve this challenge, as I&#8217;m not a funder today (except in a limited way through some internal opportunities at my own institution, <a href=\"https://www.ncsa.illinois.edu/\">the National Center for Supercomputing Applications (NCSA) at the University of Illinois Urbana Champaign</a>), but rather to propose a set of aspects that funders might choose to collectively address in the future.</p>\n\n\n\n<p>Note: a large issue I&#8217;m mostly going to ignore is that software is an element of many proposals. While some proposals are explicitly aimed at software, a large fraction of other proposals also include some software development, and this may or may not be made explicit and/or highlighted in the proposal, depending on if the proposers think it is important enough (given typical space limits in proposals) and also based on how the proposers think software work will be seen in the evaluation process.</p>\n\n\n\n<p><strong>Evaluation issues</strong></p>\n\n\n\n<p>As stated previously, there are a variety of practices to evaluate proposals that involve research software, and they have multiple aspects that we can examine.</p>\n\n\n\n<p>One aspect is simply how they compare with research review practices outside of software. For example, peer review is a useful input into making funding decisions, though some funders may rely more on internal expertise. There are a variety of ways in which such peer reviews can be performed, including asynchronously and synchronously, which can be virtual, hybrid, or in-person. Proposals can be reviewed independently or in groups (panels). Other variables include the number of reviewers per proposal and per group and their expertise, and for opportunities that continue over multiple years, if reviewers have any continuity with such opportunities or specific panels. Each of these options may have different advantages and disadvantages for software proposals than other types of proposals.</p>\n\n\n\n<p>In terms of reviewer expertise, in some sense most research software projects can be viewed as multidisciplinary, including at least one subject area and a set of software skills. Of course, many projects include multiple subject areas as well, and they may include a subject area in which the software is developed, plus more areas where the software can be used, such as computer science, mathematical, or statistical software that can have wide applicability. Review processes would benefit from reviewers who collectively have all relevant sets of expertise: software development, the subject area(s) in which the software is being developed, and the subject area(s) in which the software will be used.</p>\n\n\n\n<p>Another aspect is review criteria, which may need to be reconsidered or at least thought of differently for software than for research, in part, because software is not purely research but is also infrastructure. As infrastructure, while it may have scholarly novelty, it also may have more inherent utility than novelty, and this is not typically something that research funders and peer reviews select for. At NSF, I encouraged reviewers to think about the intellectual merit review criterion in terms of how the software would lead others to generate new knowledge, in addition to considering how the software itself contained new knowledge, and this was incorporated into guidance for the SI2 program, though reviewers and program officers could choose how to take this..</p>\n\n\n\n<p>The model of much research, where the research is done, and the results are captured in an artifact such as a publication or in human knowledge, does not really fit software, where software can be both the research and the knowledge artifact. Additionally, unlike publications, software as an executable object is subject to <a href=\"https://doi.org/10.1109/MCSE.2019.2900945\">collapse</a>, where it will stop working if not actively maintained. For a software knowledge artifact to be most useful after a research project ends, there must be some plan for how it will be sustained. This concept has been considered by some funders who now require data management plans (DMPs), but <a href=\"https://doi.org/10.7287/peerj.preprints.2630v1\">software is not just data</a>, and software proposals probably need either additional software management plans (SMPs), as are <a href=\"https://www.esciencecenter.nl/news/the-practical-guide-to-software-management-plans-now-available/\">now being discussed</a>, or more general outputs/artifact management plans (which could also be a way of thinking about open access publications).&nbsp;</p>\n\n\n\n<p>In terms of the technical review of software itself, <a href=\"https://ropensci.org/\">rOpenSci</a> has defined a set of software peer review practices, which have been adapted by a set of software journals, including the <a href=\"https://joss.theoj.org/\">Journal of Open Source Software</a>, the <a href=\"https://openresearchsoftware.metajnl.com/\">Journal of Open Research Software</a>, and <a href=\"https://www.softxjournal.com/\">SoftwareX</a>, as well as other communities such as <a href=\"https://www.pyopensci.org/\">pyOpenSci</a>. This is leading to a community consensus on how to review software. However, which of these practices and criteria make sense to embed in a software proposal review process is currently unclear.</p>\n\n\n\n<p><strong>Next steps</strong></p>\n\n\n\n<p>My goal is that some of the research funders working in this space will start meeting to discuss these issues, ideally working towards a set of practices for the evaluation of research software proposals, with guidance to understand when and why different practices fit a particular situation. I also think that members of the research software community (developers, maintainers, and users) would be good contributors to such a process. One option for this type of community gathering would be a ReSA working group. There also might be value in a more intense meeting on this topic, whether physical or not, and of course, both a working group and a meeting could occur and benefit each other. If you’re interested in being part of such a group then please let me know.</p>\n\n\n\n<p><strong>Next steps</strong></p>\n\n\n\n<p>Thanks to Michelle Barker, Tom Honeyman, and Rajiv Ramnath for useful comments on an earlier draft of this post.</p>\n"},{"id":"http://danielskatzblog.wordpress.com/?p=1695","title":"How groups can immediately benefit when new members join","link":"https://danielskatzblog.wordpress.com/2022/10/31/new-group-members/","published":"Mon, 31 Oct 2022 14:41:41 +0000","description":"When thinking about a group adding a new person, we often think that while the group will benefit from adding the new person in the long run, there is a cost to the group in the initial period. But I want to...","isPermalink":false,"tags":["RSE"],"authors":[{"name":"danielskatz","url":null}],"image":"https://0.gravatar.com/avatar/3f59e90625547fce79de3e9c0d46867d?s=96&d=identicon&r=G","modified":null,"contentHtml":"\n<p>When thinking about a group adding a new person, we often think that while the group will benefit from adding the new person in the long run, there is a cost to the group in the initial period.</p>\n\n\n\n<p>But I want to suggest that the act of adding a new person also has immediate benefits to the group, as a new person who doesn&#8217;t know the practices and culture of the group can reflect on them as they learn them, ideally leading to lessons and improvements for the whole group.</p>\n\n\n\n<p>We can think about this in a few different ways. One considers the group&#8217;s on-boarding process: how new people are brought in. The new person, if offered the opportunity, can highlight problems that they find with that process. If the on-boarding process is written down, the new person can test it, and at the least, can provide feedback on what parts are incorrect or don&#8217;t make sense. If the on-boarding documentation system permits it (e.g., it&#8217;s on a wiki), the new person can actually improve the documentation of the process, and thus, the process. For this to work, the group must be welcoming in general, and welcoming of such feedback in particular. And of course, everything the new person says isn&#8217;t going to be right for the group, but the fact that they point at something as a possible problem is something the group should consider.</p>\n\n\n\n<p>Similarly, the new person will learn things that are not documented about the group, which includes the culture and practices of the group. A group that is self-reflective and welcomes feedback will provide opportunities for the new person to talk about things they find that seem odd or unexpected to them, and to discuss what they expected instead, which can lead to the new person getting a better understanding of why these things are the way they are, or the group realizing that there is a better way to do some things and changing to that way.</p>\n\n\n\n<p>This also holds for projects, for example, software projects. Each new person coming onto the project represents a new user first experiencing the project. For a project that wants to be as appealing as possible to new users, taking advantage of this fact along with the fact that the new project member has a built-in channel to communicate about any issues that the average new user does not have is an opportunity to improve the project. This requires the project to be welcoming and open in terms of communication, and to actively seek out this feedback from the new project member, asking them to test documentation, instructions, guidance, examples, tutorials, APIs, GUIs, etc. and creating methods to get feedback on these tests and to act on it.</p>\n\n\n\n<p>I&#8217;ve written this post because I realize I don&#8217;t always do a good job of taking advantage of the new people who come into my own projects and group, and want to remind myself to do this; I hope this is also useful for others.</p>\n\n\n\n<p>Thanks to Kenton McHenry and Zhao Zhang for some feedback on this post.</p>\n\n\n\n<p></p>\n"},{"id":"http://danielskatzblog.wordpress.com/?p=1692","title":"How does research software fit with the open-source software community?","link":"https://danielskatzblog.wordpress.com/2022/10/06/research-software-and-open-source/","published":"Thu, 06 Oct 2022 18:13:52 +0000","description":"While at the Chan-Zuckerberg Initiative’s Open Science 2022 Annual Meeting a couple of weeks ago, I was struck by a comment from Demetris Cheatham about how she hadn’t known about the scientific open-source...","isPermalink":false,"tags":["RSE"],"authors":[{"name":"danielskatz","url":null}],"image":"https://0.gravatar.com/avatar/3f59e90625547fce79de3e9c0d46867d?s=96&d=identicon&r=G","modified":null,"contentHtml":"\n<p>While at the <a href=\"https://twitter.com/cziscience/status/1572678385138270208?s=20&t=7cRIHyEvUEhj4S8glzCnRg\">Chan-Zuckerberg Initiative’s Open Science 2022 Annual Meeting</a> a couple of weeks ago, I was struck by a comment from <a href=\"https://twitter.com/dwcheatham\">Demetris Cheatham</a> about how she hadn’t known about the scientific open-source community until she was introduced to it fairly recently, even though she has a huge amount of experience with the larger open-source community. This was especially confounding when she shared that she realized upon learning about us that the voice of our community was missing from <a href=\"http://allinopensource.org/\">her work</a> to create a more inclusive environment within open source.</p>\n\n\n\n<p>One tricky aspect here is that I prefer to talk about the “the research software community” instead of the “scientific open-source community”, because “research” is a more general term than “scientific”, and because while open-source is the dominant type of license, and the one I generally prefer, there is also important research software, particularly at the disciplinary level, that is not open source.</p>\n\n\n\n<p>Demetris’s comment, and some others that came up in the meeting, made me think about how the open-source community can be understood, particularly in relation to the research software community.</p>\n\n\n\n<p>One question is how is the overall open-source community defined? Perhaps it’s purely by license: software that uses licenses that have been approved by the Open Source Initiative.</p>\n\n\n\n<p>A more challenging question is what are the parts of the community? To me, this includes where the research software community fits into the open-source community, as one part of it. But then what are the other parts? If we were to create a Venn diagram of the community, with research software as one of the circles, what would the other circles be, and how would they be laid out in relationship to each other?</p>\n\n\n\n<p>I think such a discussion and diagram would be quite useful, as there are important characteristics of the research software community that are different than those of other communities, such as the frequent desire for academic credit (in the form of citations) by its developers, which is not the case for most other software. Because of the dependency web of open-source projects, many not research projects may depend on research software, and thus understanding the differences is important to the overall community.</p>\n\n\n\n<p>As far as I know, this type of understanding of open-source software and the role of research software within it does not exist or if it does, it’s not widespread.</p>\n\n\n\n<p>While at the CZI meeting, I talked briefly with&nbsp;<a href=\"http://abbycabs.github.io/\">Abigail Cabunoc Mayes</a>&nbsp;who works at GitHub and asked her about how GitHub classifies open-source communities. She initially responded that this was done by language (Python, R, etc.) and then added it is also done by geography.</p>\n\n\n\n<p>The research community also could be classified by language and geography, and this might make sense for some fundamental research software, but at higher&nbsp;<a href=\"https://doi.org/10.1109/MCSE.2019.2900945\">levels of the research software stack</a>, discipline (astronomy, chemistry, bioinformatics, linguistics, etc.) is also quite important.</p>\n\n\n\n<p>I don’t have any answers here: this is an open question, where I hope to find others who have thought about this and come up with ideas of how to represent these software communities. And if not, does anyone want to work together on this?</p>\n"},{"id":"http://danielskatzblog.wordpress.com/?p=1688","title":"Benefits of sharing code with articles","link":"https://danielskatzblog.wordpress.com/2022/06/15/benefits-of-sharing-code-with-articles/","published":"Wed, 15 Jun 2022 20:22:13 +0000","description":"I’m writing this blog post in preparation for a contribution to the upcoming RDA Plenary 19 session “BoF: Sharing code that supports research articles: is it time to align goals and publisher policies?”...","isPermalink":false,"tags":["Uncategorized","credit","open science","reproducibility","software"],"authors":[{"name":"danielskatz","url":null}],"image":"https://0.gravatar.com/avatar/3f59e90625547fce79de3e9c0d46867d?s=96&d=identicon&r=G","modified":null,"contentHtml":"\n<p>I’m writing this blog post in preparation for a contribution to the upcoming RDA Plenary 19 session “<a href=\"https://www.rd-alliance.org/sharing-code-supports-research-articles-it-time-align-goals-and-publisher-policies\">BoF: Sharing code that supports research articles: is it time to align goals and publisher policies?</a>” at&nbsp;<a href=\"https://www.timeanddate.com/worldclock/fixedtime.html?msg=RDA+19th+Plenary+Breakout+6&iso=20220623T0030&p1=1440&ah=1&am=30\">0030 UTC on 23 June</a>. I want to talk about how and why software (code) is shared.</p>\n\n\n\n<p><strong>Publishers</strong></p>\n\n\n\n<p>When we think about different stakeholders who are trying to influence the way software is developed and shared, we can consider publishers, who are beginning to require software citation, and in some cases, some types of code sharing as well, as an element that supports published papers. This can enable a variety of positive rewards, including:</p>\n\n\n\n<ul><li>Validation: code sharing enables others to be able to understand (to read and analyze) the computational parts of the work done in the article. This requires the source code to be available (archived) as long as the article is available.</li><li>Reproducibility: code sharing enables others to be able to reproduce (run) the computational parts of the work done in the article. This requires the code to be available (runnable) as long as the article is available, which in turn requires correct versions of dependencies to be available and the build system to work, or the code be frozen virtually, such as in a container.</li><li>Reusability: code sharing enables others to be able to build on code used in the computational parts of the work done in the article, for their own work. This has the same requirements as reproducibility, and also requires solid documentation and examples/training, and ideally, a modular software design.</li><li>Expandability/contributability: code sharing enables others to be able to add to the code used in the computational parts of the work done in the article, to improve it. This requires a working version of code and dependencies to be available, and the code authors to be maintainers who are willing to collaborate with their communities on code.</li><li>Credit: code sharing enables others to be able to cite the software and credit its authors when they use it. This requires clear metadata for the software to exist, stored in an accessible and interpretable (by humans and machines) way.</li></ul>\n\n\n\n<p><strong>Funders</strong></p>\n\n\n\n<p>In addition, we can also think about funding agencies, which have a mixed record in terms of requirements for software sharing.</p>\n\n\n\n<p>For example, NIH has recently created a<a href=\"https://grants.nih.gov/grants/guide/notice-files/NOT-OD-21-013.html\">&nbsp;new policy for data management and sharing</a>&nbsp;(starting Jan 2023), replacing the existing policy that&#8217;s from 2003. This new policy “requires researchers to prospectively plan for how scientific data will be preserved and shared through submission of a Data Management and Sharing Plan.” However, NIH does not have any clear policy for software. There is a&nbsp;<a href=\"https://sharing.nih.gov/other-sharing-policies/research-tools-policy\">Research Tools Policy</a>, but it seems to have been written to make it hard to understand what it applies to. For example, it doesn’t mention software or code explicitly. It does, however, point to a&nbsp;<a href=\"https://sharing.nih.gov/sites/default/files/flmngr/Research_Tools_Federal_Register.pdf\">Federal Register item from 1999</a>&nbsp;that, in a footnote, says “Databases and materials subject to copyright, such as software, are also research tools in many contexts. Although the information provided here may be applicable to such resources, the NIH recognizes that databases and software present unique questions which cannot be fully explored in this document.”</p>\n\n\n\n<p>While NSF does not have specific detailed requirements about sharing software, high-level requirements in the&nbsp;<a href=\"https://www.nsf.gov/pubs/policydocs/pappg22_1/pappg_11.jsp\">NSF&nbsp;Proposal & Award Policies & Procedures Guide (PAPPG), 2021, Chapter XI.D.4</a>&nbsp;include:</p>\n\n\n\n<ul><li>c. Investigators and grantees are encouraged to share software<strong>&nbsp;</strong>and inventions created under the grant or otherwise make them or their products widely available and usable.</li><li>d. NSF normally allows grantees to retain principal legal rights to intellectual property developed under NSF grants to provide incentives for development and dissemination of inventions, software, and publications that can enhance their usefulness, accessibility and upkeep. Such incentives do not, however, reduce the responsibility that investigators and organizations have as members of the scientific and engineering community, to make results, data and collections available to other researchers.</li></ul>\n\n\n\n<p>An example of a forward-looking policy is the current work <a href=\"https://www.esciencecenter.nl/national-guidelines-for-software-management-plans/\">towards national guidelines on Software Management Plans in the Netherlands</a>. This group has released a&nbsp;<a rel=\"noreferrer noopener\" href=\"https://docs.google.com/document/d/1TjUxWOPKQbkxDX7rUU-hIFB2ifNsvJGi2orNHh9mTeA/edit\" target=\"_blank\">draft set of guidelines</a>&nbsp;for community consultation (through 20 June 2022), and I expect this to lead to a requirement for Software Management Plans in the near future.</p>\n\n\n\n<p><strong>Institutions</strong></p>\n\n\n\n<p>In addition to funders and publishers, we can also think about Institutions, specifically the institutions that employ researchers, such as universities, laboratories, and governments. Some of these institutions have a mission of benefitting society, and it seems that they should care about sharing software to serve this mission. However, in practice, there are few institutions with policies that support this, such as evaluation of such software work in hiring, promotion, and tenure. In part, this is because such a goal of sharing knowledge may be seen as conflicting with other goals, such as profiting from institutionally developed intellectual property or other financial incentives. An example of this is university technology transfer offices that seek to maximize profit rather than maximizing the transfer of technology.</p>\n\n\n\n<p><strong>Professional societies</strong></p>\n\n\n\n<p>While many professional societies are publishers (as discussed above), they are also the disciplinary communities in which accepted practices can be documented and disseminated. For example, ACM’s policies on&nbsp;<a href=\"https://www.acm.org/publications/policies/artifact-review-and-badging-current\">artifact review and badging</a>&nbsp;can be viewed as a policy for ACM publications, but they also are a set of practices that this part of the computer science community is converging towards, applying to more than just ACM publications. And in Earth science, AGU’s guidelines on&nbsp;<a href=\"https://www.agu.org/Publish-with-AGU/Publish/Author-Resources/Data-and-Software-for-Authors\">Software and Data for Authors</a>&nbsp;were partially derived from ESIP’s&nbsp;<a href=\"https://doi.org/10.6084/m9.figshare.8441816.v1\">guidelines</a>, which are intended to be discipline-wide and not specific to any one publisher.</p>\n\n\n\n<p><strong>Conclusions</strong></p>\n\n\n\n<p>Many different stakeholders have been making progress on guidelines for sharing data associated with publications, and progress by one is often discussed in forums such as Research Data Alliance plenaries and working/interest groups. The state of guidelines for software is less advanced and less coordinated, though there are good steps being made by individual stakeholders and some coordination, such as in this <a href=\"https://www.rd-alliance.org/sharing-code-supports-research-articles-it-time-align-goals-and-publisher-policies\">RDA plenary session</a> and in other venues such as the <a href=\"https://www.researchsoft.org/\">Research Software Alliance (ReSA)</a>. I look forward to continued progress by individual organizations and increased collaboration, leading to community-accepted policies and practices for software sharing.</p>\n"},{"id":"http://danielskatzblog.wordpress.com/?p=1680","title":"Progress on Software Management Plans in the Netherlands","link":"https://danielskatzblog.wordpress.com/2022/05/31/progress-on-software-management-plans-in-the-netherlands/","published":"Tue, 31 May 2022 13:04:19 +0000","description":"I&#8217;m very pleased to see that the Netherlands group working on &#8220;Software Management Plans: Towards national guidelines&#8221; has released a draft set of guidelines for community consultation...","isPermalink":false,"tags":["Uncategorized"],"authors":[{"name":"danielskatz","url":null}],"image":"https://0.gravatar.com/avatar/3f59e90625547fce79de3e9c0d46867d?s=96&d=identicon&r=G","modified":null,"contentHtml":"\n<p>I&#8217;m very pleased to see that the <a rel=\"noreferrer noopener\" href=\"https://www.esciencecenter.nl/national-guidelines-for-software-management-plans/\" target=\"_blank\">Netherlands group</a> working on &#8220;Software Management Plans: Towards national guidelines&#8221; has released a <a rel=\"noreferrer noopener\" href=\"https://docs.google.com/document/d/1TjUxWOPKQbkxDX7rUU-hIFB2ifNsvJGi2orNHh9mTeA/edit\" target=\"_blank\">draft set of guidelines</a> for community consultation (through 20 June 2022) and is organizing a workshop on 9 June to test and discuss the guidelines with use cases from the research community: <a rel=\"noreferrer noopener\" href=\"https://www.eventbrite.com/e/software-that-makes-you-proud-using-smps-tickets-341888165707\" target=\"_blank\">https://www.eventbrite.com/e/software-that-makes-you-proud-using-smps-tickets-341888165707</a>.</p>\n\n\n\n<p>As I wrote in 2016 following my 4-year term of working as a program officer at NSF, I believe that <a href=\"https://danielskatzblog.wordpress.com/2016/04/13/data-and-software-management-plans-must-be-public-and-should-be-machine-readable/\">Data and Software Management Plans must be public and should be machine-readable</a>. In that post, I recommended that:</p>\n\n\n\n<p><strong>The science community (reviewers and program officers) needs to thoughtfully&nbsp;consider, at all stages of proposal review and project management,&nbsp;the public interest and NSF’s requirement&nbsp;that investigators and organizations have the&nbsp;responsibility as members of the scientific and engineering community to&nbsp;make results, data, and collections available to other researchers.</strong></p>\n\n\n\n<p><strong>Software and data management plans should be public documents, stored as archival documents like papers, software, or datasets, so the record of what projects planned can be later verified by other scientists, including peer-reviewers of future projects by the same investigators.</strong></p>\n\n\n\n<p>In the next week, I plan to go through the draft guidelines to consider how they would effect the changes I want to see:</p>\n\n\n\n<ol><li>Software that is produced has a plan for how it will be maintained over time so that others can use it, for reproducibility and for new work.</li><li>The Software Management Plan (SMP) includes a minimum time limit for the maintenance that will be performed.</li><li>The SMP includes the source of resources to perform this maintenance.</li><li>The guidelines encourage open source software, but do not strictly require it, as this needs to be balanced with other goals.</li><li>New software is not developed when it would be more cost-efficient and better for the overall community to contribute to already-existing software.</li><li>Software management plans are made public and machine readable, so that they can be referenced and it is easy to verify if they are being carried out.</li></ol>\n\n\n\n<p>If you are interested in research software, I urge you to also consider and comment on <a href=\"https://docs.google.com/document/d/1TjUxWOPKQbkxDX7rUU-hIFB2ifNsvJGi2orNHh9mTeA/edit#heading=h.3ydtwj3x43q8\">these draft guidelines</a> by 20 June 2022.</p>\n"},{"id":"http://danielskatzblog.wordpress.com/?p=1677","title":"Software is a process, not a series of products: the failure of traditional metrics","link":"https://danielskatzblog.wordpress.com/2022/03/21/software-is-a-process/","published":"Mon, 21 Mar 2022 20:44:01 +0000","description":"(by Daniel S. Katz and Tom Honeyman) There are a number of challenges in rewarding scholars for their work in software, including the fact that both software itself and the idea of it being of scholarly value...","isPermalink":false,"tags":["RSE","credit","open source","software"],"authors":[{"name":"danielskatz","url":null}],"image":"https://0.gravatar.com/avatar/3f59e90625547fce79de3e9c0d46867d?s=96&d=identicon&r=G","modified":null,"contentHtml":"\n<p class=\"has-text-align-center\">(by Daniel S. Katz and Tom Honeyman)</p>\n\n\n\n<p>There are a number of challenges in rewarding scholars for their work in software, including the fact that both software itself and the idea of it being of scholarly value are relatively new, particularly given the centuries of experience we have with journals and the Humboldtian university model.</p>\n\n\n\n<p><strong>Traditional scholarly research and metrics</strong></p>\n\n\n\n<p>Much scholarly research can be considered either hypothesis-driven or exploratory. These types of research projects typically have some starting point (e.g., is x true?, how does y work?) and some ending point (e.g., x is true, z is a key mechanism for how y works). This research is often done at least semi-privately, with the results being shared publicly in the form of a paper, perhaps with data or software also being shared in cases where this is possible.</p>\n\n\n\n<p>Our scholarly metrics and recognition system is built to support this model, based on the idea that research is a cycle of periods of effort marked by outputs, with grants being given to support these periods of effort, and citation of these outputs being used to measure their value and reward the scholars for their efforts.</p>\n\n\n\n<p>Each of these efforts typically has an identifiable set of scholars involved, and these scholars are usually named as the authors of the outputs. These outputs are stable, rarely revised, and don’t tend to add authors over time.</p>\n\n\n\n<p>Imagine a new project that includes a subset of the scholars who worked on the previous effort on which it builds. This subset will likely be authors of the output (paper) about this new project, and the other scholars from the previous effort will be recognized by citing the paper from the previous project. Even if the new work could not have been done without their effort, if they haven&#8217;t been directly involved in it, they will not expect to be considered as authors.</p>\n\n\n\n<p>Scholars, including students, may be expected to produce outputs on an annual cycle, in some cases being driven by annual conferences that in some sense are clubs of scholars in subdisciplines. This drives the idea of minimal scholarly units of work, i.e., the minimum amount of progress that must be made to lead to a new publication. The paper system discourages this type of publication, sometimes referred to as salami-slicing, but this is partially because such paper publication generally involves a single set of authors &#8220;gaming&#8221; the system to get multiple units of credit for one unit of work.</p>\n\n\n\n<p>It is common practice in publications for the authors to fully identify themselves, to associate the work with author affiliations and funding that supports the work. This has allowed for the development of metrics based on this detail.</p>\n\n\n\n<p>This idea is implicit in metrics such as the h-index, where a count is made of the units of effort that are sufficiently valuable to others that their outputs are cited by some number.</p>\n\n\n\n<p><strong>Software is different</strong></p>\n\n\n\n<p>However, software, particularly open source software, is different. It occurs in a more continuous process of development, and is also more open, where scholars who are not the main developers can use it, or can contribute to it at any point, not just when the main developers declare it finished.</p>\n\n\n\n<p>Of course, most software that is in use is never &#8220;finished.&#8221; To avoid software collapse as underlying dependencies (both hardware and software) change, to fix bugs, and to add new features, software must be changed. These changes can occur multiple times per day, and every change could potentially be made by a new contributor. This can lead to many versions that may only have small differences from each other, though unlike papers, the set of authors can be different.&nbsp;</p>\n\n\n\n<p>Users need to cite the specific version they used to indicate precisely what they used, and credit its developers. To do so, amongst other things, full and robust identification of authors, affiliations, and funding sources is needed, though this information is rarely provided by developers.</p>\n\n\n\n<p>In cases of open development, software can be associated with an open-ended community who come together in both a planned and ad hoc way to develop, maintain, use, and improve it, with social aspects related to both creation and usage, which can lead to new versions with new authors. This is unlike the typical paper where social aspects are only related to usage (reading) and the “response” is usually another paper.</p>\n\n\n\n<p>Additionally, software is often used in an automated way, brought into an assemblage of software via package management. These &#8220;imports&#8221; can be mostly tracked, but are not part of the scholarly metrics system today.&nbsp; And they are not tied to authors, since authorship is not tracked by package management systems or by revision control systems. (While repository contributions are tracked, these are not the same as authorship contributions, as some repository contributions, e.g., typo fixes, may not be sufficient for authorship, and some authorship contributions, e.g., design, may not appear in the repository.)</p>\n\n\n\n<p><strong>Need for new metrics and practices</strong></p>\n\n\n\n<p>Because of these differences, existing metrics that work for a small set of products (papers, many datasets) do not work for software. This means that the overall credit/recognition that has been built for papers, and that seems to be able to work for datasets, does not work for software, and that changes are needed, specifically around manually or semi-manually capturing authorship at the time of development within the code environment (perhaps via something like <a href=\"https://allcontributors.org/\">All Contributors</a> as well as via <a href=\"https://citation-file-format.github.io/\">citation metadata</a>) and capturing software usage in other software through some automated means (perhaps via something like <a href=\"https://libraries.io/\">Libraries.io</a> or <a href=\"https://deps.dev/\">deps.dev</a>), as well as manually in papers, which could be supported by tracking and recording the provenance of the computational environment in which research is performed.</p>\n\n\n\n<p>New metrics present an opportunity for the research software community to think about what behaviors should be incentivized in reaction to what have been incentivised for papers. For instance, the negative “salami slicing” in papers potentially corresponds to positive behavior for software development: greater modularity. The push for new and independent efforts in creating papers shouldn’t mean that’s what works for software: metrics that equally measure contributions and new independent software outputs remove the disincentive to contribute to an existing software effort instead of creating a new and independent one. Developing metrics is the first step towards gaining credit for this important contribution to science.</p>\n"},{"id":"http://danielskatzblog.wordpress.com/?p=1665","title":"A kind-of brief (and personal) early history of US-RSE","link":"https://danielskatzblog.wordpress.com/2022/02/07/dans-us-rse-early-history/","published":"Mon, 07 Feb 2022 17:01:55 +0000","description":"[Note: In December 2021, I decided to write down my experiences with the founding of US-RSE. Vanessa Sochat convinced me that it would make more sense for all interested US-RSE members to write a collective...","isPermalink":false,"tags":["RSE"],"authors":[{"name":"danielskatz","url":null}],"image":"https://0.gravatar.com/avatar/3f59e90625547fce79de3e9c0d46867d?s=96&d=identicon&r=G","modified":null,"contentHtml":"\n<p>[Note: In December 2021, I decided to write down my experiences with the founding of US-RSE. Vanessa Sochat convinced me that it would make more sense for all interested US-RSE members to write a collective post, which we have now done as <a href=\"https://us-rse.org/2022-02-06-a-brief-history-of-usrse/\">https://us-rse.org/2022-02-06-a-brief-history-of-usrse/</a>. So much of this blog post overlaps that one, but some of it doesn&#8217;t, and I&#8217;m publishing this as a record of my recollection. Any errors or discrepancies are mine.]</p>\n\n\n\n<p>For me, Research Software Engineering (RSE) and the US-RSE Association came out sustainable software, and my thinking about sustainable software really crystalized while I was a program director at NSF and led the <a href=\"https://www.nsf.gov/funding/pgm_summ.jsp?pims_id=504817\">SI2 (Software Infrastructure for Sustained Innovation)</a> program that had been created by Manish Parashar and Abani Patra, then was led by Gabrielle Allen, before it was my turn to shape it and lead it for about four years, from 2012 to 2016. During this time, I was influenced by what the <a href=\"https://www.software.ac.uk/\">Software Sustainability Institute</a> in the UK was doing, particularly around RSEs.</p>\n\n\n\n<p>After I left NSF and moved to the University of Illinois, I took a more hands-on role in RSE activities, including thinking of my team (<a href=\"https://web.archive.org/web/20180719223309/http://ssa.ncsa.illinois.edu/\">Scientific Software & Applications, SSA</a>) of scientific software developers and HPC applications scientists at NCSA as RSEs. I started by attending the <a href=\"https://ukrse.github.io/conf2016\">first RSE conference</a> in late 2016. Based on that, and wondering about the possibility of creating a US RSE community, I volunteered to customize the questions and answers for US participants in the first <a href=\"https://github.com/softwaresaved/international-survey\">international RSE survey</a> in September 2017. Because I was thinking about this at an <a href=\"https://www.rd-alliance.org/plenaries/rda-tenth-plenary-meeting-montr%C3%A9al-canada\">RDA plenary</a> just before this where I was talking with Sandra Gesing in a <a href=\"https://www.rd-alliance.org/ig-virtual-research-environment-vre-ig-rda-10th-plenary-meeting\">session on science gateways</a>, I wrote to Sandra on September 26 2017:</p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>Hi Sandra,</p><p>To follow-up on a brief discussion at the gateways meeting at RDA:</p><p>I&#8217;ve &#8220;volunteered&#8221; to work with the UK Software Sustainability Institute (SSI) to create a US-flavored version of the RSE survey that they&#8217;ve done for 2 years now. I wonder if you might be interested in working on this as well?</p><p>Basically, I&#8217;m working with Simon Hettrick to &#8220;translate&#8221; the survey questions and answers, which is all done in GitHub. I also plan to add another note that says if the respondents are interested [and] want to be part of a possible RSE group, or if they want to organize such a group, they should do something (maybe volunteer through a separate Google form, so that the data in the survey itself will remain anonymous.)</p><p>The survey will be run by Southampton, and the data will be published, so I don&#8217;t believe there are any IRB issues to worry about, but I welcome your opinions on this too.</p><p>Does this sound at all interesting?</p><p>If so, do you have suggestions for other people who might also be interested?</p><p>Thanks,</p><p>Dan</p></blockquote>\n\n\n\n<p>Sandra was excited about the topic and joined me in doing this work.</p>\n\n\n\n<p>After the survey was completed, 10 people had volunteered to work on a <a href=\"https://us-rse.org/\">US RSE organization</a>, and on January 25, 2018, I suggested to Sandra we write to them to get some activity going. Sandra pointed out that there was also a UK-organized meeting for leaders of RSE groups that was happening the following week in the UK, that she and four other US people were attending (though I was not due to a conflict with another meeting), and we should bring these together.</p>\n\n\n\n<p>So the email I sent on January 26 to the 13 other people in the combined two groups (there was some overlap) was:</p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>Hi,</p><p>The first 10 of you are the people who went through the US RSE survey to the end, and then took the extra step of filling out the form saying that you were interested in helping to organize a US RSE organization.</p><p>[10 names/emails, including Ian Cosden, Chris Hill, and Lance Parsons]&nbsp;</p><p>In addition, there are 5 US people going to an international RSE meeting in the UK next week, including Chris and Ian and Sandra (who worked with me to create the US version of the survey). The other two are:</p><p>[2 names/emails]</p><p>I&#8217;m now writing to introduce you to each other, at least electronically. It might be useful for each person to write a short email saying who they are and why there are interested.</p><p>After that, I want to encourage you to talk to each other, and try to find a way to move forward, in particular after some of you participate in next week&#8217;s international meeting.</p><p>Sandra Gesing and I, as the organizers of the US version of the RSE survey, offer you at least moral support.</p><p>We are also co-PIs on the just starting US Research Software Sustainability Institute Conceptualization project (<a href=\"http://urssi.us/\">http://urssi.us</a>), and we will likely cover related topics in our project workshops and survey; we look forward to working with a US RSE community, or helping one form.</p><p>I can help make connections to the UK RSE organization as well.</p><p>Finally, I can also help make connections to public and private US funding agencies, if you can conceive of activities where funding is needed.</p><p>But at this point, I want to turn this over to you to move forward. Feel free to copy Sandra and I on any emails, and to ask for help if you think we can provide it.</p><p>Dan</p></blockquote>\n\n\n\n<p>As an aside, I met Ian Cosden at a workshop in Princeton May 2, 2017, and I remember sitting down at a table with him where he described his group to me, and I replied that it sounded like an RSE group, and sent him a bunch of material about RSEs, which I think helped him think about his group and other models.</p>\n\n\n\n<p>And as a less-related aside (since the title of this post includes personal), the first email I can find between me and Chris Hill was from 2004, where we talked about the <a href=\"https://en.wikipedia.org/wiki/Earth_System_Modeling_Framework\">Earth System Modeling Framework (ESMF)</a> and running it on <a href=\"https://en.wikipedia.org/wiki/Grid_computing\">the Grid</a>, but I think I first met Chris in the late 1990s while working in the <a href=\"https://ntrs.nasa.gov/citations/19950012158\">NASA HPCC program</a>, or perhaps when I was working on applying the <a href=\"http://dx.doi.org/10.1109/HPDC.1999.805289\">Common Component Architecture (CCA)</a> to coupled climate models, <a href=\"https://danielskatz.org/papers/icsec02.pdf\">around 2002</a>.</p>\n\n\n\n<p>Ok, back to US-RSE. 2018 was fairly quiet, though key activities were Chris Hill creating our Slack team, our GitHub organization, and our initial website while at the international leaders meeting. In December, Ian <a href=\"https://web.archive.org/web/20190722130558/https://us-rse.org/2019-01-29-site-update/\">updated the website</a> with a new structure, and we gradually started more actively publicizing the association.&nbsp;</p>\n\n\n\n<p>In April 2019, Sandra created a mailing list (a Google group), and used this to increase promotion of the association. And probably the key activity of 2019 was Ian taking the organizational lead, writing an email to nine of us on May 14:</p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>Dear all,</p>\n<p>In the last couple months the US-RSE group has clearly seen a rise in interest, membership, and engagement. The growth is extremely encouraging, and with a small amount of effort, it’s only a matter of time before we reach a significant level of activity.</p>\n<p>I wanted to reach out, not via slack, but in a more composed email. The nine of you (plus me) are all listed on the website as the current steering committee, for the sole reason that you either (a) wrote your name as a contributor in the document that helped define our mission or (b) expressed interest in participating around the same time. When I put the new website together, I just ran with it and appointed us the “Steering Committee.” For better or worse, that’s all it took in December.&nbsp;</p>\n<p>It’s unlikely that we can continue with a completely ad-hoc organization forever. New members are (hopefully) going to be continually joining. I’d like to propose that we decide on some semi-formal organizational issues, now, rather than wait for actual problems to arise. Perhaps it&#8217;s too early. But better too soon, than too late.</p>\n<p>At some point, there are decisions that will have to be made that will affect the direction of the community &#8211; some already have been made (I’m certainly guilty of this myself). One big question we need to answer: Who gets to make these decisions, and on what basis?</p>\n<p>I know we are all volunteering our time for this, and everyone is busy. So whatever we decide will only work if it’s low maintenance and something that can evolve over time.</p>\n<p>So as a starting point, let me propose the following:</p>\n<ol><li>We decide on a steering committee. At this point, I think the 10 of us should have the right of first refusal – so basically, as long as you are willing. As a reasonable expectation, perhaps “willing” would mean agreeing to commit a few hours a month to US-RSE related work.</li><li>We get agreement on the basic mission, set some realistic goals, then set some aspirational goals.</li><li>We start to develop a flexible set of “bylaws” or some other agreement of how this endeavor is going to work. This will require us to answer lots of questions that start with who and how.&</li><li>We set up a regular (monthly?) zoom call for the steering committee members as a way to check in, discuss issues, and assign roles/tasks.</li></ol>\n<p>These things obviously aren’t going to happen overnight, but we can get the ball rolling. I don’t think we want to be closed off from the rest of the group, or purposely hide things, but having individuals run wild or randomly throwing things out to the group at large for input in slack isn’t going to work forever.</p>\n<p>If I’m way off the mark here let me know.</p>\n<p>Best regards,</p>\n<p>Ian</p>\n</blockquote>\n\n\n\n<p>This led to the first steering committee, which we recognized at the time was just a way to get things going, and that we would move to a democratic process in the future. Since then, we&#8217;ve had a lot of <a href=\"https://us-rse.org/join/\">organizational growth</a> that has taken us to where we are today, with many more people joining, our <a href=\"https://us-rse.org/about/governance/\">governance structure</a> becoming more formalized, and now 2 sets of elections that have led to all steering committee members being elected.</p>\n\n\n\n<p>One final thing that I am happy about is a discussion I started in a <a href=\"https://docs.google.com/document/d/1o6MDp3XO5LAEmkuQIJlNEdEPru4Yex4aMPpw0EikS0U/edit\">September 2019 steering committee meeting</a> about creating a diversity statement on the US-RSE website. I wrote on the steering committee slack site shortly before this meeting:</p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>Note that we don&#8217;t say anything about diversity in <a href=\"https://us-rse.org/\">https://us-rse.org</a> or <a href=\"https://us-rse.org/about/\">https://us-rse.org/about/</a> or <a href=\"https://us-rse.org/mission/\">https://us-rse.org/mission/</a> I think we probably should have increasing diversity of the US-RSE community (not our just members, but the larger community) as a goal.</p></blockquote>\n\n\n\n<p>This wasn&#8217;t a new idea; US-RSE had talked about diversity from an early point, but we weren&#8217;t really doing anything in an organized way about it, and I felt like saying it publicly as part of our mission could be a start. This led to diversity, equity, and inclusion being the topic of our <a href=\"https://us-rse.org/2020-10-13-community-call-dei/\">October 2020 community call</a>, and this in turn led to the DEI slack channel and the DEI working group, led by Lance, which wrote our DEI statement and has been active in promoting DEI through a variety of activities.</p>\n\n\n\n<p>There&#8217;s a lot more that could be written about US-RSE, and I&#8217;m sure other people will have other views of their own parts in leading us forward. I urge them to write additional posts, or contribute to a new version of the <a href=\"https://us-rse.org/2022-02-06-a-brief-history-of-usrse/\">collective post</a>. And in the meantime, a good source of information is Ian&#8217;s talks in our <a href=\"https://youtu.be/mcl3QY1lBzY\">2020</a> and <a href=\"https://youtu.be/iKIbS16D8XU\">2021</a> annual general meetings.</p>\n"},{"id":"http://danielskatzblog.wordpress.com/?p=1658","title":"Advancing social aspects of the research software ecosystem: Citation and metrics","link":"https://danielskatzblog.wordpress.com/2022/01/10/social-aspects-research-software-ecosystem/","published":"Mon, 10 Jan 2022 13:54:06 +0000","description":"While I was a program director at NSF, I led the SI2 (Software Infrastructure for Sustained Innovation) program that had been created by Manish Parashar and Abani Patra, then was led by Gabrielle Allen,...","isPermalink":false,"tags":["Uncategorized","contributorship","credit","software","transitive credit"],"authors":[{"name":"danielskatz","url":null}],"image":"https://0.gravatar.com/avatar/3f59e90625547fce79de3e9c0d46867d?s=96&d=identicon&r=G","modified":null,"contentHtml":"\n<p>While I was a program director at NSF, I led the <a href=\"https://www.nsf.gov/funding/pgm_summ.jsp?pims_id=504817\">SI2 (Software Infrastructure for Sustained Innovation)</a> program that had been created by Manish Parashar and Abani Patra, then was led by Gabrielle Allen, before it was my turn to shape it and lead it for about four years, from 2012 to 2016. This program initially funded projects that developed and maintained software, as well as projects that planned and built community institutes around software. And while many of these projects were (and in some cases continue to be) successful, I also quickly realized that the $15-$30m annually that I could provide to these projects was just a small fraction of the overall NSF funding that was spent on creating software.</p>\n\n\n\n<p>I thought that we could encourage better, more sustainable software by thinking about the social aspects of software work, specifically, that if we could reward people when their software was used, they would have an incentive to make it as good and easy-to-use as possible, and this could lead to more people using existing software instead of developing new software that was similar to existing software.</p>\n\n\n\n<p>To examine this, in 2014 I worked with Joshua Rosenboom, who led the NSF Science of Science and Innovation Policy (SciSIP) program, to gain support and budget from our division directors and our directorate associate directors to publish a <a href=\"https://www.nsf.gov/pubs/2014/nsf14059/nsf14059.jsp\">Dear Colleague Letter (DCL)</a>, a reminder to the community of existing NSF funding mechanisms, and a note that we were interested in projects using these mechanisms that had a specific focus, in this case, on citation, attribution, and metrics related to software and data.</p>\n\n\n\n<p>As we wrote in the <a href=\"https://www.nsf.gov/pubs/2014/nsf14059/nsf14059.jsp\">DCL</a>,&nbsp;</p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>How scientific research is conducted across all science disciplines is changing. One important direction of change is toward more open science, often driven by projects in which the output is purely digital, i.e., software or data. Scientists and engineers who develop software and generate data for their research spend significant time in the initial development of software or data frameworks, where they focus on the instantiation of a new idea, the widespread use of some infrastructure, or the evaluation of concepts for a new standard. Despite the growing importance of data and software products the effort required for their production is neither recognized nor rewarded. At present there is a lack of well-developed metrics with which to assess the impact and quality of scientific software and data. Unlike generally accepted citation-based metrics for papers, software and data citations are not systematically collected or reported. NSF seeks to explore new norms and practices in the research community for software and data citation and attribution, so that data producers, software and tool developers, and data curators are credited for their contributions.</p></blockquote>\n\n\n\n<p>A search of the NSF awards database (selected from the results of a <a href=\"https://www.nsf.gov/awardsearch/advancedSearchResult?PIId=&PIFirstName=&PILastName=&PIOrganization=&PIState=&PIZip=&PICountry=&ProgOrganization=&ProgEleCode=&BooleanElement=All&ProgRefCode=8004&BooleanRef=All&Program=&ProgOfficer=&Keyword=&AwardNumberOperator=&AwardAmount=&AwardInstrument=&ExpiredAwards=true&OriginalAwardDateOperator=Range&OriginalAwardDateFrom=7%2F1%2F2014&OriginalAwardDateTo=10%2F1%2F2014&StartDateOperator=&ExpDateOperator=\">search for expired awards, started between 1 July 2014 and 1 October 2014, with reference code 8004</a>) shows that this funded seven EAGER projects:</p>\n\n\n\n<ul><li><a href=\"https://www.nsf.gov/awardsearch/showAward?AWD_ID=1448480&HistoricalAwards=false\">EAGER: Tracing the Use of Research Resources Using Persistent Citable Identifiers</a>, Matthew Mayernik, Keith Maull, UCAR</li><li><a href=\"https://www.nsf.gov/awardsearch/showAward?AWD_ID=1448633&HistoricalAwards=false\">EAGER: Development of software citation methodology for open source computational science</a>, Louise Kellogg, Joseph Dumit, MacKenzie Smith, Lorraine Hwang, University of California, Davis</li><li><a href=\"https://www.nsf.gov/awardsearch/showAward?AWD_ID=1448069&HistoricalAwards=false\">EAGER: Assessing Established and Alternative Citation, Attribution and Impact Metrics for Scientific Software through Data Mining and Direct Tracking Methods</a>, Piotr Sliz, Harvard University</li><li><a href=\"https://www.nsf.gov/awardsearch/showAward?AWD_ID=1448123&HistoricalAwards=false\">EAGER: Citation++: Data Citation, Provenance, and Documentation</a>, Margo Seltzer, Gary King, Merce Crosas, Harvard University</li><li><a href=\"https://www.nsf.gov/awardsearch/showAward?AWD_ID=1448821&HistoricalAwards=false\">Making Data Count: Developing a Data Metrics Pilot</a>, Patricia Cruse, Stephen Abrams, University of California, Office of the President</li><li>Collaborative Research: Comprehensive Citation Across the Data Life Cycle Using DDI, <a href=\"https://www.nsf.gov/awardsearch/showAward?AWD_ID=1448127&HistoricalAwards=false\">Mary Vardigan, University of Michigan</a> & <a href=\"https://www.nsf.gov/awardsearch/showAward?AWD_ID=1448107&HistoricalAwards=false\">Larry Hoyle, University of Kansas</a></li><li><a href=\"https://www.nsf.gov/awardsearch/showAward?AWD_ID=1447886&HistoricalAwards=false\">Developing Standards for Data Citation and Attribution for Reproducible Research in Linguistics</a>, Andrea Berez-Kroeker, Gary Holton, Peter Pulsifer, Susan Kung, University of Hawaii</li></ul>\n\n\n\n<p>and one workshop project:</p>\n\n\n\n<ul><li><a href=\"https://www.nsf.gov/awardsearch/showAward?AWD_ID=1448360&HistoricalAwards=false\">Workshop on Supporting Scientific Discovery through Norms and Practices for Software and Data Citation and Attribution</a>, Stanley Ahalt, Thomas Carsey, University of North Carolina Chapel Hill</li></ul>\n\n\n\n<p>Overall, these projects have led to progress in citation and metrics. Each project award link above contains a project outcomes report that includes papers and other products. And perhaps more significantly, these projects have shaped the social environment in which software (and data) are produced. Specifically:</p>\n\n\n\n<ul><li>The Mayernik/UCAR project focused on the use of identifiers, and used <a href=\"https://github.com/kermitt2/grobid\">GROBID</a> to classify papers that mentioned an NCAR supercomputer, which is related to <a href=\"https://asistdl.onlinelibrary.wiley.com/doi/10.1002/asi.24454\">work now ongoing</a> at U Texas to find software mentions in papers where formal citations don&#8217;t exist.</li><li>The Kellogg/UC Davis project worked in the context of geodynamics to understand barriers in software development, current software citation practices, and to develop solutions to increase the occurrence of software citation in the literature, including a tool that is now part of the Computational Infrastructure for Geodynamics (CIG): the <a href=\"https://geodynamics.org/cig/abc/\">attribution builder for citation (abc)</a>.</li><li>The Sliz/Harvard project created a similar tool: AppCiter, which is part of the <a href=\"https://sbgrid.org/software/\">SBGrid</a> and <a href=\"https://biogrids.org/software/\">BioGrids</a> infrastructures, making it easier for researchers in these environments to cite the software they use in their research. [Disclosure &#8211; I recently became a member of the <a href=\"https://sbgrid.org/about/advisory/\">SBGrid advisory board</a>.]</li><li>The Seltzer/Harvard project led to improvements in storing data provenance and making data citable in <a href=\"https://dataverse.org/\">Dataverse</a>, open source data repository software that is in use at 75 institutions around the world.</li><li>The Cruse/California Digital Library project developed into the vibrant <a href=\"https://makedatacount.org/\">Making Data Count</a> community initiative, which believes that the development of open data metrics will encourage broad adoption and our best path towards that is global community involvement throughout each phase of work. It is working to produce evidence-based studies on researcher behavior in citing and using data, and to drive a community of practice around open, normalized data usage and data citation as initial steps towards the development of research data assessment metrics.</li><li>The Vardigan/Michigan & Hoyle/Kansas collaborative project worked to improve the <a href=\"https://ddialliance.org/\">Data Documentation Initiative (DDI)</a> standard, an international standard for describing the data produced by surveys and other observational methods in the social, behavioral, economic, and health sciences, and produced a custom metadata model to describe citation-like supporting materials in addition to data.</li><li>The Berez-Kroeker/Hawaii project brought about increased attention to reproducible research in linguistics, especially with regard to the citation of research data. The team led a community effort to define principles for data citation in linguistics (<a href=\"https://site.uit.no/linguisticsdatacitation/austinprinciples/\">Austin Principles of Data Citation in Linguistics</a>) and recommendations for researchers and publishers (<a href=\"https://doi.org/10.7557/15.5509\">Tromsø Recommendations for the Citation of Research Data in Linguistics</a>).</li><li>The Ahalt/UNC-led workshop brought together a cross-section of researchers, funders, publishers, and communities in a national, interdisciplinary discussion and exploration of new norms and practices for software and data citation and attribution. The workshop identified social and technical challenges facing current software development and data generation efforts and explored viable methods and metrics to support software and data attribution in the scientific research community. The <a href=\"https://doi.org/10.25391/nsf.6815051.v1\">workshop report</a> proposed pilot projects to endeavor to implement and experiment with actionable ideas, including topics such as improving cross-referencing of citation data, increasing the use of identifiers for people and products, creating a consistent citation format for software and data, and developing guidelines for trusted software repositories, many of which now have been begun or accomplished.&nbsp;</li></ul>\n\n\n\n<p>This Dear Colleague Letter and the projects that it led to have been reasonably successful at raising awareness of the issues around software and data citation and in taking action to improve them, both in specific disciplinary communities and more generally. However, much work is still needed. While there is no existing focused program in this area, a <a href=\"https://www.nsf.gov/pubs/2021/nsf21099/nsf21099.jsp\">more recent NSF DCL on collaboration between CISE and SBE researchers</a> might include the opportunity for new projects in this area, and some other government agencies and private foundations have shown willingness to fund such projects.&nbsp;</p>\n\n\n\n<p>While most of the projects that were funded have ended, they have built community and community work in this area, including groups within the <a href=\"https://www.rd-alliance.org/\">Research Data Alliance (RDA)</a> and <a href=\"https://www.force11.org/\">FORCE11</a>. The <a href=\"https://www.researchsoft.org/\">Research Software Alliance (ReSA)</a> has also started to examine this area under its <a href=\"https://doi.org/10.5281/zenodo.5633318\">people</a> and policy themes. If you are interested in software citation, the area I know the best, you can join the <a href=\"https://www.force11.org/group/software-citation-implementation-working-group\">FORCE11 Software Citation Implementation Working Group</a>. Regarding software metrics, the <a href=\"https://chaoss.community/\">CHAOSS project</a> is a good starting point to get involved. For research software in general, you can join the <a href=\"https://www.researchsoft.org/\">ReSA</a> <a href=\"https://www.researchsoft.org/news/\">mailing list</a>. Regarding data, <a href=\"https://www.rd-alliance.org/\">RDA</a> has a number of interest and working groups you can join.</p>\n"},{"id":"http://danielskatzblog.wordpress.com/?p=1640","title":"Event formats, including hybrid","link":"https://danielskatzblog.wordpress.com/2021/11/29/event-formats-including-hybrid/","published":"Mon, 29 Nov 2021 13:04:53 +0000","description":"I recently attended the hybrid SC21 conference in person, as one of the about 3000 in-person attendees, along with several thousand virtual attendees. (I don&#8217;t know the exact numbers, but in the past,...","isPermalink":false,"tags":["Uncategorized"],"authors":[{"name":"danielskatz","url":null}],"image":"https://0.gravatar.com/avatar/3f59e90625547fce79de3e9c0d46867d?s=96&d=identicon&r=G","modified":null,"contentHtml":"\n<p>I recently attended the hybrid <a href=\"https://sc21.supercomputing.org\">SC21</a> conference in person, as one of the about 3000 in-person attendees, along with several thousand virtual attendees. (I don&#8217;t know the exact numbers, but in the past, an SC conference would have about 12000 attendees in-person.) In December, I&#8217;ll be attending the hybrid <a href=\"https://www.agu.org/Fall-Meeting\">AGU Fall meeting</a> remotely. And I&#8217;m also involved in planning a number of future workshops and conferences, so I&#8217;m thinking about how to run such events.</p>\n\n\n\n<p>It&#8217;s clear how in-person events work. In my experience, the advantages to such events are the sense of community that develops, the opportunity to talk to people in hallways, and the fact that when I dedicate time to travel and to attending an in-person event, I end up learning about new things based on attending sessions that seem interesting at the time. The disadvantages are that such events involve travel and associated environmental impacts, and that they are often limited to those who can afford the cost of attending them, typically mostly those from the Global North and those in certain types of jobs.</p>\n\n\n\n<p>It&#8217;s also reasonably clear how virtual events work at this point, after 20+ months of many of them. The advantages of these meetings are somewhat the opposite of the disadvantages of in-person events: they are generally cheaper than in-person events, have no travel and associate climate impacts, and are really open to anyone in the world with sufficient network connectivity. The disadvantages, at least for me, are mostly around timing: it&#8217;s harder for me to dedicate time to virtual events, so I often only attend sessions where I am talking or I am sure I will learn something, but I don&#8217;t have many serendipitous encounters; I often don&#8217;t feel very connected to others attending, or make social connections to people I didn&#8217;t already know; and for events that happen out of my time zone, I often cannot attend large parts of the event.</p>\n\n\n\n<p>Some virtual events have worked on these issues, such as by running sessions multiple times in different time zones, either repeated or with different hosts and different speakers on the same topic or via recordings, and by creating social sessions (virtual icebreakers, use of <a href=\"https://www.gather.town\">gather.town</a> and <a href=\"https://spatial.chat\">spatial chat</a>, etc.,) and they do improve the virtual experience and make it more inclusive, but don&#8217;t really succeed in fully addressing the disadvantages and providing an experience that matches an in-person event.</p>\n\n\n\n<p>I&#8217;m not really sure where this leaves us, as I don&#8217;t think the disadvantages of either in-person or virtual events can ever be fully addressed (e.g., it&#8217;s hard to see how to solve people being in different time zones without travel), I can imagine a world where we have both types of events (and gradually get better at running virtual events), and organizers develop a set of rules for deciding which kind works best for a specific event.</p>\n\n\n\n<p>I think that having hybrid events instead of either purely in-person or purely virtual events is not the general answer, as they seem to be the worst of both in many regards. A hybrid event has to</p>\n\n\n\n<ol><li>Provide something for in-person attendees that makes the extra cost of their attendance (in time, travel, and funds) worthwhile, and</li><li>Make sure that remote participants don&#8217;t miss out on anything by not attending in-person.</li></ol>\n\n\n\n<p>It seems to me that it&#8217;s almost impossible to do both of these at the same time.</p>\n\n\n\n<p>On the other hand, even given these disadvantages, maybe we should still have hybrid events, as neither in-person nor virtual events don&#8217;t also have disadvantages. If so, it seems we would want to provide guidance for participants about the advantages and disadvantages of in-person and virtual attendance, perhaps on a session-by-session basis as well as for the overall event, and let them decide.</p>\n\n\n\n<p>I&#8217;m also interested in thinking about an event format where people meet in-person locally (or nationally), and these local meetings are then brought together in the overall event, similar to <a href=\"https://resbaz.github.io/resbaz2021/\">Research Bazaar (RezBaz)</a> events.</p>\n\n\n\n<p>Overall, I don&#8217;t think there&#8217;s ever going to be a solution. All three event formats have disadvantages, and none of them seem to be outweighed by their advantages. If this is correct, our goals should be to:</p>\n\n\n\n<ul><li>Understand the disadvantages of each type of event and reduce them as much as possible;</li><li>Understand how different types of events meet different objectives, and try to best match the format for an event to the objectives of that event; and</li><li>Develop and present clear guidance to potential attendees of their options.</li></ul>\n\n\n\n<p></p>\n"},{"id":"http://danielskatzblog.wordpress.com/?p=1626","title":"Senior level RSE career paths (with an s)","link":"https://danielskatzblog.wordpress.com/2021/09/27/senior-rse-paths/","published":"Mon, 27 Sep 2021 14:10:19 +0000","description":"(by Daniel S. Katz, Kenton McHenry, Jong S. Lee) (in conjunction with a talk [slides, video] presented 28 September 2021 at SeptembRSE) Over the past nine years there has been growing acceptance of the role...","isPermalink":false,"tags":["RSE"],"authors":[{"name":"danielskatz","url":null}],"image":null,"modified":null,"contentHtml":"\n<p class=\"has-text-align-center\">(by Daniel S. Katz, Kenton McHenry, Jong S. Lee)</p>\n\n\n\n<p class=\"has-text-align-center\">(in conjunction with <a href=\"https://septembrse.github.io/#/event/T1025\">a talk</a> [<a href=\"https://doi.org/10.5281/zenodo.5531839\">slides</a>, <a href=\"https://www.youtube.com/watch?v=6YeV-Mm5CcU&t=3558s\">video</a>] presented 28 September 2021 at <a href=\"https://septembrse.society-rse.org\">SeptembRSE</a>)</p>\n\n\n\n<p>Over <a href=\"https://slides.com/simonhettrick/nsf-rse-history\">the past nine years</a> there has been growing acceptance of the role of <a href=\"https://researchsoftware.org/\">Research Software Engineers (RSEs)</a> and the value they bring to projects. We&#8217;ve also talked about <a href=\"https://www.software.ac.uk/blog/2018-05-23-establishing-rse-groups-different-levels\">different models</a> of where RSEs can fit in institutions, from lone RSEs working with research groups, to small groups of RSEs embedded in a department or division, to centralized groups of RSEs in an institution. And in some institutions (e.g., <a href=\"http://doi.org/10.1109/SE4Science.2019.00009\">NCSA, Manchester, and Notre Dame</a>), these groups have grown to a size where additional structure beyond just a group and a leader is sufficient.</p>\n\n\n\n<p>Now it&#8217;s time to define how RSEs fit into their institutions, particularly at more senior levels. This post attempts to do that, and it has been influenced by a <a href=\"https://danielskatzblog.wordpress.com/2019/07/12/super-rses-combining-research-and-service-in-three-dimensions-of-research-software-engineering/\">past blog post by Dan and Kenton</a>, and a <a href=\"https://www.goodreads.com/book/show/33369254\">book by Camille Fournier</a>.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>RSE career paths</strong></h2>\n\n\n\n<p>We can think of a typical technical RSE career progression as being divided into levels, perhaps for example, Associate RSE, Staff RSE, and Senior RSE. The number of levels here is somewhat arbitrary, though there are often a few concepts that work into the number: On one hand, it&#8217;s good to have multiple levels, so that there is the opportunity for promotion and recognition, perhaps every few years, and maybe even more at the start. On the other hand, with too many levels, it can be hard to define the distinctions between them. Additionally, some organizations believe that there is some level people need to achieve in order to be a good contributor to the organization, and if they can&#8217;t get to that level, it&#8217;s best to let them find another position. For the purpose of this blog, we&#8217;ll assume there are three basic technical RSE levels, and that the Staff RSE level is the minimum sustainable level for an RSE.</p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter is-resized\"><img src=\"https://lh6.googleusercontent.com/SHE5KMp5SN31XUA0KG8anSDqmLJetfhGOBRdxc0NpBFBGPYIoWoPnASIaJeeAaKOr5XKoPW1muf00VQ-_m0Yh_MnfcmNodv6TOTVyrKfWumIJlsBivXY--ZtbB99bxt_rfkN23-n=s0\" alt=\"\" width=\"401\" height=\"189\" /></figure></div>\n\n\n\n<p>Some of these roles can include some mentoring and leadership, and at some point in technical progression, this becomes a key capability. For the purpose of this post, we&#8217;ll call this the Lead RSE level. This is where someone has to be the PI of a project or to lead an element of a large project. While this can happen at different levels, both lower and higher, we&#8217;ll argue that that is required at the Lead RSE level and above, and in fact, under the practice of some organization where a person has to demonstrate the ability to work at a higher level before they are promoted, this might be a requirement for becoming a Lead RSE.</p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter is-resized\"><img src=\"https://lh3.googleusercontent.com/dYwYc1QImvd3rhXdYJrBRrafhW0AMnvcZHCcM6qM1wvFTAZ5UnmGHPLXcVwu7mm_G668HGhV-9Nr0_UIutDaXd_08WFlW7J2QgcxWM9wJedS_9fZahA2_w-qoB-BOavs4oAeLrCk=s0\" alt=\"\" width=\"508\" height=\"245\" /></figure></div>\n\n\n\n<p>Once a person is at this Lead level, the different aspects of leadership come to the fore, and they may choose to emphasize one of them and use that emphasis to build new skills and move into a new role. There are three options we&#8217;ll explore in the rest of this post: product-focused, technology-focused, and people-focused. We&#8217;ll called these roles</p>\n\n\n\n<ul><li>Product Manager / RSE (product-focused)</li><li>Principal RSE (technology-focused)</li><li>Group Leader / RSE (people-focused)</li></ul>\n\n\n\n<p>Of course, people at this level are likely to have aspects of all these emphases and these sets of skills. And for these to be formal roles, the organization probably has to be of sufficient scale; otherwise, these roles will have to be combined, perhaps in a single group leader of the organization.</p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter is-resized\"><img src=\"https://lh3.googleusercontent.com/FTU_3xrKim59AFpTthYK0QGQZNs4FMd57dJ6ug9rFm0mDGJqqo53_KMkmm1S7YIn5D1x7_RExXyEaLlE57ZCSYl0jtr-ew5oxBCIkAq8hkdewH0g4utA10xrzY5F-d_oUUucuXXD=s0\" alt=\"\" width=\"-58\" height=\"-26\" /></figure></div>\n\n\n\n<p>While these positions are shown here as the end points of RSE career paths, they may be the point at which someone leaves the RSE community and moves into a different community to further grow these other aspects of their abilities. For example, the Product Manager / RSE might move into larger product management outside of software, for example, becoming the PI of a large supercomputer procurement and operations project such as <a href=\"http://www.ncsa.illinois.edu/enabling/delta\">Delta at NCSA</a>. The Group Leader / RSE might become a higher level organizational manager, such as a division director, such as for the NCSA Software Directorate, or the director of a research center such as <a href=\"http://www.ncsa.illinois.edu/\">NCSA</a>. While a person moving along either of these paths may still have a responsibility for software, it is decreasingly likely that they will spend much of their time doing hands-on software work such as programming. On the other hand, the Principal RSE almost certainly will continue to work directly with software, as well as to mentor others, to lead software projects, etc. So this choice really is a choice, with both personal and professional aspects and consequences.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Supporting RSE career paths</strong></h2>\n\n\n\n<p>Two interesting aspects of these paths are related to how they and the people in them are supported, both financially and intellectually.</p>\n\n\n\n<p>At NCSA, a typical RSE in the career levels up to Lead is expected to be supported by projects about 95% of the time, and by the center for the remaining about 5%. This 5% allows them to work on activities that are not tied to any one project and are more institutional in nature, such as being involved in hiring or other such committees, and to contribute to proposals at a small level, noting that this time fraction is not sufficient for major proposal work, which at NCSA is funded on a per-proposal basis. At the earlier levels they will likely have little role in finding the projects on which they work, but at the Lead level, they are expected to be acquiring projects by writing at least sections of proposals and representing NCSA in discussions with collaborators and funders. This may require additional institution support, though at NCSA, it likely will be based on specific time-limited activities. And those at the group leader / RSE level will be supported at about 20% by the center for these management activities. We don&#8217;t currently have anyone at the Principle RSE or Product Manager / RSE levels at this time, but hypothetically, people at these levels might also be supported at around a 20% level as the center invests in both them and, in the case of the Product Manager / RSE, the product they support as a key element of the center&#8217;s future success. And at higher levels of either product or people management, the center will likely invest more in the person because of their increased work on behalf of the center, though a successful product manager is likely going to be acquiring funding for their product and themselves in a way that a people (line) manager cannot.</p>\n\n\n\n<p>Intellectual support is harder to define, in part because it is less formal. We (NCSA) have a good deal of informal mentoring, but less formal training and no formal mentoring currently, though we do want to formalize these mechanisms in the future. Informal mentoring is mostly embedded within projects, where and when the senior person or lead of the project identifies opportunities/activities for staff to experience new skills. For example, the lead might delegate managing a part of the project to the junior staff member, such as task management, sprint planning, release planning, etc., and then coach that staff member in how to make this part successful. We offer, are developing, or have used external programs for training in leadership, proposal development, task management, and technical training (e.g., we have a weekly software working group meeting that both introduces new technologies and has focus groups that investigate and promote best practices in particular technologies). We also participate in the NSF-supported <a href=\"https://colbrydi.github.io/cyberambassadors/\">CyberAmbassadors</a> program, which offers training in communication, teamwork, and leadership skills, including in how to effectively communicate and collaborate with external researchers (e.g., faculty).&nbsp;</p>\n\n\n\n<p>As we previously mentioned, an organization must have sufficient scale to support these career paths, and these financial and intellectual elements are part of the reason. In a research organization that is primarily project-based, flexible funding that can be used to support these career paths typically comes from institutional support, which for a public institution like the University of Illinois includes both state funds and the overhead on awards. While these funds can be used to support these career paths, they also are needed to support other management, administrative, and institutional functions. Similarly, to create institutional educational programs and mentoring requires enough participants to make the programs worthwhile.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Examples</strong></h2>\n\n\n\n<p>A number of these career progressions have been observed at NCSA. A typical example is &#8220;Ron,&#8221; who came straight out of college with a CS background. Ron started out as an associate level RSE. After working with a number of scientists, projects, and codebases over a couple of years, along with a staff level or senior level RSE who was assigned a small amount of time to oversee each supported project, Ron began to demonstrate more independence and the ability to drive a project on his own. He also participated in the more creative/design aspects of the scientific collaboration, while continuing to meet the project milestones and maintaining the collaboration so that the senior RSE assigned really wasn&#8217;t necessary on the project anymore and was able to work on other projects. At this point Ron was promoted to a staff level RSE as at this level he allowed the team as a whole to scale out its ability to support scientific efforts by being able to drive collaborations himself and to start to train others as well. Similar paths have occurred with staff coming from a non-CS field, in which case a solid software development proficiency needed to be demonstrated before they moved to the next level. Similarly, RSEs coming in with just industry experience needed to demonstrate an understanding of academia, its time scale and priorities, and being able to work successfully in this environment before being promoted.</p>\n\n\n\n<p>Another example is &#8220;Sue.&#8221; Sue had a Ph.D., and also started out in what was effectively an associate level RSE position. She quickly demonstrated not only an aptitude for software development but also for building out programs and bringing in new projects. Because of this ability to drive projects, Sue was promoted to the staff RSE level where she continued not only to start new projects but also began to build up new reusable codebases and started to become a Co-PI on new projects. Sue was recognized for this added capability to help sustain the RSE group overall and was soon promoted to Senior RSE. She then started to help other staff RSEs grow in activities such as developing proposals, engaging collaborators, and managing projects. Continuing to work on larger efforts that often included previously developed software and becoming PI on some projects as well, Sue became part of the organization&#8217;s leadership, where today she not only continues to build out programs but oversees staff.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Conclusion</strong></h2>\n\n\n\n<p>Given the growing acceptance of RSEs over the past nine years, and the fact that there are now perhaps <a href=\"https://slides.com/simonhettrick/how-many-rses\">hundreds of thousands worldwide</a>, it&#8217;s time to think about what happens to RSEs later in their careers. We&#8217;ve proposed a branching path that starts with technical skills, adds leadership, and then moves in different directions, both technical (project-focused) and management (product-focused, people-focused), which in turn can lead to more senior roles with little hands-on RSE work for those who want to progress in this way, for example, leading large infrastructure projects or divisions or departments. As the idea of RSEs matures, this is our next needed step: to define these more senior roles for individual RSEs to aspire and aim to, as a step of attracting new RSEs to our organizations by giving them a set of possible futures.</p>\n"}]}