{"id":"https://doi.org/10.53731/88drdpz-znvdjr9","title":"Launching the Front Matter Gazette","link":"https://doi.org/10.53731/88drdpz-znvdjr9","published":"2023-01-30T12:48:26.000+00:00","description":"On Wednesday this week I am launching the Front Matter Gazette, a weekly newsletter that highlights exciting science stories from around the web. The linked content highlighted in the newsletter is published...","isPermalink":true,"tags":["News"],"authors":[{"name":"Martin Fenner","url":"https://orcid.org/0000-0003-1419-2405"}],"image":"https://images.unsplash.com/photo-1521134976835-9963f2185519?crop&#x3D;entropy&cs&#x3D;tinysrgb&fit&#x3D;max&fm&#x3D;jpg&ixid&#x3D;MnwxMTc3M3wwfDF8c2VhcmNofDE2fHxqb3VybmFsfGVufDB8fHx8MTY3NTAxMzMwNA&ixlib&#x3D;rb-4.0.3&q&#x3D;80&w&#x3D;2000","modified":"2023-01-30T12:48:26.000+00:00","contentHtml":" <p><img src=\"https://images.unsplash.com/photo-1521134976835-9963f2185519?crop&#x3D;entropy&cs&#x3D;tinysrgb&fit&#x3D;max&fm&#x3D;jpg&ixid&#x3D;MnwxMTc3M3wwfDF8c2VhcmNofDE2fHxqb3VybmFsfGVufDB8fHx8MTY3NTAxMzMwNA&ixlib&#x3D;rb-4.0.3&q&#x3D;80&w&#x3D;2000\"></p><p>On Wednesday this week I am launching the <em>Front Matter Gazette</em>, a weekly newsletter that highlights exciting science stories from around the web. The linked content highlighted in the newsletter is published elsewhere and is free to read whenever possible. The newsletter requires a paid subscription (<a href=\"https://blog.front-matter.io/#/portal/signup\">available here</a>), 5 €/month or 50 €/year with a thirty-day free trial and free subscriptions on request. The subscription fees help pay for the curation effort – finding and summarizing the most exciting science stories. </p><h3 id=\"why-do-we-need-to-highlight-the-most-interesting-science\">Why do we need to highlight the most interesting science?</h3><p>With the <em>Front Matter Gazette,</em> I try a new approach to addressing an old problem: information overload.</p><figure class=\"kg-card kg-embed-card kg-card-hascaption\"><iframe width=\"200\" height=\"150\" src=\"https://www.youtube.com/embed/LabqeJEOQyI?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"Web 2.0 Expo NY: Clay Shirky (shirky.com) It's Not Information Overload. It's Filter Failure.\"></iframe><figcaption>Web 2.0 Expo NY: Clay Shirky (shirky.com) It's Not Information Overload. It's Filter Failure.</figcaption></figure><p>The approach traditionally often used in science has been to use journals as a filter. There are many reasons why this approach has failed, described for example in <a href=\"https://asapbio.org/addressing-information-overload-in-scholarly-literature\">this 2021 post on the ASAPbio blog</a> by Christine Ferguson and me. Three important limitations are:</p><ul><li><strong>Delays</strong>. The time from submission to publication for peer-reviewed journal articles can be significant, which causes critical issues in situations that need quick actions based on science such as in the COVID pandemic, but also for early career researchers.</li><li><strong>Focus on the journal article</strong>. Journal articles are the main channel of scientific communication in many disciplines, but large parts of scholarship focus on something else, for example, conference proceedings in computer science or books in the humanities. In addition, newer outputs of scholarship such as research data or software source code are left out or only captured <em>by proxy</em>, publishing journals with articles describing software or data.</li><li><strong>Not Open Science</strong>. Leaving the decision to what is important in science to journal publishers, often commercial, instead of the scientists themselves, is the wrong choice as other interests interfere, and marginalized communities and regions are left out not only of science publishing but also of what science is highlighted and promoted.</li></ul><p>Two alternative approaches to journals as a filter are <strong>automation</strong> and <strong>curation</strong>. In the ASAPbio blog post mentioned earlier, Christine and I discussed an automation approach we tried out in 2021, filtering relevant biomedical preprints by the attention they received on Twitter immediately after publication. We have not continued this activity beyond early 2022 for two reasons: a) I spent the first <a href=\"https://doi.org/10.53731/bkkzj8g-gd14mb6\">five months of 2022 in the hospital</a>, and b) in November 2022 I left Twitter and moved to <a href=\"https://hachyderm.io/@mfenner\">Mastodon</a> after the change in Twitter ownership.</p><p>There are many initiatives in this space that try to use computer algorithms to find the most relevant scholarly content, but Christine and I felt that this was only the first step and that <strong>curation</strong> was key to finding what is interesting and relevant. Curation is what journal editors have always done, and what is helped with peer review since it became increasingly required in the 1960s, but when curation is used to find what is interesting and relevant, and not what should be published, there is no longer a need to leave the curation exclusively up to journals.</p><p>An Open Science approach to curation has many elements, but a newsletter feels like a good fit. It is a low-tech approach that works even for the busiest scientists, and it can be combined with the automation approaches discussed earlier. And curated newsletters about Science and Scholarship work with preprints, research data, source code, and other forms of scholarship. A related activity, no longer so low-tech, is science podcasts, which arguably are currently more popular than science newsletters.</p><h3 id=\"and-who-is-going-to-pay-for-this\">And who is going to pay for this?</h3><p>There are two elephants in the room for paying for this activity: advertising and grant funding. Advertising is not only a frustrating experience for readers and authors, but also doesn't really work in a niche market such as science. The current issues at the German <a href=\"https://scienceblogs.de/\">scienceblogs.de</a> are only the latest example of the difficulties sustaining science blogging infrastructure.</p><p>Grant funding is a well-established strategy to pay for Open Science activities, but has two major limitations: a) it is not a good fit for the long tail of science (Front Matter for example is not (yet) a non-profit organization because the time and money required to start a non-profit in Germany are far from trivial), and b) grant funding likes to pay for innovation and research, getting funding for open scholarly infrastructure is much harder.</p><p>Of course Front Matter is open for startup funding for the <em>Front Matter Gazette</em>, but it should not be a requirement to get the <em>Gazette</em> started, and I can not promise any financial returns for an investment.</p><p>Paying even a small fee of 5 € per month for a useful Open Science resource can be a hurdle, as <a href=\"https://blog.impactstory.org/subscription-announcement\">Impactstory can attest</a>. That is why we offer a no-questions-asked fee waiver, and why we start the Gazette as an experiment where we don't know the outcome yet.</p><h3 id=\"will-the-front-matter-gazette-work\">Will the Front Matter Gazette work?</h3><p>Only time will tell whether the Gazette can attract enough readers to become a sustainable operation, and I will work on the Gazette until 2024 to make that call. The <a href=\"https;//ghost.org\">Ghost publishing platform</a> powering this blog since 2021 is for people who believe in this vision (mostly in domains other than science):</p><blockquote>Ghost is a powerful app for new-media creators to publish, share, and grow a business around their content. It comes with modern tools to build a website, publish content, send newsletters & offer paid subscriptions to members. – <a href=\"https://ghost.org/\">Ghost Homepage</a></blockquote><p>Future plans for the <em>Front Matter Gazette</em> in case of a successful start focus on expanding the coverage – five stories a week is not even the tip of the iceberg of what's happening every week in scholarship.</p><h3 id=\"what-is-the-relationship-to-the-rogue-scholar\">What is the relationship to the Rogue Scholar?</h3><p><a href=\"https://rogue-scholar.org/\">The Rogue Scholar</a> is a science blog archive that I am working on and plan to launch in Q2 2023. Making sure that science blogs can be found over time with the help of full-text search, DOIs plus metadata, and long-term archiving is the first critical step. Using this open content in creative ways is the next step, and curation is one important aspect that I try to start addressing with the <em>Front Matter Gazette</em>. The <em>Front Matter Gazette</em> will highlight all kinds of scholarly content, not just blogs, and not only content archived in the Rogue Scholar, but there are of course synergies that I will try to explore.</p><h3 id=\"what-is-in-the-first-issue-of-the-front-matter-gazette\">What is in the first issue of the Front Matter Gazette?</h3><p>In the February 1st issue I will talk about Neanderthal families, ChatGPT in science publishing, the Tidyverse, eradicating an infectious disease, and medieval manuscripts.</p> "}