{"id":"https://doi.org/10.53731/a0d9m3n-n7r8h0m","title":"Guidelines for Scholarly Blogs","link":"https://doi.org/10.53731/a0d9m3n-n7r8h0m","published":"2023-02-06T11:52:24.000+00:00","description":"These guidelines are recommendations for authors of scholarly blogs to help with long-term archiving, discoverability, and citation of blog content.They are modeled after the publication A Data Citation...","isPermalink":true,"tags":["Feature"],"authors":[{"name":"Martin Fenner","url":"https://orcid.org/0000-0003-1419-2405"}],"image":"https://images.unsplash.com/photo-1584631277142-0ca0cfc76aec?crop&#x3D;entropy&cs&#x3D;tinysrgb&fit&#x3D;max&fm&#x3D;jpg&ixid&#x3D;MnwxMTc3M3wwfDF8c2VhcmNofDZ8fGd1aWRlbGluZXxlbnwwfHx8fDE2NzU2ODM0NDc&ixlib&#x3D;rb-4.0.3&q&#x3D;80&w&#x3D;2000","modified":"2023-02-06T11:52:24.000+00:00","contentHtml":" <p><img src=\"https://images.unsplash.com/photo-1584631277142-0ca0cfc76aec?crop&#x3D;entropy&cs&#x3D;tinysrgb&fit&#x3D;max&fm&#x3D;jpg&ixid&#x3D;MnwxMTc3M3wwfDF8c2VhcmNofDZ8fGd1aWRlbGluZXxlbnwwfHx8fDE2NzU2ODM0NDc&ixlib&#x3D;rb-4.0.3&q&#x3D;80&w&#x3D;2000\"></p><p>These guidelines are recommendations for authors of scholarly blogs to help with long-term archiving, discoverability, and citation of blog content.<br>They are modeled after the publication <a href=\"https://doi.org/10.1038/s41597-019-0031-8\">A Data Citation Roadmap for Scholarly Data Repositories</a>, where many of the same guidelines apply, and where I was the first author and <a href=\"https://force11.org/group/data-citation-implementation-group/\">co-chair of the corresponding Force11 working group.</a></p><p>These guidelines focus on the required or recommended work for scholarly blog authors. For scholarly blog archives such as the <a href=\"https://rogue-scholar.org\">Rogue Scholar</a>, additional guidelines are in development.</p><!--kg-card-begin: html--><table>\n<thead>\n<tr>\n<th>Level</th>\n<th style=\"text-align: right\">#</th>\n<th>Guideline</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Required</td>\n<td style=\"text-align: right\">1</td>\n<td>The full-text content <em>must</em> be made available via public RSS feed (in RSS, Atom or JSON Feed format).</td>\n</tr>\n<tr>\n<td>Required</td>\n<td style=\"text-align: right\">2</td>\n<td>Each blog post in the RSS feed <em>must</em> have a title, author(s), and publication date.</td>\n</tr>\n<tr>\n<td>Required</td>\n<td style=\"text-align: right\">3</td>\n<td>Each blog post <em>must</em> have a URL that resolves to a public landing page specific for that blog post.</td>\n</tr>\n<tr>\n<td>Required</td>\n<td style=\"text-align: right\">4</td>\n<td>The full-text content <em>must</em> be made available via a Creative Commons Attribution (CC-BY) license.</td>\n</tr>\n<tr>\n<td>Required</td>\n<td style=\"text-align: right\">5</td>\n<td>The blog must provide documentation about long-term archiving, discoverability, and citation.</td>\n</tr>\n<tr>\n<td>Recommended</td>\n<td style=\"text-align: right\">6</td>\n<td>Each blog post in the RSS feed <em>should</em> have a persistent identifier, description, language, and last updated date.</td>\n</tr>\n<tr>\n<td>Recommended</td>\n<td style=\"text-align: right\">7</td>\n<td>The landing page <em>should</em> include metadata required for citation, and ideally also metadata facilitating discovery, in human-readable and machine-readable format.</td>\n</tr>\n<tr>\n<td>Recommended</td>\n<td style=\"text-align: right\">8</td>\n<td>The machine-readable metadata <em>should</em> use schema.org markup in JSON-LD format.</td>\n</tr>\n<tr>\n<td>Recommended</td>\n<td style=\"text-align: right\">9</td>\n<td>Metadata <em>should</em> be made available via HTML meta tags to facilitate use by reference managers.</td>\n</tr>\n<tr>\n<td>Recommended</td>\n<td style=\"text-align: right\">10</td>\n<td>Metadata <em>should</em> be made available for download in BibTeX and/or another standard bibliographic format.</td>\n</tr>\n</tbody>\n</table><!--kg-card-end: html--><p>The requirement for full-text content via RSS feed and with a CC-BY license comes from the need to make archiving and indexing as simple (and cheap) as possible. Dealing with multiple licenses, private feeds, and private content adds an extra level of complexity and is not supportive of Open Science.</p><p>Metadata via HTML meta tags and JSON-LD (using schema.org markup) are two main strategies to embed metadata in web pages, to support reference managers but also indexers. Schema.org is simpler to work with, e.g. for more complex author information such as separate given and family names, author identifiers such as ORCID, and affiliation information. On the other hand, reference managers and Google Scholar currently use HTML meta tags, and it is sometimes easier to add this information to a blog.</p><p>Registration of DOIs as other persistent identifiers for blog posts is something that I want to provide via the Rogue Scholar archive, as the effort required is not trivial. The information required (mainly title, author(s), publication date, and URL) is readily available via the RSS feed. Of course, displaying these DOIs on the blog is recommended, and for the DOIs to resolve to the blog itself rather than the blog archive at the Rogue Scholar or elsewhere.</p><p>The recommended or optional metadata for science blog posts is of course a big topic that needs more discussion. Description, language, and last updated date seem desired and readily available. References used in blog posts would be fantastic to be included in the metadata, but there is currently no easy and standard way of doing this. For better discoverability, it would make sense to provide geo coordinates and/or temporal information, and all blogs would benefit from using subject classification such as the <a href=\"https://www.oecd.org/science/inno/38235147.pdf\">OECD Fields of Science and Technology</a>, but all this would require significantly more effort.</p><p>These guidelines are a work in progress and are made available as part of the <a href=\"https://docs.rogue-scholar.org/guidelines\">Rogue Scholar Documentation</a>. Feedback is greatly appreciated.</p> "}