{"id":"https://doi.org/10.53731/br9f5xa-a556w2t","title":"Building an archive for scholarly blog posts","link":"https://doi.org/10.53731/br9f5xa-a556w2t","published":"2022-12-12T12:58:33.000+00:00","description":"This blog post is a follow-up to a post in September (Fenner 2022a), where I announced that I had started working on an archive for scholarly blog posts based on the InvenioRDM open-source repository...","isPermalink":true,"tags":["Feature"],"authors":[{"name":"Martin Fenner","url":"https://orcid.org/0000-0003-1419-2405"}],"image":"https://blog.front-matter.io/content/images/2022/12/guidelines-4.png","modified":"2022-12-12T12:58:33.000+00:00","contentHtml":" <p><img src=\"https://blog.front-matter.io/content/images/2022/12/guidelines-4.png\"></p><p>This blog post is a follow-up to a post in September (Fenner 2022a), where I announced that I had started working on an archive for scholarly blog posts based on the <a href=\"https://inveniordm.docs.cern.ch/\">InvenioRDM</a> open-source repository software. In the last two months, I focussed on two activities – besides lots of physical therapy and other training following a stroke earlier this year (Fenner 2022b): helping to make it easier (and safer) to run InvenioRDM in Docker container infrastructure, and working on converting the bolognese metadata conversion Ruby gem (Fenner 2017) to Python (work in progress on <a href=\"https://github.com/front-matter/talbot\">GitHub</a>) to enhance InvenioRDM functionality. </p><p>Building an archive of scholarly blog posts faces the same fundamental challenges as repositories for other types of scholarly content, whether data, software, preprints, or journal articles. You have to collect metadata and content, and that approach only scales with standardization and open licenses.</p><p>Luckily we already know a lot about required and optional but desired scholarly metadata, and they are fundamentally not different for scholarly blog posts. This means we can take similar approaches as we have for example taken for research data:</p><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img src=\"https://blog.front-matter.io/content/images/2022/12/guidelines-3.png\" class=\"kg-image\" alt loading=\"lazy\" width=\"815\" height=\"363\" srcset=\"https://blog.front-matter.io/content/images/size/w600/2022/12/guidelines-3.png 600w, https://blog.front-matter.io/content/images/2022/12/guidelines-3.png 815w\" sizes=\"(min-width: 720px) 720px\"><figcaption><strong>Guidelines for Repositories. </strong>Fenner et al. 2019.</figcaption></figure><p>Persistent identifiers for blog posts can be DOIs, as this blog is doing since earlier this year (Fenner 2022). The main advantage of using DOIs is registering standard metadata stored independently of the blogging platform, in case the platform changes or disappears (as has happened several times in the 15 years this blog exists). While there are several blogs using DOIs for their posts, they often fail in guideline #4: <em>the persistent identifier must be embedded in the landing page in machine-readable format. </em>This is important so that reference managers can capture the DOI and retrieve the associated metadata.</p><p>When the metadata are embedded directly in the blog post, schema.org markup in JSON-LD format (guideline #7) is much more convenient than HTML meta tags (guideline #8), but for the time being reference managers only work with the latter. The blogging platform used for this blog (<a href=\"https://ghost.org/\">https://ghost.org/</a>) has schema.org metadata built in, and there was only a small amount of work needed to expose all metadata needed (or desired) for DOI registration:</p><ul><li><a href=\"https://support.google.com/webmasters/answer/10347851\"><strong>Canonical URL</strong></a>: the DOI for the blog post</li><li><strong>License</strong>: the Creative Commons license for the content (this blog uses the <a href=\"https://creativecommons.org/licenses/by/4.0/legalcode\">Creative Commons Attribution 4.0 License</a>)</li><li><strong>ISSN</strong>: the Internal Standard Serial Number of this blog (2749-9952)</li></ul><p>An issue I have seen with schema.org metadata is that sometimes they are added by a script running in the browser instead of coming from the server, and this makes metadata harvesting unreliable. Multiple versions and different levels of granularity – a major challenge when working with data and software – luckily is not a major issue with scholarly blogs, in this regard, they behave similarly to preprints and journal articles.</p><h3 id=\"infrastructure-for-archiving-scientific-blog-posts\">Infrastructure for Archiving Scientific Blog Posts</h3><p>There are several possible approaches to building infrastructure for scholarly blog posts, and they all have well-known real-world examples:</p><ul><li><strong>A central repository</strong><br>A good example is the <a href=\"https://arxiv.org/\">ArXiv.org e-Print archive</a>, which hosts more than two million preprints in physics, mathematics, computer science, and some other fields, and is doing that for more than 25 years. All content and metadata are registered and stored in a central location (<a href=\"https://blog.arxiv.org/2022/02/17/new-arxiv-articles-are-now-automatically-assigned-dois/\">since earlier this year using DOIs</a>), and then distributed elsewhere, often domain-specific resources such as <a href=\"https://ui.adsabs.harvard.edu/\">ADS</a> (astrophysics) and <a href=\"https://inspirehep.net/\">InspireHEP</a> (high-energy physics). ArXiv is hosted by Cornell University.</li><li><strong>A central archive with content published in many places</strong><br><a href=\" https://pubmed.ncbi.nlm.nih.gov\">PubMed</a> (metadata) and <a href=\" https://www.ncbi.nlm.nih.gov\">PubMed Central</a> (metadata and content) are the main archives of biomedical and life sciences journal literature, again doing this for more than 25 years. The content with metadata is published in many different places but aggregated in PubMed/PubMed Central. Just like ADS and InspireHEP, PubMed and PubMed Central (and <a href=\"https://europepmc.org/\">Europe PMC</a>) are the central resources for scientists in the field to discover the relevant literature. PubMed uses the <a href=\"https://en.wikipedia.org/wiki/PubMed#PubMed_identifier\">PMID</a>, which can be mapped to the corresponding DOI as persistent identifier. For full-text content not included in PubMed Central, PubMed links out to publisher websites. PubMed is hosted by the <a href=\"https://www.nlm.nih.gov/\">National Library of Medicine</a> at the U.S. National Institutes of Health (NIH). NIH is the largest funder in the biomedical and life sciences, and its policies help PubMed Central host content.</li><li><strong>A central archive with content published elsewhere</strong><br>The repository <a href=\"https://zenodo.org/\">Zenodo</a> is the largest generic repository of scholarly content with more than 1.5 million publications, and a million datasets, software, images, and presentations. Almost all content uses open licenses (either one of the Creative Commons licenses or <a href=\"https://opensource.org/licenses\">Open Source Initiative approved licenses</a> for software), facilitating the reuse of the content. Zenodo issues DOIs for its content, the DOI points to the Zenodo repository also for content originally registered elsewhere (e.g. software hosted on GitHub). Zenodo is particularly relevant for the planned blog posts archive, as the InvenioRDM software is based on Zenodo software and work is in progress for InvenioRDM to power Zenodo. Zenodo is hosted by <a href=\"https://home.cern/\">CERN</a>, the European Organization of Nuclear Research, the central resource for high-energy physics research.</li></ul><p>Based on the above, what makes sense for a scholarly blog post archive?</p><ul><li>Blogs are very decentralized based on their technology and 20-year history. While blogging platforms also have a long history (and Wordpress is the elephant in the room powering more than <a href=\"https://blog.hubspot.com/website/wordpress-stats\">40% of all websites</a>), a central blogging platform for science blogs similar to what ArXiv is doing in several fields is neither realistic nor desirable.</li><li>DOIs are a good fit as persistent identifiers for scholarly blogs. A lot of tools and services exist for them (including the InvenioRDM open source software), and the required and desired metadata for blogs are basically covered by DOI metadata (at least for Crossref and DataCite DOIs). Minor issues are that there is no dedicated content type for blog posts and that <strong>feature image</strong> metadata (supported by schema.org) would be beneficial.</li><li>The business models for DOI registrations need to be adapted to work better for scholarly blogs. A high fixed annual fee (DataCite) or a DOI pointing to a central archive instead of the original content (software in Zenodo) are hurdles for the long tail of independent science bloggers.</li><li>We need business models for sustainable science blogging infrastructure. Advertisements aren't working (the German platform scienceblogs.de is for example closing at the end of year) and individual readers paying for content might work for popular newsletters but doesn't align with Open Science practices. More work is needed, but one key element is cheap and simple infrastructure.</li><li>Existing blogging software (e.g. <a href=\"https://wordpress.org/\">Wordpress</a>, <a href=\"https://ghost.org/\">Ghost</a>, <a href=\"https://gohugo.io/\">Hugo</a>, or <a href=\"https://jekyllrb.com/\">Jekyll</a>) <em>almost</em> works for scholar blogs. Some minor changes (particularly around the canonical URL/persistent identifier) are required to improve the use in reference managers and archiving services.</li><li>We need a standard archiving format for scholarly blogs. <a href=\"https://jats.nlm.nih.gov/\">JATS</a> (Journal Article Tag Suite) is a standard for scholarly articles, but probably too heavy for blog posts. More work is needed and it should align with <a href=\"https://en.wikipedia.org/wiki/RSS\">RSS</a> (Really Simple Syndication), the 20-year-old standard for distributing content from blogs and similar sources.  The biggest gap is maybe a standard way to describe links and references.</li><li>We need aggregation of science blog metadata and content in a central archive. This enables much easier discovery and long-term archiving, I still enjoy reading an interview I did with Geoff Bilder in 2009 (Fenner 2009), and the points he makes are still relevant. The blog posts had moved at least three times over the years and would have greatly benefitted from a DOI, standard archiving format, and a long-term archive as home. </li><li>I have started the work of building the infrastructure for archiving scholarly blogs, but I am fully aware that this is not only a technical challenge but even more so one of governance and community engagement. This needs much more work in 2023 and onwards, and something I look forward to working on jointly with others.</li></ul><h3 id=\"references\">References</h3><p>Fenner, M. (2022a). <em>Starting Work on the Front Matter Archive</em> [Blog]. Front Matter. <a href=\"https://doi.org/10.53731/9z6rz5d-djbay0y\">https://doi.org/10.53731/9z6rz5d-djbay0y</a></p><p>Fenner, M. (2022b). <em>I spent the last five months in the hospital</em> [Blog]. Front Matter. <a href=\"https://doi.org/10.53731/bkkzj8g-gd14mb6\">https://doi.org/10.53731/bkkzj8g-gd14mb6</a></p><p>Fenner, M. (2017). <em>Bolognese: A Ruby library for conversion of DOI Metadata</em>. DataCite. <a href=\"https://doi.org/10.5438/N138-Z3MK\">https://doi.org/10.5438/N138-Z3MK</a></p><p>Fenner, M., Crosas, M., Grethe, J. S., Kennedy, D., Hermjakob, H., Rocca-Serra, P., Durand, G., Berjon, R., Karcher, S., Martone, M., & Clark, T. (2019). A data citation roadmap for scholarly data repositories. <em>Scientific Data</em>, <em>6</em>(1), Article. <a href=\"https://doi.org/10.1038/s41597-019-0031-8\">https://doi.org/10.1038/s41597-019-0031-8</a></p><p>Fenner, M. (2022c). <em>DOI Registrations for all Ghost Blogs</em> [Blog]. Front Matter. <a href=\"https://doi.org/10.53731/fezg09h-hgn1gzm\">https://doi.org/10.53731/fezg09h-hgn1gzm</a></p><p>Fenner, M. (2009). <em>Interview with Geoffrey Bilder</em> [Blog]. Front Matter. <a href=\"https://doi.org/10.53731/r294649-6f79289-8cw1h\">https://doi.org/10.53731/r294649-6f79289-8cw1h</a></p> "}