{"id":"https://doi.org/10.53731/wa7k5-v4t16","title":"Starting the Rogue Scholar OPML Feed","link":"https://doi.org/10.53731/wa7k5-v4t16","published":"2023-03-22T10:42:17.000+00:00","description":"While the launch of the Rogue Scholar blog archive is still a few months away (happening in the second quarter of this year), I want to give an update on the ongoing work.The Rogue Scholar blog archive will...","isPermalink":true,"tags":[],"authors":[{"name":"Martin Fenner","url":"https://orcid.org/0000-0003-1419-2405"}],"image":"https://images.unsplash.com/photo-1611864581049-aca018410b97?crop&#x3D;entropy&cs&#x3D;tinysrgb&fit&#x3D;max&fm&#x3D;jpg&ixid&#x3D;MnwxMTc3M3wwfDF8c2VhcmNofDQzfHxmZWVkfGVufDB8fHx8MTY3OTQ3NDc2NQ&ixlib&#x3D;rb-4.0.3&q&#x3D;80&w&#x3D;2000","modified":"2023-03-22T10:42:17.000+00:00","contentHtml":" <p><img src=\"https://images.unsplash.com/photo-1611864581049-aca018410b97?crop&#x3D;entropy&cs&#x3D;tinysrgb&fit&#x3D;max&fm&#x3D;jpg&ixid&#x3D;MnwxMTc3M3wwfDF8c2VhcmNofDQzfHxmZWVkfGVufDB8fHx8MTY3OTQ3NDc2NQ&ixlib&#x3D;rb-4.0.3&q&#x3D;80&w&#x3D;2000\"></p><p>While the launch of the <a href=\"https://rogue-scholar.org/\">Rogue Scholar</a> blog archive is still a few months away (happening in the second quarter of this year), I want to give an update on the ongoing work.</p><p>The <em>Rogue Scholar</em> blog archive will improve science blogs in important ways,<br>including full-text search, DOIs and metadata, and long-term archiving. The central piece of the underlying infrastructure is the <a href=\"https://inveniosoftware.org/products/rdm/\">InvenioRDM </a>open source repository software. Front Matter is one of the organizations helping with InvenioRDM development. For the <em>Rogue Scholar,</em> the specific work needed includes the following:</p><h3 id=\"support-for-rss-feeds\">Support for RSS Feeds</h3><p>All blogs provide RSS feeds, which will be central to automatically fetching metadata and content for the <em>Rogue Scholar</em>. RSS is not built into InvenioRDM and is not needed by most organizations planning to run InvenioRDM. I will therefore build a separate service for this functionality, integrating with InvenioRDM via its REST API. For a blog to be archived and indexed in the <em>Rogue Scholar</em>, users will use this RSS service, providing basic information such as RSS feed URL, language, license, and contact person – basically the information collected for the <em>Rogue Scholar</em> <a href=\"https://jvinjjenjik.typeform.com/to/uxgAsHPl?typeform-source=rogue-scholar.org\">waitlist</a> (feel free to sign up your blog if you haven't already).</p><p>Next Tuesday I will publish an <a href=\"https://en.wikipedia.org/wiki/OPML\">OPML</a> (Outline Processor Markup Language) file with all blogs on the <em>Rogue Scholar</em> waitlist. OPML is the standard for importing and exporting lists of blogs, e.g. when switching from one RSS reader to another. It is a natural fit for managing blogs in <em>Rogue Scholar</em>, and hopefully helps people sign up for interesting science blogs they want to read. If you are on the <em>Rogue Scholar </em>waitlist, please make sure your RSS Feed URL and Home Page URL are correct, and – if you haven't done so already – pick one (and only one) of the top-level categories from the <a href=\"https://www.oecd.org/science/inno/38235147.pdf\">OECD Fields of Science and Technology</a>:</p><ul><li>Natural Sciences</li><li>Engineering and Technology</li><li>Medical and Health Sciences</li><li>Agricultural Sciences</li><li>Social Sciences</li><li>Humanities</li></ul><p>The OPML file (and your RSS reader if you import that file) will group science blogs into these categories. Many blogs fall into more than one category, but that isn't supported by OPML. </p><h3 id=\"hosting-rogue-scholar-infrastructure\">Hosting Rogue Scholar infrastructure</h3><p>There are <a href=\"https://inveniordm.docs.cern.ch/install/\">several ways</a> to run InvenioRDM repository software, obviously depending on the resources available at the hosting organization, and the size and complexity of the repository. A small data repository for a university department has different needs than <a href=\"https://zenodo.org/\">Zenodo</a>, one of the most popular generalist repositories with almost three million records. The <em>Rogue Scholar</em> sits in the middle, a small to medium-sized repository, anticipating 2,000 to 20,000 blog posts twelve months after launch. InvenioRDM relies on <a href=\"https://www.docker.com/\">Docker</a> and Kubernetes for running production services. This makes sense for large instances such as Zenodo but adds unnecessary complexity to smaller instances such as the <em>Rogue Scholar</em>.</p><p>After a substantial amount of deliberation and discussion, I decided to use a different approach for the <em>Rogue Scholar</em>, and this might potentially be of interest to other organizations planning to use InvenioRDM:</p><ul><li>Using virtual machines instead of Docker containers</li><li>Automation of virtual machine building with <a href=\"https://www.packer.io/\">Packer</a> and <a href=\"https://www.ansible.com/\">Ansible</a></li><li>Hosting of virtual machines by cloud provider <a href=\"https://www.digitalocean.com/\">DigitalOcean</a>, fundamentally similar to hosting a Wordpress or Ghost blog</li><li>Making the automation generic to also work for other InvenioRDM instances, and other infrastructure providers, e.g. <a href=\"https://www.openstack.org/\">Openstack</a></li></ul><p>This will be the focus of my work in the next three months, and luckily I have learned a lot about infrastructure automation in my previous jobs at <a href=\"https://plos.org/\">PLOS</a> and <a href=\"https://datacite.org/\">DataCite</a>.</p><h3 id=\"support-for-crossref-doi-registration\">Support for Crossref DOI registration</h3><p>By default, InvenioRDM uses DataCite DOIs, but <em>Rogue Scholar</em> will use Crossref DOIs for blogs that don't already use DOIs. The Crossref pricing is much more favorable for startups such as Front Matter, and for annual DOI registration numbers that at least initially will be in the 100s or low 1000s. I spent a good part of January and February writing a Python scholarly metadata conversion library that I released two weeks ago (<a href=\"https://pypi.org/project/commonmeta-py/\">commonmeta-py</a>). Among other things, commonmeta-py can read and write Crossref metadata and can enable Crossref DOI registrations in InvenioRDM – which is written in Python (and Javascript for the frontend).</p><p>As always, reach out to me with questions and comments.</p> "}