{"id":"https://doi.org/10.53731/fawv321-14359c4","title":"Announcing commonmeta-ruby","link":"https://doi.org/10.53731/fawv321-14359c4","published":"2023-03-20T14:54:00.000+00:00","description":"Following recent announcements of the commonmeta standard for scholarly metadata and a Python package that converts several metadata formats (commonmeta-py), today I am happy to announce commonmeta-ruby, a...","isPermalink":true,"tags":["News"],"authors":[{"name":"Martin Fenner","url":"https://orcid.org/0000-0003-1419-2405"}],"image":"https://images.unsplash.com/photo-1676284572206-2501ff5c6956?crop&#x3D;entropy&cs&#x3D;tinysrgb&fit&#x3D;max&fm&#x3D;jpg&ixid&#x3D;MnwxMTc3M3wwfDF8c2VhcmNofDUwfHxiaWtlJTIwbSVDMyVCQ25zdGVyfGVufDB8fHx8MTY3OTMyMTU4MA&ixlib&#x3D;rb-4.0.3&q&#x3D;80&w&#x3D;2000","modified":"2023-03-22T12:32:52.000+00:00","contentHtml":" <p><img src=\"https://images.unsplash.com/photo-1676284572206-2501ff5c6956?crop&#x3D;entropy&cs&#x3D;tinysrgb&fit&#x3D;max&fm&#x3D;jpg&ixid&#x3D;MnwxMTc3M3wwfDF8c2VhcmNofDUwfHxiaWtlJTIwbSVDMyVCQ25zdGVyfGVufDB8fHx8MTY3OTMyMTU4MA&ixlib&#x3D;rb-4.0.3&q&#x3D;80&w&#x3D;2000\"></p><p>Following recent announcements of the <a href=\"https://commonmeta.org\">commonmeta</a> standard for scholarly metadata and a Python package that converts several metadata formats (<a href=\"https://github.com/front-matter/commonmeta-py\">commonmeta-py</a>), today I am happy to announce <a href=\"https://github.com/front-matter/commonmeta-ruby\">commonmeta-ruby</a>, a Ruby gem and command-line tool to convert scholarly metadata using commonmeta as the internal format. commonmeta-ruby is based on the <a href=\"https://github.com/datacite/bolognese\">bolognese Ruby library</a> that I started a few ago while working at DataCite, but is a major rewrite that uses commonmeta as its intermediary conversion format.</p><p>Originally planned for later this year, I decided to speed up the release as Ruby version 2.x (currently 2.7.7) reaches its <a href=\"https://endoflife.date/ruby\">end of life</a> this month, and <a href=\"https://rubygems.org/gems/briard\">briard</a> (the fork I wrote to support additional metadata conversions such as <a href=\"https://citation-file-format.github.io/\">Citation File Format</a> and Crossref DOI registrations) didn't fully work with Ruby 3.x. In addition to supporting Ruby 3.x and validating with the <a href=\"https://commonmeta.org/schema\">commonmeta JSON Schema</a>, commonmeta-ruby dropped support for DataCite XML. The DataCite REST API has always been a JSON API, and DOI registration using DataCite XML for many years has used JSON under the hood. Metadata conversion using XML is painful, and focussing on JSON metadata simplifies further development.</p><p>The next steps for commonmeta are:</p><ul><li>Refine the commonmeta-py and commonmeta-ruby libraries by adding tests and real-world implementations (such as the DOI registration for this blog post, which was done using commonmeta-ruby)</li><li>Work towards a commonmeta v1.0 JSON Schema</li><li>Add support for bibliographies (lists of resources) to commonmeta.</li><li>Commonmeta implementations in additional languages, in particular Javascript/Typescript.</li></ul> "}