{"id":"https://doi.org/10.53731/9z6rz5d-djbay0y","title":"Starting Work on the Front Matter Archive","link":"https://doi.org/10.53731/9z6rz5d-djbay0y","published":"2022-09-28T16:10:57.000+00:00","description":"In August 2021 I joined the InvenioRDM project to help develop and host a modern repository platform for scholarly content. Things didn't exactly go as planned at the beginning of 2022, and I spent five...","isPermalink":true,"tags":["News"],"authors":[{"name":"Martin Fenner","url":"https://orcid.org/0000-0003-1419-2405"}],"image":"https://images.unsplash.com/photo-1628046902759-c94ab525fdaf?crop&#x3D;entropy&cs&#x3D;tinysrgb&fit&#x3D;max&fm&#x3D;jpg&ixid&#x3D;MnwxMTc3M3wwfDF8c2VhcmNofDE1fHxhcmNoaXZlfGVufDB8fHx8MTY2NDM3NDk3OA&ixlib&#x3D;rb-1.2.1&q&#x3D;80&w&#x3D;2000","modified":"2022-09-28T16:11:52.000+00:00","contentHtml":" <p><img src=\"https://images.unsplash.com/photo-1628046902759-c94ab525fdaf?crop&#x3D;entropy&cs&#x3D;tinysrgb&fit&#x3D;max&fm&#x3D;jpg&ixid&#x3D;MnwxMTc3M3wwfDF8c2VhcmNofDE1fHxhcmNoaXZlfGVufDB8fHx8MTY2NDM3NDk3OA&ixlib&#x3D;rb-1.2.1&q&#x3D;80&w&#x3D;2000\"></p><p>In August 2021 <a href=\"https://doi.org/10.53731/r8c26t1-97aq74v-ag66m\">I joined the InvenioRDM project</a> to help develop and host a modern repository platform for scholarly content. Things didn't exactly go as planned at the beginning of 2022, and I spent <a href=\"https://doi.org/10.53731/bkkzj8g-gd14mb6\">five months in the hospital</a> with serious personal health issues. Since returning home in early June, my health has improved considerably, and in September I was able to slowly start working again. This has worked well for me, so it is time to time to set goals for my work on the InvenioRDM project again.</p><h3 id=\"announcing-the-front-matter-archive\">Announcing the Front Matter Archive</h3><blockquote>Front Matter will be launching a repository to host the full-text content of scholarly blogs in the first quarter of 2023. </blockquote><p>The starting point will be the over 450 blog posts that I have published <a href=\"https://doi.org/10.53731/bs60jms-sqaehsk\">over the last 15 years</a>, but the archive is of course open to content from all scholarly blogs. The goal is to both offer a useful resource for the scholarly community and to learn something about hosting InvenioRDM. An archive of scholarly blog posts is a good starting point, as blogs tend to change technology or location every few years, and older content then often becomes unavailable. Issuing DOIs for blog posts is part of the solution (e.g. this makes citing the blog posts much easier), but a stable long-term archive of the content is equally important. A challenge that scholarly blog posts share with many other often ephemeral scholarly resources, e.g. data and software.</p><h3 id=\"setting-up-the-inveniordm-software\">Setting up the InvenioRDM Software</h3><p>The <a href=\"https://inveniosoftware.org/products/rdm/\">InvenioRDM</a> open-source software has seen a lot of work in the last several years and is currently at <a href=\"https://inveniordm.docs.cern.ch/releases/versions/version-v9.1.0/\">version 9.1</a>. Several project partners are working on releasing a production version within the next twelve months, and the Caltech Library was the<a href=\"https://library.caltech.edu/blog/CaltechDATA-InvenioRDM\"> first to do so last week</a>. Repository software is a complex piece of infrastructure, and a lot of work is expected for the proper configuration of the Front Matter Archive, including customization of the theme, authentication, etc.</p><h3 id=\"running-the-front-matter-archive-in-a-kubernetes-cluster\">Running the Front Matter Archive in a Kubernetes Cluster</h3><p><a href=\"https://kubernetes.io/\">Kubernetes</a> in the last few years has become the de facto standard for deploying containerized applications such as InvenioRDM. Unfortunately running a Kubernetes cluster is not easy, but it will make things easier eventually (e.g. monitoring, scaling, and security), and it can be set up in a variety of environments from private clouds to public cloud providers. Front Matter will be using a managed Kubernetes cluster provided by <a href=\"https://www.digitalocean.com/\">Digitalocean</a> and provisioned by the infrastructure as code open source software tool <a href=\"https://www.terraform.io/\">Terraform</a>. Kubernetes will not host everything. At least in the initial version Front Matter will use hosted databases and hosted cloud object storage to store files and metadata, as Kubernetes (and containers) excel when running stateless applications, but more work is needed for <a href=\"https://cloud.google.com/kubernetes-engine/docs/how-to/stateful-apps\">stateful applications</a>.</p><h3 id=\"archiving-full-text-blog-content\">Archiving full-text Blog Content</h3><p>Front Matter will aim to archive blog posts via available APIs (as can be done with the Front Matter Blog), but we will have to take a flexible approach as full-text content will be provided in a variety of formats, e.g. RSS feeds. The initial focus will be on the <a href=\"https://ghost.org/\">Ghost</a> and <a href=\"https://wordpress.org/\">Wordpress</a> blogging platforms. We will help with issuing DOIs for this content and help to archive associated images. We are only interested in content with an open license (<a href=\"https://creativecommons.org/licenses/by/4.0/\">CC-BY</a> or <a href=\"https://creativecommons.org/publicdomain/zero/1.0/\">CCO</a>) to maximize the potential reuse of the blog archive.</p><h3 id=\"future-of-the-archive\">Future of the Archive</h3><p>After the initial setup of the blog archive, the focus will be on expanding content and on providing added value. Please reach out via email, Discord, or comments if you have scholarly blog content you want to be archived by Front Matter, or have suggestions for added functionality. One feature I want to see improved in InvenioRDM is better support for full-text HTML in addition to embedding PDF and other formats. In the coming months, I will also work on the cost model. There is a moderate cost to archive a blog post (mostly for ingesting content), but these costs would add up if blog posts are added by the thousands.</p> "}