{"id":"https://doi.org/10.53731/avg2ykg-gdxppcd","title":"Do we need to fix science blogs?","link":"https://doi.org/10.53731/avg2ykg-gdxppcd","published":"2023-01-25T15:14:17.000+00:00","description":"Science blogs have been around for at least 20 years and have become an important part of science communication. So are there any fundamental issues that need fixing?Barriers to EntryBlogging platforms are...","isPermalink":true,"tags":["Feature"],"authors":[{"name":"Martin Fenner","url":"https://orcid.org/0000-0003-1419-2405"}],"image":"https://images.unsplash.com/photo-1585838017777-5003198884b5?crop&#x3D;entropy&cs&#x3D;tinysrgb&fit&#x3D;max&fm&#x3D;jpg&ixid&#x3D;MnwxMTc3M3wwfDF8c2VhcmNofDMyfHxicm9rZW58ZW58MHx8fHwxNjc0NjUyMTEy&ixlib&#x3D;rb-4.0.3&q&#x3D;80&w&#x3D;2000","modified":"2023-02-01T15:43:22.000+00:00","contentHtml":" <p><img src=\"https://images.unsplash.com/photo-1585838017777-5003198884b5?crop&#x3D;entropy&cs&#x3D;tinysrgb&fit&#x3D;max&fm&#x3D;jpg&ixid&#x3D;MnwxMTc3M3wwfDF8c2VhcmNofDMyfHxicm9rZW58ZW58MHx8fHwxNjc0NjUyMTEy&ixlib&#x3D;rb-4.0.3&q&#x3D;80&w&#x3D;2000\"></p><p>Science blogs have been around for at least 20 years and have become an important part of science communication. So are there any fundamental issues that need fixing?</p><h3 id=\"barriers-to-entry\">Barriers to Entry</h3><p>Blogging platforms are mature at this point, and the technology is not imposing barriers to entry for most people. The user experience has greatly improved over the last few years and there are a number of affordable ways for hosting a blog that also work for science blogs, including free options such as <a href=\"https://pages.github.com/\">GitHub Pages</a>.</p><h3 id=\"open-access\">Open Access</h3><p>Science blogs have traditionally been free to read, but there is a general trend towards subscriptions for blogs (and related newsletters), as the advertising business model isn't really working for niche content such as most science. How to sustain science blogging in the long run is an unresolved question, and charging authors (beyond a nominal hosting fee) doesn't look like a path forward. Luckily the costs of publishing science blogs are very reasonable compared to journal publishing or hosting research data and code.</p><h3 id=\"missing-functionality\">Missing Functionality</h3><p>The basic functionality of formatted text with embedded figures and links is supported by many blogging platforms. The requirements of data-intensive science, e.g. interactive visualizations, can be a challenge, but that is also true for publishing journal articles. Interactive environments such as <a href=\"https://jupyter.org/\">Jupyter Notebooks</a> might be a better fit for these use cases. </p><p>Reference management is probably the biggest gap in science blogging, as handling more than a few references in standard ways is not easily done by hand.</p><h3 id=\"impact-or-credit\">Impact or Credit</h3><p>Unfortunately a lot of the activities of scholars are driven by perceived <em>Impact </em>or<em> Credit</em>, and science blogs typically don't score high in this regard – with the exception of some disciplines such as mathematics. There is probably no short-term solution, and I am not even sure it is a problem that needs fixing. </p><p>The long-term solution should focus on increasing the visibility and thus discoverability of science blogs to reach a larger audience. As I discussed in a <a href=\"https://doi.org/10.53731/br9f5xa-a556w2t\">previous post</a>, my preferred approach is a central repository for science blog content originally published in many different locations (the PubMed/PubMed Central) model.</p><h3 id=\"persistence\">Persistence</h3><p>This leaves persistence as the other main problem with science blogs besides discoverability that needs fixing. Link rot (the resource identified by a URI vanishes from the web) and content drift (the resource identified by a URI changes over time) are <a href=\"https://ceur-ws.org/Vol-3246/10_Paper3.pdf\">well-known problems with digital content</a>, from <a href=\"https://www.theverge.com/2021/5/21/22447690/link-rot-research-new-york-times-domain-hijacking\">newspapers</a> to scholarly content. There are mainly two approaches to address this problem:</p><ul><li><strong>Archiving</strong> using generic services such as the <a href=\"https://archive.org/\">Internet Archive</a> and specialized services such as <a href=\"https://www.softwareheritage.org/\">Software Heritage</a> for software source code or <a href=\"https://www.portico.org/\">Portico</a> for scholarly content.</li><li><strong>Persistent Identifiers</strong> by maintaining links independent of URL host and path, both of which may change over time. This <a href=\"https://doi.org/10.53731/r294649-6f79289-8cw1h\">blog post of mine</a> is almost 14 years old, and the URL has changed at least four times as I changed blogging platforms. Since 2021 the post has had a persistent identifier in form of a DOI, and that DOI will not change going forward, eventually pointing to an archive when I retire.</li></ul><p>Some science blog content is ephemeral and may not be worth archiving, but a lot of content is still worth reading years later (the <a href=\"ttps://doi.org/10.53731/r294649-6f79289-8cw1q\">first post of this blog</a> is more than 15 years old), even if only to provide historical context.</p><h3 id=\"conclusions\">Conclusions</h3><p>In summary, we don't need to <em>fix everything</em> with science blogs but rather focus on two aspects: discoverability and persistence. In doing that we also need to sort out better sustainability for science blogs, and as an added bonus improve their reference management.</p><p>Discoverability and persistence are an issue for all science blogs, and we are trying to fix them by launching the <a href=\"https://rogue-scholar.org/\">Rogue Scholar</a> in the second quarter of 2023. If you are managing a science blog and care about discoverability and persistence, sign up for the <a href=\"https://rogue-scholar.org/\">Rogue Scholar waitlist</a>. Particularly if your blog is no longer actively maintained, for example blogs hosted by grant-funded projects that have ended or are ending soon.</p><p>Today I launched the <a href=\"https://docs.rogue-scholar.org\">Rogue Scholar Documentation</a> site, where I will document how to use the Rogue Scholar, e.g. what you can do to prepare your science blog for Rogue Scholar archiving. The site is written in markdown and hosted on GitHub, so feel free to ask questions or suggest additions via the links provided by the documentation site.</p> "}