{"id":"https://doi.org/10.53731/d6vdvbt-tffmezj","title":"RSS, Atom, JSON Feed","link":"https://doi.org/10.53731/d6vdvbt-tffmezj","published":"2023-01-16T16:57:54.000+00:00","description":"As I discussed in a recent post, RSS is an essential building block for the upcoming Rogue Scholar Scholarly Blog Archive. RSS makes it easy to import blog posts (both metadata and content) automatically and...","isPermalink":true,"tags":["Feature"],"authors":[{"name":"Martin Fenner","url":"https://orcid.org/0000-0003-1419-2405"}],"image":"https://images.unsplash.com/photo-1597092451116-27787c07901d?crop&#x3D;entropy&cs&#x3D;tinysrgb&fit&#x3D;max&fm&#x3D;jpg&ixid&#x3D;MnwxMTc3M3wwfDF8c2VhcmNofDJ8fGFyY2hpdmV8ZW58MHx8fHwxNjczODg2NDI2&ixlib&#x3D;rb-4.0.3&q&#x3D;80&w&#x3D;2000","modified":"2023-01-16T17:06:53.000+00:00","contentHtml":" <p><img src=\"https://images.unsplash.com/photo-1597092451116-27787c07901d?crop&#x3D;entropy&cs&#x3D;tinysrgb&fit&#x3D;max&fm&#x3D;jpg&ixid&#x3D;MnwxMTc3M3wwfDF8c2VhcmNofDJ8fGFyY2hpdmV8ZW58MHx8fHwxNjczODg2NDI2&ixlib&#x3D;rb-4.0.3&q&#x3D;80&w&#x3D;2000\"></p><p>As I discussed in a <a href=\"https://doi.org/10.53731/eyf75cj-jsgv26c\">recent post</a>, RSS is an essential building block for the upcoming <a href=\"https://rogue-scholar.org\">Rogue Scholar</a> Scholarly Blog Archive. RSS makes it easy to import blog posts (both metadata and content) automatically and is supported by all blogging platforms. This kind of automation is critical to keep the costs of running the Rogue Scholar low, allowing it to scale to cover a substantial number of science blog posts, and hopefully becoming an important Open Science resource.</p><p>But there are also challenges with using RSS:</p><ul><li>RSS is not a single standard but comes in multiple flavors: multiple versions of RSS, Atom, and the newer <a href=\"https://www.jsonfeed.org/\">JSON Feed</a>. Most libraries for consuming RSS (e.g. the Python <a href=\"https://github.com/kurtmckee/feedparser\">feedparser</a>) can handle RSS and Atom, and fewer tools (e.g. the Python <a href=\"https://pypi.org/project/reader/\">feeder</a>) also support the newer JSON Feed.</li><li>The Rogue Scholar will use the <a href=\"https://inveniordm.docs.cern.ch/\">InvenioRDM</a> open source platform, which uses <a href=\"https://opensearch.org/\">OpenSearch</a> to index content and metadata. OpenSearch – just like Elasticsearch on which it is based – works with JSON. Indexing and archiving science blogs therefore should first convert RSS and Atom feeds onto JSON, and JSON Feed, <a href=\"https://www.jsonfeed.org/mappingrssandatom/\">which has been mapped from RSS and Atom</a>, is the obvious choice.</li><li>Some blogs prefer to only publish summaries in their RSS feeds, there have been many discussions on this topic over the years. It would complicate the operation of the Rogue Scholar if full-text content has to retrieved by other means, and archiving full-text content is the primary goal for the Rogue Scholar. The Rogue Scholar needs one feed that provides the full-text content, it doesn't have to be the default blog feed.</li><li>Blogs, in particular personal blogs, may publish content that is out of the scope of the main science topics of the blog. Occasional out-of-scope posts, e.g. talking about major events such as job changes, sickness, or travel, are probably ok, and add a personal note. If this is frequently the case, and this has come up twice in initial Rogue Scholar discussions, it probably makes sense to provide a filtered RSS feed (e.g. using tags) with only a subset of posts.</li><li>Describing a blog and associated metadata (e.g. name, feed URL, language, license, contact) is not something that easily maps how InvenioRDM is modeled. The obvious choice would be <a href=\"https://inveniordm.web.cern.ch/communities\">communities</a>, but they can also be seen as a higher level of aggregation, e.g. all blog posts about biodiversity independent of the blog source. For now I will work with communities and enhance the InvenioRDM functionality where it also makes sense for other InvenioRDM use cases, of course coordinating with the InvenioRDM community.</li></ul><p>Two weeks ago I opened up the <a href=\"https://jvinjjenjik.typeform.com/to/uxgAsHPl\">waitlist</a> for the Rogue Scholar, and I am happy with the feedback I have received so far: sixteen submissions and a number of encouraging discussions. Consider adding your science blog to the waitlist, or learn more at the <a href=\"https://rogue-scholar.org\">Rogue Scholar</a> website. If you have questions, post them in the comments or join the <a href=\"https://discord.gg/wZcqPt4p\">Discord channel </a>(renamed from Front Matter to Rogue Scholar).</p><p>It has not escaped our notice that the specific use of RSS we have postulated immediately suggests a possible mechanism for the archiving and DOI registration of other scholarly content.</p> "}