{"id":"https://doi.org/10.53731/cbdtfp1-1798beh","title":"Launching the Front Matter Roadmap","link":"https://doi.org/10.53731/cbdtfp1-1798beh","published":"2022-12-19T14:20:17.000+00:00","description":"In a blog post last week I talked about what I am currently working on, namely a) helping to make it easier (and safer) to run the InvenioRDM digital repository software in Docker container infrastructure,...","isPermalink":true,"tags":["News"],"authors":[{"name":"Martin Fenner","url":"https://orcid.org/0000-0003-1419-2405"}],"image":"https://blog.front-matter.io/content/images/2022/12/Bildschirm-foto-2022-12-19-um-15.16.52.png","modified":"2022-12-19T14:20:17.000+00:00","contentHtml":" <p><img src=\"https://blog.front-matter.io/content/images/2022/12/Bildschirm-foto-2022-12-19-um-15.16.52.png\"></p><p>In a <a href=\"https://doi.org/10.53731/br9f5xa-a556w2t\">blog post last week</a> I talked about what I am currently working on, namely a) helping to make it easier (and safer) to run the <a href=\"https://inveniordm.docs.cern.ch/\">InvenioRDM</a> digital repository software in Docker container infrastructure, and b) working on converting the bolognese metadata conversion Ruby gem <a href=\"https://github.com/front-matter/talbot\">to Python</a> to enhance InvenioRDM functionality. </p><p>To get updates on this work you can follow the <a href=\"https://github.com/front-matter\">Front Matter GitHub repositories</a> – the work I am doing at Front Matter is mostly happening in public code repositories. But maybe you are really only interested in basic information, e.g. what I am working on, when it is ready, and providing some high-level input. There are several ways one can provide this high-level information, but usually, that is too much information for a blog like this one, and too much technical detail in a code repository. There are plenty of tools and services available for this typical <a href=\"https://www.atlassian.com/agile/product-management\">product management work</a>, but most of them are not a good fit more a small startup like Front Matter.</p><p>Today I am announcing four new (and related) ways you can follow the work Front Matter is doing, and provide feedback and other input:</p><ul><li>the <a href=\"https://feedback.front-matter.io/b/8mywxw07/feature-ideas\">Front Matter Ideas</a> Forum, where users can suggest features and improvements for Front Matter services – currently that is services planned to launch in 2023 like the Scholarly Blog Archive mentioned above,</li><li>the <a href=\"https://feedback.front-matter.io/roadmap\">Front Matter Roadmap</a> gives a high-level view (planned/in development/launched) of the work that Front Matter is doing,</li><li>the <a href=\"https://feedback.front-matter.io/announcements\">Front Matter Announcements</a> are a changelog of smaller achievements and bug fixes that don't make it into the Front Matter blog, and</li><li>the <a href=\"https://discord.gg/AZHDtKP3\">Front Matter Discord Server</a> for problems, ideas, and general discussions related to Front Matter.</li></ul><p>And of course, you can also interact with Front Matter via <a href=\"mailto:info@front-matter.io\">email</a> or <a href=\"https://hachyderm.io/@mfenner\">Mastodon</a>. You no longer find Front Matter or me personally on Twitter, as this has become a chaotic, unfriendly, and toxic place with an uncertain future.</p><p>With that, I wish all of you a peaceful and relaxing holiday season and a good start into 2023.</p> "}