{"id":"https://doi.org/10.53731/eyf75cj-jsgv26c","title":"Building Blocks for a Scholarly Blog Archive","link":"https://doi.org/10.53731/eyf75cj-jsgv26c","published":"2022-12-21T14:23:47.000+00:00","description":"Another follow-up post, extending three earlier posts (see references), on the Scholarly Blog Archive that Front Matter is building and that I plan to launch in the first half of 2023. I have been thinking...","isPermalink":true,"tags":["Feature"],"authors":[{"name":"Martin Fenner","url":"https://orcid.org/0000-0003-1419-2405"}],"image":"https://blog.front-matter.io/content/images/2022/12/James_Brown_-55208420--1.jpeg","modified":"2022-12-21T20:57:38.000+00:00","contentHtml":" <p><img src=\"https://blog.front-matter.io/content/images/2022/12/James_Brown_-55208420--1.jpeg\"></p><p>Another follow-up post, extending three earlier posts (see references), on the Scholarly Blog Archive that Front Matter is building and that I plan to launch in the first half of 2023. I have been thinking about the building blocks that make this blog archive work:</p><h3 id=\"diamond-open-access\">Diamond Open Access</h3><blockquote>Diamond open access (OA) is an open access business model in which no fees are charged to either authors or readers. <a href=\"https://www.dfg.de/en/research_funding/announcements_proposals/2022/info_wissenschaft_22_26/index.html\">German Research Foundation</a></blockquote><p>Using this term sounds strange in the context of scholarly blog posts, but it means that scholarly blog infrastructure should be free to publish and free to read. One challenge with Open Access for publications, particularly in disciplines such as medicine and life sciences where there is a lot of money, is that there are no drivers for driving down cost, and subscription fees have often been converted to article processing charges (APC). And instead of technological advances making scholarly publishing cheaper over time, the costs for authors and readers (and their institutions and funders who ultimately pay for this) are only increasing.</p><p>There is of course already a lot of Diamond Open Access, and infrastructures for research data and research software also typically don't charge authors or readers. This causes other problems in terms of sustainable scholarly infrastructure and innovation, but I think it is an essential building block for the science blog archive Front Matter is building. A lot of work is needed in 2023 to come up with a strategy for sustaining the Front Matter science blog archive in the long run, all I can say now is that it will not use advertising.</p><h3 id=\"creative-commons-license\">Creative Commons License</h3><p>For content that is free to read we need a license that specifies that. The blog archive needs clear conditions for what it can do with the content, and the same is true for downstream users and services. History tells us that licenses should be clear and simple, so for scholarly blog posts I will aim to use the <a href=\"https://creativecommons.org/licenses/by/4.0/legalcode\">Creative Commons Attribution 4.0 License</a> (CC-BY 4.0) for all content. </p><figure class=\"kg-card kg-image-card\"><img src=\"https://blog.front-matter.io/content/images/2022/12/cc-by.png\" class=\"kg-image\" alt loading=\"lazy\" width=\"250\" height=\"88\"></figure><h3 id=\"central-blog-archive\">Central Blog Archive</h3><p>As I <a href=\"https://doi.org/10.53731/br9f5xa-a556w2t\">explained in a post last week</a>, a central blog archive for blog content published in many different places makes the most sense for science blog posts – a model also used by <a href=\"https://www.ncbi.nlm.nih.gov/pmc/\">PubMed Central </a>for a free full-text archive of biomedical and life sciences journal articles. The <a href=\"https://inveniordm.docs.cern.ch/\">InvenioRDM</a> Open Source software is a good fit for this use case.</p><figure class=\"kg-card kg-image-card\"><img src=\"https://blog.front-matter.io/content/images/2022/12/Download--4--1.png\" class=\"kg-image\" alt loading=\"lazy\" width=\"372\" height=\"120\"></figure><p>Starting a science blog is straightforward. There are plenty of cheap and free options available from <a href=\"https://wordpress.org/\">Wordpress</a> to <a href=\"https://pages.github.com/\">GitHub Pages</a>. You might run your blog as part of a larger platform, together with collaborators, or all for yourself.</p><h3 id=\"digital-object-identifier-doi-and-metadata\">Digital Object Identifier (DOI) and Metadata</h3><p>DOIs are frequently used as persistent identifiers for scholarly content and are integrated into the InvenioRDM platform. The blog archive can either archive blog posts with DOIs, or it can issue DOIs for existing blogs not using DOIs. In the latter case it is important that the DOI resolves to the original content in the hosting blog platform, and redirects to the blog platform only when the original blog is no longer available. </p><p>DOIs (e.g. from DataCite or Crossref) have a required set of metadata that makes sense for scholarly blogs. Optional metadata that are desired for the blog archive are license (see above), abstract, subject area (using the 43 <a href=\"https://en.wikipedia.org/wiki/Fields_of_Science_and_Technology\">OECD Fields of Science and Technology</a>), keywords, language, and persistent identifiers for the blog (<a href=\"https://www.issn.org/\">ISSN</a>), author (<a href=\"https://orcid.org/\">ORCID</a>) and affiliated institution (<a href=\"https://ror.org/\">ROR</a>).</p><h3 id=\"rich-site-summary-rss\">Rich Site Summary (RSS)</h3><p><a href=\"https://en.wikipedia.org/wiki/RSS\">RSS</a> is the standard protocol for distributing and consuming blog content. It is actually a group of protocols (Atom and multiple flavors of the RSS format), but they have been around for so long that the popular tools and services support the various protocols. RSS will be the standard way how content is ingested by the blog archive, and probably also how in turn content in the central blog archive is consumed, e.g. as an automated feed of all new science blog posts in a particular subject area and language.</p><figure class=\"kg-card kg-image-card\"><img src=\"https://blog.front-matter.io/content/images/2022/12/images--1-.png\" class=\"kg-image\" alt loading=\"lazy\" width=\"128\" height=\"128\"></figure><p>Because RSS is so widely supported, other ways of registering content – e.g. via web form, API, or webhook – are less critical for the blog archive. Work is needed on the InvenioRDM software to add strong support for RSS feeds, but would allow the automation of a lot of the work needed to build and maintain the blog archive.</p><h3 id=\"markdown-and-pdf\">Markdown and PDF</h3><p><a href=\"https://daringfireball.net/projects/markdown/\">Markdown</a> is a markup language popular with many blogging platforms. It is typically used for editing blog posts and other documents in online environments but is not really used for consuming blog content via RSS. Markdown has<a href=\"https://pandoc.org/\"> been extended</a> to support features needed for scholarly documents, e.g. tables and references, but the uptake of this added functionality in science blogs has been slow. </p><p>PDF is commonly used for reading scholarly publications. The workflows for submitting manuscripts to journals and preprint archives in PDF format are broken because it is tricky to extract structured documents from PDFs. The blog archive will support PDF as an output format at some point but is not a high priority. Blog posts are typically consumed via blog reader or email (if the blog produces a newsletter) rather than as PDF printed out on paper. There is work needed on the InvenioRDM platform to display full-text content rendered as HTML.</p><h3 id=\"curation-and-community\">Curation and Community</h3><p>Science blog posts typically see a lightweight review workflow before publication, and often receive feedback in the form of comments and/or social media mentions. For the Front Matter science blog archive, I want to keep that approach and not build any hurdles for inclusion. Some level of curation is needed, not only to check for quackery and hate speech but also to improve metadata that help with discovery, and to find blogs that should be included. Ideally we can build a community around the science blog archive, taking advantage of the <a href=\"https://inveniordm.web.cern.ch/communities\">communities</a> (focussing on different languages and subject areas) feature recently added to the InvenioRDM software.</p><h3 id=\"flashback\">Flashback?</h3><p>If reading this post feels like it is 2006 – the year <a href=\"https://en.wikipedia.org/wiki/James_Brown\">James Brown</a> (used for the feature image of this post) died – again with talk about blogs, RSS, Markdown, Creative Commons, and related technologies (I for example didn't mention Zotero, XML, or Wordpress), you are right. This is intentional, these technologies are not as sexy as using artificial intelligence or cryptocurrencies to drive this, but I want the Science Blog archive to become a scholarly resource that is useful, open, and inclusive.</p><h3 id=\"references\">References</h3><p>Fenner, M. (2022, September 28). Starting Work on the Front Matter Archive. <em>Front Matter</em>. <a href=\"https://doi.org/10.53731/9z6rz5d-djbay0y\">https://doi.org/10.53731/9z6rz5d-djbay0y</a></p><p>Fenner, M. (2022, December 12). Building an archive for scholarly blog posts. <em>Front Matter</em>. <a href=\"https://doi.org/10.53731/br9f5xa-a556w2t\">https://doi.org/10.53731/br9f5xa-a556w2t</a></p><p>Fenner, M. (2022, December 19). Launching the Front Matter Roadmap. <em>Front Matter</em>. <a href=\"https://doi.org/10.53731/cbdtfp1-1798beh\">https://doi.org/10.53731/cbdtfp1-1798beh</a></p><p>Fenner, M. (2010, October 6). Beyond the PDF – it is time for a workshop. <em>Front Matter</em>. <a href=\"https://doi.org/10.53731/r294649-6f79289-8cw7z\">https://doi.org/10.53731/r294649-6f79289-8cw7z</a></p><p>Fenner, M. (2013, June 19). Citations in Scholarly Markdown. <em>Front Matter</em>. <a href=\"https://doi.org/10.53731/r294649-6f79289-8cw1b\">https://doi.org/10.53731/r294649-6f79289-8cw1b</a></p> "}