{"id":"https://doi.org/10.54900/cyfd6sm-msf52yg","title":"Science Reading: Cognitive narrative helps us understand science better","link":"https://doi.org/10.54900/cyfd6sm-msf52yg","published":"2022-09-13T07:00:10.000+00:00","description":"Take a look at the picture below. What do you see? Think for a moment and write down your observations or say them out loud.Image by Susan Barstow, posted by Holsti97 at...","isPermalink":true,"tags":["Thought Pieces"],"authors":[{"name":"Monica Gonzalez-Marquez","url":null},{"name":"Anouschka Foltz","url":null},{"name":"Jeffrey K. Bye","url":null},{"name":"Ali Fulsher","url":null}],"image":"https://images.unsplash.com/photo-1525715843408-5c6ec44503b1?crop&#x3D;entropy&cs&#x3D;tinysrgb&fit&#x3D;max&fm&#x3D;jpg&ixid&#x3D;MnwxMTc3M3wwfDF8c2VhcmNofDEwfHxyZWFkaW5nfGVufDB8fHx8MTY2MzAwOTE1Nw&ixlib&#x3D;rb-1.2.1&q&#x3D;80&w&#x3D;2000","modified":"2023-01-13T07:39:43.000+00:00","contentHtml":" <!--kg-card-begin: html--><p class='u-drop-cap-large'>Take a look at the picture below. What do you see? Think for a moment and write down your observations or say them out loud.</p><!--kg-card-end: html--><figure class=\"kg-card kg-image-card kg-width-wide kg-card-hascaption\"><img src=\"https://upstream.force11.org/content/images/2022/09/Picture-1.png\" class=\"kg-image\" alt=\"An impression on the snow of an ambiguous nature that is hard to catch. The tracks are of two kinds.\" loading=\"lazy\" width=\"490\" height=\"364\"><figcaption>Image by Susan Barstow, posted by Holsti97 at <a href=\"https://www.summitpost.org/disappearing-rabbit-trick/185785\">https://www.summitpost.org/disappearing-rabbit-trick/185785</a></figcaption></figure><p>Did you see tracks in the snow and the shadow of trees in the background? Maybe you were more specific, noting there are different kinds of tracks going in different directions, and at least two trees casting shadows. Or you may have even thought it looks like a large bird of prey caught a small animal and flew off with it.</p><p>In fact, there are no animals in this picture. There are no tracks. There isn’t even any color. </p><p>All that we <em>actually </em>see are gray-scale pixels on a two-dimensional space. Yet, when asked what we see, many of us begin constructing and describing an event: an animal caught by a bird of prey. We might even include elements of motivation (the bird is hunting for survival) and emotion (feeling sorry for the critter) in our observations. What this means is that we infer from these shades of gray a <em>narrative –</em> characters (the predator and prey) interacting in a place over time (the bird capturing the critter and flying off with it). </p><p>Narrative is key to how we interpret the world.</p><p>We should clarify now that the narrative we are referring to is <em>cognitive narrative</em>. This is narrative as an information-organizing principle in human-type cognition. It is enmeshed in how humans think and interact. When we chat with our friends to catch up, we’re sharing stories about our lives. When we go on a job interview, we’re telling the story of our prior experiences as positively as possible. When we read a newspaper article, we’re reading stories that happened in the world as documented by those who observed them or at least gathered information from others about what happened. When we watch a stranger storm off, then ask our friend what happened, we are engaging in gossip – stories about people that are none of our business but that interest us anyway.</p><p>Stories shape our lives – and they are immensely powerful. Consider what happened with the television series <em>Firefly,</em> a space western imagined by Joss Whedon. When the show was canceled after one season, fans raised money and pressured the studios to complete the story. Think about that for a moment. Strangers the world over organized just to get the ending of a story. </p><p>Stories shape our thoughts, our comprehension of what happens in the world, and they move us to action.</p><p>What does this have to do with science? Science is a human activity dedicated to gathering knowledge and understanding. We record what we learn and how we learned it in papers. Our goal when we read a scientific journal article is what we call ‘<strong>Science Reading’:</strong> the act of conceptually reconstructing a scientific process that researchers, with all of their human biases and limitations, have conducted. We should clarify that we’re not talking about the type of narrative commonly used in science communication, where a science communicator superimposes a story designed for consumption by a general audience. The narrative that interests us here is the one inherent to the representation of a scientific process.</p><p>We narrate from the available documentation such that we can assess the reliability of the scientific process, its products, and the inferences the researchers make. In other words, it means that we, as readers, want to be able to understand what actions were performed and observed, and why, where, when, how, and what it all means. For Science Reading to be effective, the researchers must have created documentation structured for comprehension from these processes for us to be able to answer all these questions. Thus, the documentation must be both physically and conceptually accessible.</p><p>It is not enough to be able to get the information, we must also be able to understand it.</p><h2 id=\"let%E2%80%99s-think-about-how-we-eat-ice-cream\">Let’s think about how we eat ice cream.</h2><p>To understand what we mean, let’s first consider something that most of us are well familiar with: eating ice cream. We’re not referring to the mechanics of eating ice cream (i.e., can you put a spoonful of creamy, icy cold deliciousness in your mouth?). </p><p>The real question is what skills we need to understand how to break down an ice cream eating <em>event</em> in terms of understanding. What entities, actions, behaviors, attitudes, etc., are involved. Those are the skills you need for Science Reading: the skills to break down events to understand how they happen. </p><p>Let’s deconstruct. </p><p>What do we need for an ice cream eating event? A list might look something like this:</p><ol><li>People who want ice cream</li><li>A place to get ice cream</li><li>To order ice cream</li><li>The ability to order ice cream</li><li>Tools to serve and eat the ice cream (scooper, bowl, and spoon)</li><li>Time to eat the ice cream</li><li>To engage in actually eating the ice cream</li><li>People who no longer want to eat ice cream because they've had some (yes, we know. Extremely unlikely, but bear with us.)</li></ol><p>All of these points can be positioned in a narrative arc, framed by time. This arc contains 3 key points. At the beginning is Belief/Physical State A, in the middle something that happens to challenge the status of Belief/Physical State A, and at the end the resulting Belief/Physical State now labeled B. The arc can look something like this:</p><figure class=\"kg-card kg-image-card\"><img src=\"https://upstream.force11.org/content/images/2022/09/Picture-3.png\" class=\"kg-image\" alt loading=\"lazy\" width=\"936\" height=\"462\" srcset=\"https://upstream.force11.org/content/images/size/w600/2022/09/Picture-3.png 600w, https://upstream.force11.org/content/images/2022/09/Picture-3.png 936w\" sizes=\"(min-width: 720px) 720px\"></figure><p>Note that the arc is not quantitative. Being higher up does not indicate a greater quantity of anything, it signifies progression towards the point where a shift becomes possible from A to B. </p><p>More information needed to understand an ice cream eating event than to list its sub-events and place them on a narrative arc. We still don’t know who, or how, or when. Every language has a set of terms it uses specifically to get the details of a narrative. They’re the universal interrogatives, labeled as such because they occur in every single language in some form. In English they are:</p><ol><li>Who</li><li>What</li><li>Where</li><li>When</li><li>Why</li><li>How</li></ol><p>You’ll notice that some answers in our list are actually answers to an interrogative with a preposition (e.g., “tools to serve and eat ice cream” answers the question “with what?”). The interrogation process is about learning to ask the kinds of questions that can get you the whole story. That said, one of the helpful things about positioning your events in an arc is that you can see where there are gaps in your information.</p><p>You’ll notice above that there is nothing between ‘eating ice cream’ and ‘no longer wanting ice cream’. What happened here? </p><p>The universal interrogatives help you obtain the missing information. The more you practice actively working on getting the whole story, the more specific your questions will become (i.e. was the ice cream eaten slowly? Did anyone get second servings?). Where the questions stop depends on your goal for the story you are building in your head. </p><p>In a science paper, your goal is enough comprehension to be able to reproduce the events conceptually. The important thing is to understand that you already have this tool set. Now you need to refine those skills for science.</p><h2 id=\"mapping-to-science-article\">Mapping to science article</h2><p>What happens when we apply the same narrative process, guided by universal interrogatives to a scientific journal article? </p><p>Let’s begin by looking at a short paper: <em><a href=\"https://doi.org/10.1111/j.1467-9280.2005.01640.x\">See the ball, Hit the Ball (Witt & Profitt, 2005)</a></em>. From this paper, we may get a list of events that look like this:</p><ol><li>Made an observation about the subjectivity of ball size estimation</li><li>Did a literature review about size perception</li><li>Produced a hypothesis proposing there is a relationship between skill and size perception</li><li>Designed an experiment to test whether this was the case using softball players</li><li>Designed and produced the materials for the experiment</li><li>Developed a recruitment plan for participants</li><li>Recruited participants softball player</li><li>Ran the experiment</li><li>Prepared data for analysis</li><li>Analysed the data</li><li>Interpreted the data</li><li>Made a decision about what the data said in relation to the hypothesis</li><li>Wrote up the paper</li></ol><p>And positioning into a narrative arc may look like this:</p><figure class=\"kg-card kg-image-card\"><img src=\"https://upstream.force11.org/content/images/2022/09/Picture-5.png\" class=\"kg-image\" alt loading=\"lazy\" width=\"936\" height=\"432\" srcset=\"https://upstream.force11.org/content/images/size/w600/2022/09/Picture-5.png 600w, https://upstream.force11.org/content/images/2022/09/Picture-5.png 936w\" sizes=\"(min-width: 720px) 720px\"></figure><p>But there is still much information missing. </p><p>Enter the universal interrogatives. The first event is ‘made an observation […]’ but who made the observation? When? In what context? The next event is ‘Did a literature review […]’ but who did it, how was it done? How were the sources gathered? Were some already familiar to the authors? What criteria were used to select specifically these papers? </p><p>Many of the answers to these questions will be found in the text. Unfortunately many more won’t. The power of narrative here is that it sheds light on the unknown unknowns. It helps us understand what we did not realize we did not know. This is crucially important to improving the quality of the scientific record.</p><p>A disturbing proportion of peer-reviewed papers do not contain enough information to replicate the studies they describe. The people who reviewed them did not realize that key information was missing or what key information was needed to ensure that the science they contained was replicable. </p><p>The systematicity of this problem is blown wide open in meta-analyses. Again and again researchers attempting meta-analyses find that papers in their current form lack the information needed to appropriately compare them with similar studies. This points to the need for an improved scientific documentation system, based on how humans organize and understand information. We wish to stress that it is no individual author’s or reviewer’s personal fault that our science documentation is unreliable. Only that it is our collective responsibility to fix it.</p><h2 id=\"take-home-message\">Take home message</h2><p>A scientific journal article is  the documentation of a sequence of events aimed at finding an answer to a question – a scientific process. It’s very similar to historical writing in that the events are interpreted from the author’s perspective. However, unlike with historical writing, scientific events are typically recorded by the very people who designed and orchestrated them. This is key to conceptualizing that neither the events, their documentation, nor their interpretation can ever be objective. They are all constrained by the inherent biases involved with being human, the same as with writing histories and the logic behind the adage that ‘History is written by the victors’. This humanity, warts and all, is not a bug in the system, but a feature of being humans who do science. Does this mean that the products of this process cannot be trusted? No. It means they must be understood as products of rational minds in the context of specific arguments in specific contexts. There are no shortcuts. Improving Science Reading (and writing) will require collaboration between science writers, readers, and reviewers</p> "}