{"id":"https://doi.org/10.54900/cyrv6kk-kz45jaf","title":"Bianca Kramer is Keeping Tabs on Open Research","link":"https://doi.org/10.54900/cyrv6kk-kz45jaf","published":"2022-07-19T07:00:47.000+00:00","description":"Bianca Kramer has been scholarly communication/open science librarian at Utrecht University Library for 15 years, and recently moved to  an independent consulting/research analyst role as Sesame Open Science,...","isPermalink":true,"tags":["Open Tabs"],"authors":[{"name":"Bianca Kramer","url":"https://orcid.org/0000-0002-5965-6560"}],"image":"https://images.unsplash.com/photo-1533747122906-9ac6b6709832?crop&#x3D;entropy&cs&#x3D;tinysrgb&fit&#x3D;max&fm&#x3D;jpg&ixid&#x3D;MnwxMTc3M3wwfDF8c2VhcmNofDJ8fHRhYnxlbnwwfHx8fDE2NTgxNTUwODk&ixlib&#x3D;rb-1.2.1&q&#x3D;80&w&#x3D;2000","modified":"2023-01-12T19:23:04.000+00:00","contentHtml":" <!--kg-card-begin: html--><p class='u-drop-cap-large'><em>Bianca Kramer has been scholarly communication/open science librarian at Utrecht University Library for 15 years, and recently moved to  an independent consulting/research analyst role as <a href=\"http://www.sesameopenscience.org/\" target=\"_blank\">Sesame Open Science</a>, with a focus on open science, open metadata and open infrastructure.</em></p><!--kg-card-end: html--><hr><!--kg-card-begin: markdown--><p>Being encouraged to keep “open tabs”, has been an interesting experience - turning something that’s usually guilt-inducing (“I really should be reading this…!”) into something that at least feels productive (“Oh, I could use this for the Upstream blog!”). In the end, did I actually read more because I kept conscious track of all those open tabs? Or less, because I bookmarked the links for this blog and then neglected to read the actual content? I’ll leave that an open question... Either way, below are some of the things that caught my eye over the last month or two.</p>\n<h2 id=\"a-plea-for-polarization-or-why-we-shouldn%E2%80%99t-center-comfort-and-peace-before-justice\"><a href=\"https://doi.org/10.17613/mvjx-hg49\">A Plea for Polarization: Or Why We Shouldn’t Center Comfort and Peace Before Justice</a></h2>\n<p><em>By Dave Ghamandi.</em></p>\n<p>It is a short, annotation-style critique of this (data-walled) <a href=\"https://www.timeshighereducation.com/opinion/open-access-loses-when-publishers-are-vilified\">opinion article</a> of Amy Brand in Times Higer Education (THE) that is worth reading as well. While I don’t necessarily agree with Dave’s entire reading of Amy’s piece, I very much recognize the discomfort around seeking ‘common ground’ in discussions on open access and scholarly publishing, rather than making differences in perspective and interest explicit. It’s why I thought this was a thought-provoking short read.</p>\n<h2 id=\"putting-the-%E2%80%9Csocial%E2%80%9D-back-in-social-enterprise-an-evidence-based-approach\"><a href=\"https://doi.org/10.32920/20171297.v1\">Putting the “Social” Back in Social Enterprise: An Evidence-Based Approach</a></h2>\n<p><em>By Reece Steinberg</em><sup class=\"footnote-ref\"><a href=\"#fn1\" id=\"fnref1\">[1]</a></sup>.</p>\n<p>I was interested in this piece because of the often invoked division (especially in the field of scholarly communication) between commercial companies (bad!) and non-profit organizations (good!). I think this is too simplistic (e.g. with some non-profits operating as de facto commercial organizations) and leaves little room for nuance. The concept of ‘social enterprises’ offers an interesting perspective on how commercial companies could also work for the common good, not just for profit. However, as the article illustrates, not all social enterprises are created (and operated) equal. So, the proposed research-based framework to evaluate social enterprises could be a very useful approach. As an aside, charitable organizations (e.g. funders) are another area where easy distinctions between ‘good’ and ‘bad’ actors fail to address issues of power, accountability and effect - which is why Anand Giridharadas’ <a href=\"https://en.wikipedia.org/wiki/Winners_Take_All:_The_Elite_Charade_of_Changing_the_World\">Winners Take All: The Elite Charade of Changing the World</a> - is also on my reading list.</p>\n<h2 id=\"reinventing-w3c-governance\"><a href=\"https://berjon.com/w3c-governance/\">Reinventing W3C Governance</a></h2>\n<p><em>By Robin Berjon.</em></p>\n<p>A longread on how an organisation as W3C (the main international standards organisation for the world wide web) could or should be governed. It touches on the values and practicalities of being a member-based organisation (where members pay to join, in exchange for which they get some member-only rights) vs. community-driven organisation (where the question of who has voice  is separated from the funding model(s) used). In addition, it also covers the role of values in how an organisation operates, arguing that values should be defined so that they can guide decision-making, especially when dealing with so-called ‘wicked problems’.</p>\n<p>The third interesting point in the article is on infrastructure governance, with thoughts on how to ensure that “infrastructure does get provided (ie. that it is economically viable for various actors to provide it, either in a market setting or through some other means) and that providing infrastructure cannot be leveraged as power over infrastructure users.”. It points to literature on commons as a source of thinking on organizing infrastructure governance, when “defining voluntary standards and letting the market sort things out” is not sufficient.</p>\n<p>All of this resonated with me beyond the specific application to W3C, as these questions have been at the center of many discussions around governance of infrastructure for scholarly communication that I’ve been involved in or have followed over the years.</p>\n<hr>\n<p>So far, my selection of ‘open tabs’ turned out to be all about conceptual discussions on how to organize scholarly communication both effectively and equitable, taking into account the effects of existing power structures. It’s a good reminder to myself to spend the time reading and thinking about these topics.</p>\n<p>I’ll finish off with two short reading recommendations that touch upon two other topics I’m very much interested in: metadata and approaches to research assessment. One of these is on persistent identifiers, and one is a very personal piece reflecting on the recent REF (Research Evaluation Framework) cycle in the UK:</p>\n<h2 id=\"oai-identifiers-decentralised-pids-for-research-outputs-in-repositories\"><a href=\"https://www.slideshare.net/petrknoth/oai-identifiers-decentralised-pids-for-research-outputs-in-repositories\">OAI Identifiers: Decentralised PIDs for Research Outputs in Repositories</a></h2>\n<p>A presentation by Peter Knoth from CORE at the recent Open Repositories 2022 conference, in which he makes an interesting plea for wider use of OAI identifiers, rather than generating DOIs for repository content.</p>\n<h2 id=\"tales-from-ref-central-reflections-from-ref-results-week\"><a href=\"https://www.hepi.ac.uk/2022/05/26/tales-from-ref-central-reflections-from-ref-results-week/\">Tales from REF Central: Reflections from REF results week</a></h2>\n<p>By Elizabeth Gadd. As expected, Lizzie has lots of sensible things to say about how (not) to approach the results of an exercise like the REF. But what stood out to me most was the focus on the free labour and emotional costs involved in this approach to research assessment - the “faces appearing ghost-like in the spreadsheet cells”. Go read it, it’s a powerful piece.</p>\n<hr>\n<p>And totally outside the realm of scholarly communication, I could not finish this blog post without mentioning the one tab I’ve had open most consistently - the pattern for <a href=\"https://www.ravelry.com/patterns/library/sashiko-happy-coat\">this challenging project</a> that I hope to be able to show the result of at some point in future! 🧵</p>\n<p><em>For the next installment of must-read 'open tabs'. I’m tagging Gimena del Rio Grande, who I admire for her work on multilingualism, diversity and representation in scholarly communication. She is, among many other activities, director of the Laboratorio de Humanidades Digitales HD CAICYT LAB (CONICET), a DOAJ Ambassador for Latin America, and one of the initiators of the <a href=\"https://force11.org/groups/open-multilingual-and-global-scholarly-communication-omg/\">Open, Multilingual and Global Scholarly Communication working group</a> of FORCE11.</em></p>\n<p><em>I’m looking forward to hearing what’s on her reading list!</em></p>\n<hr class=\"footnotes-sep\">\n<section class=\"footnotes\">\n<ol class=\"footnotes-list\">\n<li id=\"fn1\" class=\"footnote-item\"><p>This article was originally published in <a href=\"https://nonprofitquarterly.org/\">Nonprofit Quarterly</a>, but was subsequently taken down at the request of one of the parties discussed in the article <a href=\"#fnref1\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n</ol>\n</section>\n<!--kg-card-end: markdown--> "}