{"id":"https://doi.org/10.54900/bj4g7p2-2f0fn9b","title":"The Rogue Scholar: An Archive for Scholarly blogs","link":"https://doi.org/10.54900/bj4g7p2-2f0fn9b","published":"2023-01-31T17:02:40.000+00:00","description":"Digital object identifiers (DOIs) and relevant metadata have been used for 20 years to help preserve the scholarly record by maintaining stable links to scholarly publications and other important scholarly...","isPermalink":true,"tags":["News"],"authors":[{"name":"Martin Fenner","url":"https://orcid.org/0000-0003-1419-2405"}],"image":"https://images.unsplash.com/photo-1528590005476-4f5a6f2bdd9e?crop&#x3D;entropy&cs&#x3D;tinysrgb&fit&#x3D;max&fm&#x3D;jpg&ixid&#x3D;MnwxMTc3M3wwfDF8c2VhcmNofDV8fHJlY29yZHxlbnwwfHx8fDE2NzUxNzg3Mjk&ixlib&#x3D;rb-4.0.3&q&#x3D;80&w&#x3D;2000","modified":"2023-01-31T17:02:40.000+00:00","contentHtml":" <p>Digital object identifiers (DOIs) and relevant metadata have been used for 20 years to help preserve the scholarly record by maintaining stable links to scholarly publications and other important scholarly resources, combined with long-term archiving by publishers and libraries. Lots and tools and services have been built around this infrastructure to make it easier for scholars to consume and contribute to this scholarly record.</p><p>Science Blogs have also been around for more than 20 years, but in all that time have not really become a formal part of the scholarly record. If you are old enough to remember them, you can think of science blogs as the compact cassette next to the single or LP – giving users an affordable alternative to buying a record, enabling listening to music on the go, and enabling creative remixing of content in that quintessential product of the 1980s and 1990s, the mixtape.</p><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img src=\"https://images.unsplash.com/photo-1654829725133-3d694a1675ca?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=MnwxMTc3M3wwfDF8c2VhcmNofDd8fG1peHRhcGV8ZW58MHx8fHwxNjc1MTc5NTAx&ixlib=rb-4.0.3&q=80&w=2000\" class=\"kg-image\" alt loading=\"lazy\" width=\"6000\" height=\"4000\" srcset=\"https://images.unsplash.com/photo-1654829725133-3d694a1675ca?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=MnwxMTc3M3wwfDF8c2VhcmNofDd8fG1peHRhcGV8ZW58MHx8fHwxNjc1MTc5NTAx&ixlib=rb-4.0.3&q=80&w=600 600w, https://images.unsplash.com/photo-1654829725133-3d694a1675ca?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=MnwxMTc3M3wwfDF8c2VhcmNofDd8fG1peHRhcGV8ZW58MHx8fHwxNjc1MTc5NTAx&ixlib=rb-4.0.3&q=80&w=1000 1000w, https://images.unsplash.com/photo-1654829725133-3d694a1675ca?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=MnwxMTc3M3wwfDF8c2VhcmNofDd8fG1peHRhcGV8ZW58MHx8fHwxNjc1MTc5NTAx&ixlib=rb-4.0.3&q=80&w=1600 1600w, https://images.unsplash.com/photo-1654829725133-3d694a1675ca?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=MnwxMTc3M3wwfDF8c2VhcmNofDd8fG1peHRhcGV8ZW58MHx8fHwxNjc1MTc5NTAx&ixlib=rb-4.0.3&q=80&w=2400 2400w\" sizes=\"(min-width: 720px) 720px\"><figcaption>Photo by <a href=\"https://unsplash.com/@bdilla810?utm_source=ghost&utm_medium=referral&utm_campaign=api-credit\">Bruno Guerrero</a> / <a href=\"https://unsplash.com/?utm_source=ghost&utm_medium=referral&utm_campaign=api-credit\">Unsplash</a></figcaption></figure><p>The strengths of science blogs are that they are easy and affordable to set up, allow experimentation in content and format (e.g. as a podcast), and are very fast in publishing content to your audience.</p><p>Science blog very nicely complement other emerging Open Science content types such as research data, software, computational notebooks, and preprints. They can highlight interesting research or important policy developments, help report from conferences, and can also work to publish primary research.</p><h3 id=\"is-there-a-way-to-combine-the-strengths-of-science-blogs-with-the-more-traditional-ways-of-publishing-science-what-if-we-add-what-is-missing-but-keep-what-works-well\">Is there a way to combine the strengths of science blogs with the more traditional ways of publishing science? What if we add what is missing but keep what works well?</h3><p>This is what I have started doing a few months ago starting work on <a href=\"https://rogue-scholar.org\">the Rogue Scholar,</a> an archive for science blogs that</p><ul><li>provides a long-term archive for science blog posts,</li><li>makes the full-text of blog posts searchable in a central search index,</li><li>assigns DOIs and metadata to these blog posts that are propagated to other infrastructure, and</li><li>make the content is free to submit and read (with <a href=\"https://rogue-scholar.org/#pricing\">caveats</a>).</li></ul><p>The Rogue Scholar will use the Open Source repository software <a href=\"https://inveniosoftware.org/products/rdm/\">InvenioRDM</a> (where I am contributing to the development) to achieve this, and will launch in the second quarter of 2023. Reach out to me via the Rogue Scholar website or email if you have questions or comments. </p><p>From the initial feedback and research I noticed particular interest from personal science blogs and from English-language blogs and unsurprisingly found that Wordpress is the most popular platform for science blogs. I also found a small number of science blogs (including the Upstream blog) that use DOIs, and a number of science blogging platforms such as <a href=\"https://hypotheses.org/\">Hypotheses</a>, <a href=\"https://occamstypewriter.org/\">Occam's Typewriter</a> and <a href=\"https://scilogs.spektrum.de/\">Scilogs.de</a>. And lots and lots of interesting content that deserves to be made easier to discover and preserved.</p> "}