{"id":"https://doi.org/10.54900/ebw4ce4-47p2tbr","title":"Setting the Scene: How Artificial Intelligence is reshaping how we consume and deliver research","link":"https://doi.org/10.54900/ebw4ce4-47p2tbr","published":"2023-01-24T13:18:29.000+00:00","description":"Since its release towards the end of 2022, ChatGPT has been dominating the majority of AI-related conversations on social media. One could almost say it has made AI more mainstream and accessible than ever....","isPermalink":true,"tags":["Thought Pieces"],"authors":[{"name":"Saikiran Chandha","url":null},{"name":"Sucheth R","url":null},{"name":"Tirthankar Ghosal","url":null}],"image":"https://upstream.force11.org/content/images/2023/01/Untitled-4.png","modified":"2023-01-30T08:33:28.000+00:00","contentHtml":" <p>Since its release towards the end of 2022, <a href=\"https://openai.com/blog/chatgpt/\">ChatGPT</a> has been dominating the majority of AI-related <a href=\"https://au.news.yahoo.com/the-mind-blowing-trend-taking-over-the-internet-what-is-chat-gpt-071241981.html\">conversations on social media</a>. One could almost say it has made AI more mainstream and accessible than ever. AI is quickly revolutionizing the modern-day research landscape. According to a CSIRO report, nearly <a href=\"https://www.csiro.au/en/news/news-releases/2022/landmark-report-analyses-the-impact-of-ai-on-science\">98%</a> of scientific fields use AI in some way. The possibilities are endless, with these state-of-the-art AI technologies becoming more and more accessible.</p><p>AI tools are gradually making inroads into the research ecosystem. From breaking down research papers to make them more comprehensible and auto-completing academic essays to accurately predicting 3D models of protein structures, AI is streamlining multiple aspects of scholarly pursuit. In short, it can dramatically reduce the time researchers invest in routine tasks, giving them more time to think, focus on data and analysis, synthesize their thoughts, and make inferences<em>.</em></p><p><em>This blog post is part of a series on how AI is reshaping the research landscape. In the first part, we will set the scene by examining the different ways AI applications are currently used in consuming and delivering research.</em></p><h2 id=\"1-knowledge-discovery-getting-through-papers-faster\"><strong>1. Knowledge discovery: Getting through papers faster</strong></h2><figure class=\"kg-card kg-image-card\"><img src=\"https://upstream.force11.org/content/images/2023/01/Untitled.png\" class=\"kg-image\" alt loading=\"lazy\" width=\"1024\" height=\"1024\" srcset=\"https://upstream.force11.org/content/images/size/w600/2023/01/Untitled.png 600w, https://upstream.force11.org/content/images/size/w1000/2023/01/Untitled.png 1000w, https://upstream.force11.org/content/images/2023/01/Untitled.png 1024w\" sizes=\"(min-width: 720px) 720px\"></figure><p>Gathering valuable insights from the sea of scientific manuscripts can be a daunting task. Given the sheer number of papers published each year — with close to <a href=\"https://www.stm-assoc.org/2018_10_04_STM_Report_2018.pdf\">2.4 million</a> annually — finding relevant papers and distilling critical insights from them is almost like finding a needle in a haystack.</p><p>It's a challenging feat for any researcher as there will always be unfamiliar terms, concepts, theories, and equations to cross-reference to understand the paper thoroughly. Plus, there may be questions that one would have to look up separately while making the connections between concepts. The difficulty further increases if you are a non-English speaker since <a href=\"https://www.jbe-platform.com/content/journals/10.1075/aila.20.06ham\">three-quarters</a> of science and humanities papers are written in English.</p><p>Fortunately, we now have AI-powered research reading tools that can help us navigate the vast array of papers and make sense of their content. <a href=\"https://typeset.io/\">SciSpace Copilot</a> is one such tool. It helps to read and understand articles better by providing explanations for scientific texts and math, including follow-up questions for more detailed answers in multiple languages. <a href=\"https://elicit.org/\">Elicit</a> allows researchers to access relevant papers with summarized takeaways. <a href=\"https://www.system.com/graph\">System</a> is an open data resource that combines peer-reviewed articles, datasets, and models to help you understand the relationship between any two things in the world.</p><p>The <a href=\"https://theresanaiforthat.com/\">list</a> is growing, with more coming up every day. These tools aim to help researchers and science practitioners extract critical information and required context from research papers faster.</p><h2 id=\"2-communication-enhancement-articulating-yourself-better\"><strong>2. Communication enhancement: Articulating yourself better</strong></h2><figure class=\"kg-card kg-image-card\"><img src=\"https://lh4.googleusercontent.com/RSc-e1rz2-LQTKumGP18084nTf-boFpdJz8t3M5G1rNOXKQlXSMBF42aKthmpJkyc2oltyjVYAgNxqI2PofcfIWCtMyT-6WPFfiBUQGZhZxWzD1PiraTwfXywG3_UR2hU6CVQfx02luSHIFQn2lQ1nlcBeZo226Ci9LLqLt164h5tj1jNAWM4OjBevmrZQ\" class=\"kg-image\" alt loading=\"lazy\" width=\"349\" height=\"349\"></figure><p>Writing grant applications can take up a substantial amount of time, even for the most accomplished researchers. Some report that up to <a href=\"https://acquisitiontalk.com/2021/12/top-researchers-spend-50-of-their-time-writing-grants-how-to-fix-it-and-what-it-means-for-dod/\">50%</a> of their time is dedicated to this process. On top of this, you have papers, emails, conference presentations, and even social media posts to write to disseminate your findings and make your research visible. While this is an important activity for advancing research, it is eating into the time you would spend refining your research and honing your analysis.</p><p>Generative AI model-based writing tools are tackling this challenge. <a href=\"https://www.scientificamerican.com/article/we-asked-gpt-3-to-write-an-academic-paper-about-itself-mdash-then-we-tried-to-get-it-published/\">A researcher used GPT-3, a large language model, to write an academic paper</a> — complete with references. While it is probably not a good idea to use AI to write the whole piece, one can use it to bootstrap, explore different angles, and improve the content's tone, structure, and flow.</p><p><a href=\"https://lex.page/\">Lex</a> is a word processor like Google Docs but interactive and AI-powered. <a href=\"https://x.writefull.com/\">Writefull X</a> is an AI-powered writing application tailored to academia. Both help lighten the load, allowing you to focus on sharing your research findings rather than stressing about the actual writing.</p><h2 id=\"3-data-analysis-acceleration-making-sense-of-data-faster\"><strong>3. Data analysis acceleration: Making sense of data faster</strong></h2><figure class=\"kg-card kg-image-card\"><img src=\"https://lh3.googleusercontent.com/Vw2tpmn9OBLaBfrbRNjSgxMVwN_UX3c2t06Yxu58dSkVGU6NZ0oZmBJA-dqPHUeaoDD-9E4Z65IX2lgoSFpu-oqWL5gJVf4U_pQHTDaIgq9WLIe2AGRHh8psQN_eiRj7OL9XMinC9-lXDyku1QXZA53jcf0qKAsfcDkWDqy0H2iWYmu10vVijeKY-2tiyg\" class=\"kg-image\" alt loading=\"lazy\" width=\"349\" height=\"349\"></figure><p>You can only analyze data when it is cleaned and organized. It means spending hours manually sorting and categorizing your data, which can be tedious, especially when dealing with large volumes of unprocessed data. On top of that, you might have to learn to use spreadsheet software and databases and, in some cases, coding languages like Python or R.</p><p>Thankfully, advancements in AI have made it possible to make sense of data faster and with less human effort. A wide range of AI tools that are currently available could help you each step of the way, from data extraction to data visualization and even predictive analysis.</p><p>Starting with AI-based <a href=\"https://excelformulabot.com/\">spreadsheet bots</a> that turn your instructions in natural language into a spreadsheet formula. So, suppose you want to find out the total number of survey respondents who answered 'yes' to a question in the age bracket 16-25. In that case, you could type the same (with column numbers), and the spreadsheet bot will create the formula to give you the answer you need. If you want to visualize the data, you have platforms like <a href=\"https://www.olli.ai/\">Olli</a> that help you create line charts, bar graphs, and scatter plots by simply describing what you want.</p><p>It doesn't end there. <a href=\"https://openai.com/blog/openai-codex/\">OpenAI Codex</a> is an AI model that translates natural language into code. This has been used to build <a href=\"https://github.com/features/copilot\">GitHub's AI coding assistant</a>, which gives you code suggestions in real-time, right from your editor. An MIT-based <a href=\"https://www.pnas.org/doi/epdf/10.1073/pnas.2123433119\">study</a> revealed that you could use this model to solve university-level math problems consistently.</p><p>There are also AI-driven data analysis tools out there, like <a href=\"https://www.uselookup.com/\">Lookup</a>. You can upload the data, ask questions in plain English, and get answers quickly without learning complicated query languages or figuring out how various tables connect.</p><h2 id=\"4-publishing-efficiency-expediting-the-workflow\"><strong>4. Publishing efficiency: Expediting the workflow</strong></h2><figure class=\"kg-card kg-image-card\"><img src=\"https://lh5.googleusercontent.com/P8IgWv_QqiWansmI1Ad_h0E9vt0OGfa7xZ7bVO0M261hlQJoVRmw5YNoCVztFNv7E3UXFy1kVE4EAfWbdSgatu2xm93-AwuB1w7KZcLJ0Bm9GGuULm0GM2FRkCxbWedT6xByos8lhfsaP6RJhp_Qp6Sm_wRzhhQEzxU2nKS5IDgfsMDQ0_umvYJr1z9IuQ\" class=\"kg-image\" alt loading=\"lazy\" width=\"392\" height=\"392\"></figure><p>Getting a scholarly manuscript published is, again, a tedious process, with formatting, editing, proofreading, and the all-important peer-review cycle. On the one hand, you have authors spending <a href=\"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0223116\">52 hours</a> a year on average on formatting. On the other, journals reject around <a href=\"https://publons.com/static/Publons-Global-State-Of-Peer-Review-2018.pdf\">75%</a> of manuscript submissions before they even reach the peer review stage. These numbers indicate that there is room for improvement in the publishing workflow.<br><br>Integrating AI tools by both authors and publishers can streamline this process. On the author's side, AI-based solutions like <a href=\"https://www.grammarly.com/\">Grammarly</a>, Lex, <a href=\"https://www.turnitin.com/\">Turnitin</a>, and Writefull automate formatting, referencing, plagiarism checking, and grammar checks.</p><p>Journal publishers are also turning to AI to streamline the review process. For instance, American Association for Cancer Research (AACR) uses Proofig to <a href=\"https://www.nature.com/articles/d41586-021-03807-6\">verify the authenticity of images</a> in submissions sent to their journals. <a href=\"https://insights.uksg.org/articles/10.1629/uksg.460/\">Springer Nature adopted UNSILO</a>, an AI-based platform, to identify links across eleven million published journal articles, enabling them to find related articles quickly. <a href=\"https://www.penelope.ai/\">Penelope.ai</a> is another AI-based tool that helps ensure that manuscripts meet a journal's requirements by quickly analyzing references and structure. AI is also being used for <a href=\"http://blogs.biomedcentral.com/bmcblog/2016/05/23/peerless-review-automating-methodological-statistical-review/\">fact-checking</a>. The potential for AI to optimize the journal publishing process is immense.</p><h2 id=\"final-thoughts\"><strong>Final thoughts</strong></h2><p>AI models hold tremendous potential for the scientific research community. At the same time, there are serious concerns about employing such technology, ranging from plagiarism and ethical issues to the potential for <a href=\"https://www.vox.com/future-perfect/22672414/ai-artificial-intelligence-gpt-3-bias-muslim\">replicating human biases</a>, <a href=\"https://www.grid.news/story/science/2022/12/09/artificially-unintelligent-an-ai-search-engine-for-science-spits-out-climate-denialism-and-covid-misinformation/\">spreading false information</a>, and <a href=\"https://www.nature.com/articles/d41586-021-02134-0\">ethics violations</a>. Research teams and other stakeholders must join forces to guarantee that Artificial Intelligence-driven research systems are responsibly constructed and used.</p><p>AI is still evolving, and expecting it to always produce reliable results is unrealistic. After all, it's only been around five years since the release of <a href=\"https://typeset.io/papers/attention-is-all-you-need-1hodz0wcqb\">Attention is all you need</a>, a groundbreaking paper that introduced Transformer — an NLP model considered the foundation of many of today's AI models. Fortunately, the early signs of progress are encouraging, and continued developments are anticipated. We could expect better generation capability and factual consistency from the Large Language Models in the near future.</p><p>Even so, AI can still create inaccurate output. So, when employing AI in your workflow, ensure to double-check all outcomes before relying on them.</p><p><em>In the next edition of this series, we will look at how AI is helping researchers overcome language barriers. Stay tuned! Thanks for your time in reading this post. Please feel free to contact us at saikiran@scispace.com, for any questions or thoughts. All the images in this post are created with Text2Image AI tool DALL·E 2</em></p> "}