{"id":"https://doi.org/10.54900/acr1sw6-6pczdnf","title":"Gimena del Rio Riande is Keeping Tabs on Open Research","link":"https://doi.org/10.54900/acr1sw6-6pczdnf","published":"2022-09-06T07:00:15.000+00:00","description":"Gimena del Rio Riande is Associate Researcher at the Instituto de Investigaciones Bibliográficas y Crítica Textual (IIBICRIT-CONICET, Argentina) (https://orcid.org/0000-0002-8997-5415). Her main academic...","isPermalink":true,"tags":["Open Tabs"],"authors":[{"name":"Gimena del Rio","url":"https://orcid.org/0000-0002-8997-5415"}],"image":"https://images.unsplash.com/photo-1591492654773-6756035bef6b?crop&#x3D;entropy&cs&#x3D;tinysrgb&fit&#x3D;max&fm&#x3D;jpg&ixid&#x3D;MnwxMTc3M3wwfDF8c2VhcmNofDIwfHxzdGFjayUyMG9mJTIwYm9va3N8ZW58MHx8fHwxNjYxMTYyNjA1&ixlib&#x3D;rb-1.2.1&q&#x3D;80&w&#x3D;2000","modified":"2023-01-12T19:18:55.000+00:00","contentHtml":" <!--kg-card-begin: html--><p class='u-drop-cap-large'><em>Gimena del Rio Riande is Associate Researcher at the Instituto de Investigaciones Bibliográficas y Crítica Textual (IIBICRIT-CONICET, Argentina) (<a href=\"https://orcid.org/0000-0002-8997-5415\">https://orcid.org/0000-0002-8997-5415</a>). Her main academic interests deal with digital humanities, digital scholarly edition and publishing, and Open Research Practices in the Humanities. She is actively involved in many <a href=\"https://hdlab.space/\">digital humanities initiatives</a> and takes part of communities like the <a href=\"https://doaj.org/\">DOAJ</a> and the <a href=\"https://tei-c.org/\">TEI Consortium</a>.</em></p><!--kg-card-end: html--><hr><p>\"<a href=\"https://en.wikipedia.org/wiki/The_Library_of_Babel\">The Library of Babel</a>\" is a short story by the Argentine writer Jorge Luis Borges in which the universe is conceived in the form of a vast and infinite library. This library contains all useful information, including predictions of the future, biographies, and translations of every book in all <a href=\"https://en.wikipedia.org/wiki/Language\">languages</a>.</p><p>I must confess I am a Borges-fan, a <a href=\"https://www.bustle.com/articles/166488-13-types-of-readers-everyone-knows-because-we-arent-all-alike\">polygamist reader</a>, and also a tab-saver person. Consequently, I have always loved this idea of a comprehensive library in which I could find and read in many languages all that is published about digital humanities, digital edition, open science or scholarly communication, with a special focus in Latin America.</p><p>In any case, my invitation to write the latest installment of Open Tabs came from a scholar that I very much admire, Bianca Kramer, and it feels like  a great opportunity to share with you some of my multilingual Babel tabs.</p><h3 id=\"tendencias-recientes-en-las-pol%C3%ADticas-cient%C3%ADficas-de-ciencia-abierta-y-acceso-abierto-en-iberoam%C3%A9rica-by-dominique-babini-and-laura-rovelli\"><a href=\"https://www.memoria.fahce.unlp.edu.ar/libros/pm.5293/pm.5293.pdf\">Tendencias recientes en las políticas científicas de ciencia abierta y acceso abierto en Iberoamérica</a> by Dominique Babini and Laura Rovelli</h3><p>Let 's start with the big picture. In 2020, Dominique Babini and Laura Rovelli published a book that, in my opinion, contains the basics needed to understand Open Science in Spanish-speaking countries: <a href=\"https://www.memoria.fahce.unlp.edu.ar/libros/pm.5293/pm.5293.pdf\">Tendencias recientes en las políticas científicas de ciencia abierta y acceso abierto en Iberoamérica</a>.  Many of the chapters of this book discuss other influential texts that had been previously published on topics and issues related to Open Science in the region. </p><h3 id=\"publishing-from-the-periphery-structural-heterogeneity-and-segmented-circuits-the-evaluation-of-scientific-publications-for-tenure-in-argentina%E2%80%99s-conicet-by-fernanda-beigel\"><a href=\"https://doi.org/10.1177/0011392114533977\">Publishing from the periphery: Structural heterogeneity and segmented circuits. The evaluation of scientific publications for tenure in Argentina’s CONICET</a> by Fernanda Beigel</h3><p>Just to mention one, I strongly recommend Fernanda Beigel’s “<a href=\"https://doi.org/10.1177/0011392114533977\">Publishing from the periphery</a>”, an article published in English in 2014 in which the sociologist delves into  her publishing circuits theory and explains why much of  Latin American Science runs through transnational or regional networks, and why Latin American Science is rarely part of mainstream circuits. </p><h3 id=\"patrones-de-publicaci%C3%B3n-en-ciencias-sociales-y-humanidades-en-argentina-multiling%C3%BCismo-regionalizaci%C3%B3n-y-evaluaci%C3%B3n-acad%C3%A9mica-by-federico-vassen\"><a href=\"https://doi.org/10.1590/SciELOPreprints.3763\">Patrones de publicación en ciencias sociales y humanidades en Argentina: multilingüismo, regionalización y evaluación académica</a> by Federico Vassen<br></h3><p>This distinctive approach to the local-global issues in the publishing system has also been reviewed by Federico Vassen in a recent article in which he observes a strong recent trend in the Latin American social sciences towards regionalization: “<a href=\"https://doi.org/10.1590/SciELOPreprints.3763\">Patrones de publicación en ciencias sociales y humanidades en Argentina: multilingüismo, regionalización y evaluación académica</a>” (“Publication patterns in the Argentinian social sciences and humanities: multilingualism, regionalization, and academic evaluation”.</p><h3 id=\"innovation-without-growth-frameworks-for-understanding-technological-change-in-a-postgrowth-era-by-mario-pansera-and-mariano-fressoli\"><a href=\"http://doi.org/10.1177/1350508420973631\">Innovation without growth: Frameworks for understanding technological change in a postgrowth era</a> by Mario Pansera and Mariano Fressoli<br></h3><p>In my personal opinion, and moving a little bit the needle, all the complicated patterns that arise in these localized studies should be read in conjunction with literature related to the global grassroots movement and/or citizen science. In this sense, I found “<a href=\"http://doi.org/10.1177/1350508420973631\">Innovation without growth: Frameworks for understanding technological change in a postgrowth era</a>”, by Mario Pansera and Mariano Fressoli, to be an incredibly rich work. In this article published in 2020, the authors show how alternative bottom up initiatives, promoted by a variety of different organizational forms, have challenged mainstream ideas about innovation and growth. This leaves, at least for me, the door open to new possible futures for Open Science in Latin America that includes participation of the public and the transformation to open scholarly-driven publishing systems.</p><h3 id=\"les-makerspaces-en-afrique-francophone-entre-d%C3%A9veloppement-local-durable-et-technocolonialit%C3%A9-by-thomas-herv%C3%A8-mboa-nkoudou\"><a href=\"https://corpus.ulaval.ca/jspui/handle/20.500.11794/67577\">Les makerspaces en Afrique francophone, entre développement local durable et technocolonialité</a> by Thomas Hervè Mboa Nkoudou<br></h3><p>Also, related to this topic, I would suggest reading Thomas Hervè Mboa Nkoudou’s doctoral thesis (2020) “<a href=\"https://corpus.ulaval.ca/jspui/handle/20.500.11794/67577\">Les makerspaces en Afrique francophone, entre développement local durable et technocolonialité: trois études de cas au Burkina Faso, au Cameroun et au Sénégal</a>” is since 2020 a must-read for any scholar interested in open research practices and citizen science.</p><h3 id=\"minimal-computing-digital-humanities-quarterly-edited-by-alex-gil-and-roopika-risam\"><a href=\"http://www.digitalhumanities.org/dhq/vol/16/2/index.html\">Minimal Computing. Digital Humanities Quarterly</a> edited by Alex Gil and Roopika Risam</h3><p>Finally, I would like to close my tabs with a volume that, from a digital humanist perspective, brings together Open Science, the humanities and equity in access to knowledge and technology <a href=\"http://www.digitalhumanities.org/dhq/vol/16/2/index.html\">The Digital Humanities Quarterly’s latest special issue</a> dedicated to minimal computing, curated and edited by Alex Gil and Roopika Risam. I had the honor of taking part in this special issue I haven’t finished reading yet, though, as I quote Gil and Risam, I can clearly see that their observations work not only for the digital humanities but also for Latin American and global open science: “minimal computing as a space wherein we can explore forms of computation that do not depend on expensive infrastructures and the harmful practices of the centers of capital accumulation in the 21st century”. </p><p>Oh, and one last tab recommendation, for the best Open/Abierto Twitter experience, follow my DOAJ Latin American co-ambassador Ivonne Lujano at <a href=\"https://twitter.com/ivonnelujano\">https://twitter.com/ivonnelujano</a>. </p><hr><p><em>For the next installment of must-read 'open tabs'. I’m tagging Thomas Hervé Mboa Nkoudou, who I admire for his work on technocoloniality of power and cognitive justice. He is, among many other activities, a researcher in Information and Communication, with interest in the Maker Movement in French Speaking African countries. Thomas Mboa is deeply engaged to promote DIYbio and democratize Biotechnology in Africa. His work with DIYBio is visible through his own biohackerspace in Cameroon: the Mboalab, which is part of the Bioeconomy Lab. Thomas also operates through the Africa Open Science & Hardware network which he co-leads, which aims to strengthen African stakeholders and catalyse grassroots innovation through Open Tech culture. Thomas is in charge of the African Institute of Open Science and Hardware launched by the AfricaOSH community.</em><br><br><br></p> "}