{"id":"https://doi.org/10.54900/btrdtvc-cjjn94g","title":"Scholarly Infrastructure: a Latin American perspective","link":"https://doi.org/10.54900/btrdtvc-cjjn94g","published":"2023-02-07T16:08:41.000+00:00","description":"Infrastructure: what’s at stakeInfrastructure often is perceived as a “given”, as something that was always there, as “natural”. In the digital age, infrastructure seems more “natural” than ever (it's hard to...","isPermalink":true,"tags":["Thought Pieces"],"authors":[{"name":"Carolina Tanigushi","url":null},{"name":"Gabi Mejias","url":"https://orcid.org/0000-0002-1598-7181"}],"image":"https://images.unsplash.com/photo-1563126171-fa019bbbfa18?crop&#x3D;entropy&cs&#x3D;tinysrgb&fit&#x3D;max&fm&#x3D;jpg&ixid&#x3D;MnwxMTc3M3wwfDF8c2VhcmNofDF8fHNvdXRoJTIwYW1lcmljYXxlbnwwfHx8fDE2NzU3ODY2MjM&ixlib&#x3D;rb-4.0.3&q&#x3D;80&w&#x3D;2000","modified":"2023-02-27T08:34:34.000+00:00","contentHtml":" <h3 id=\"infrastructure-what%E2%80%99s-at-stake\">Infrastructure: what’s at stake<br></h3><p>Infrastructure often is perceived as a “given”, as something that was always there, as “natural”. In the digital age, infrastructure seems more “natural” than ever (it's hard to imagine there was a time without internet connectivity in our mobile phones or even a time when phone lines were a luxury item) and the social and economic dimension of infrastructure tend to be invisibilized and are left out of discussion. </p><p>Another challenge around infrastructure is that if well functioning  it tends to be forgotten, despite the big amount of resources and commitment invested on its maintenance. Academic knowledge production infrastructure gathers very low interest in the public debate (<a href=\"https://qz.com/2116375/covid-has-deepened-the-wests-monopoly-of-science-publishing\">except during times of crisis!</a>) even if it serves society as a whole. It is this invisibilization that puts infrastructure permanently at risk, especially under the neoliberalist paradigm.</p><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img src=\"https://upstream.force11.org/content/images/2023/02/Cuesta_de_Lipa-n-_RN52-_Jujuy-_Argentina_-_panoramio-1.jpeg\" class=\"kg-image\" alt loading=\"lazy\" width=\"640\" height=\"480\" srcset=\"https://upstream.force11.org/content/images/size/w600/2023/02/Cuesta_de_Lipa-n-_RN52-_Jujuy-_Argentina_-_panoramio-1.jpeg 600w, https://upstream.force11.org/content/images/2023/02/Cuesta_de_Lipa-n-_RN52-_Jujuy-_Argentina_-_panoramio-1.jpeg 640w\"><figcaption>Credit:<a href=\"https://web.archive.org/web/20161111160258/http://www.panoramio.com/user/5148983?with_photo_id=48047173\"> rodoluca</a>, WikimediaCommons. <a href=\"https://commons.wikimedia.org/wiki/File:Cuesta_de_Lip%C3%A1n,_RN52,_Jujuy,_Argentina_-_panoramio.jpg\">This file</a> is published under the <a href=\"https://en.wikipedia.org/wiki/en:Creative_Commons\">Creative_Commons</a><a href=\"https://creativecommons.org/licenses/by-sa/3.0/deed.en\">Attribution-Share Alike 3.0 Unported</a> license.</figcaption></figure><p>In scholarly communications, knowledge dissemination and infrastructure are complexly intertwined. Over the last 40 years, large commercial publishers have increased their control of the scientific output (<a href=\"https://doi.org/10.1371/journal.pone.0127502\">according to a study</a> by Vincent Larivière, Stefanie Haustein and Philippe Mongeon ten years ago the five most prolific commercial publishers accounted for more than 50% of all papers published) and this trend has been intensified by the digitization of research.<br></p><p>In the last decade, the biggest commercial publishers have been acquiring infrastructure services by implementing economic convergence  through horizontal  <a href=\"https://publishingperspectives.com/2021/01/exclusive-wiley-hindawi-acquisition-jay-flynn-interview-covid19/\">(when a company acquires competitor companies)</a>  or vertical integration (<a href=\"https://librarytechnology.org/mergers/elsevier/\">when a company acquires vendors, suppliers or other related companies within the same industry/sector</a>) strategies. This behavior has both economic and political consequences.  <br></p><p>These commercial publishers have moved from publishing to also owning vendor systems such as submission and journal management systems, repositories, current research information systems (CRIS), faculty information systems (FIS), funders systems, and beyond in a move that can be called “appetite for acquisition”. This has several effects and poses many concerns across the research life cycle: increasing dependence by researchers and institutions, lack of competition from smaller organizations offering services, resulting in loss of community involvement and control across knowledge production and its communication. </p><p><a href=\"http://knowledgegap.org/index.php/sub-projects/rent-seeking-and-financialization-of-the-academic-publishing-industry/preliminary-findings/\">Alejandro Posada and George Chen have studied and analyzed how Elsevier’s augmented influence on infrastructure leads to an increase of inequality in knowledge production on a global scale</a>, and that “this is particularly challenging for researchers in the global south whose methodology and epistemological approach does not align with mainstream models of research production and evaluation”. </p><p>With the digitization of scholarship and the rise of the open research movement, new models and outputs of science communication have emerged  beyond the journal article. Scholarly communications is shifting towards the “record of versions”, rather than just a One True “version of record”, where persistent identifiers and their metadata enable recognition, linking and discoverability of a wide range of outputs regardless of where those are housed. It is worth noting the importance of infrastructure in connecting all outputs and resources throughout the research lifecycle (such as research data, software, samples, etc.) to better understand and evaluate the contributions to research, and support their recognition. Many of the organizations providing this kind of foundational infrastructure have been established as non profit community governed and sustained initiatives (Crossref, DataCite, ROR), and are committed to the <a href=\"https://openscholarlyinfrastructure.org/\">Principles of Open Scholarly Infrastructure.</a></p><h3 id=\"the-latin-american-perspective\">The Latin American perspective<br></h3><p>Over the past few years, the open science movement has emerged with such strength that it’s pushing publishers to change their strategies and business models, the decline from the subscription based model and the transition from the pay to publish model (vs the former “pay to read” model) being some of the most notorious examples. While many have received initiatives like<a href=\"https://www.leru.org/news/plans-positive-action-combined-with-positive-thinking-delivers-success\"> Plan S as a positive action to accelerate the transition to open access</a>, beyond the Global North <a href=\"https://blogs.lse.ac.uk/impactofsocialsciences/2019/08/08/amelica-before-plan-s-the-latin-american-initiative-to-develop-a-cooperative-non-commercial-academic-led-system-of-scholarly-communication/\">some voices have emerged to question these measures as progress</a>.</p><p>Do article processing charges (APCs) and transformative agreements promote openness or strengthen the current status quo? Many then have turned “South” and started looking at “alternative” models that aren’t dependent on commercial publishers and for-profit service providers.</p><figure class=\"kg-card kg-embed-card kg-card-hascaption\"><blockquote class=\"twitter-tweet\"><p lang=\"es\" dir=\"ltr\">ESTE DÍA QUEDARÁ EN LA HISTORIA DEL FÚTBOL MUNDIAL. 🇦🇷❤️<a href=\"https://t.co/CrwtkaUOVh\">pic.twitter.com/CrwtkaUOVh</a></p>&mdash; Ataque Futbolero (@AtaqueFutbolero) <a href=\"https://twitter.com/AtaqueFutbolero/status/1605247147229716483?ref_src=twsrc%5Etfw\">December 20, 2022</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<figcaption>The importance of infrastructure, graphical description</figcaption></figure><p>Opposite to what happens in the Global North, in Latin America open access is not an “alternative” model but has long been mainstream. <a href=\"https://en.wikiversity.org/wiki/Open_Access_in_Latin_America\">We have a long-term history of Open Access</a> without APCs and are publicly funded. There are few reasons for this, one of which being <a href=\"https://blog.scielo.org/en/2015/11/13/predatory-journals-the-dark-side-of-open-access/#.Y3PqVezMI-Q\">the high cost of journal subscriptions in the 90s, which worked as a big motivator for the creation of free to access/publish electronic journals</a>.</p><p>Despite this Latin American open access tradition, in countries like Colombia, APC payments are increasing. Many <a href=\"https://www.nature.com/articles/d41586-022-03201-w\">voices</a> in the community argue that transformative agreements might threaten the current local ecosystem as the more funds that are allocated for APCs diminish the investment in shared infrastructure and tools.</p><p>When it comes to infrastructure, just being open might not be enough; operating infrastructure is not simple and requires investment, capacity building, maintenance, and dedicated staff committed that can ensure accessible, inclusive, and responsive tools. Resilience and sustainability are very sizable challenges that need to be addressed via governance.</p><p>This is part of the reason why using infrastructure from private vendors can be sometimes appealing. There's an ease to it and of course there’s a price to this, both in the literal and in the <a href=\"https://investinopen.org/blog/take-action-to-stop-the-lock-up-of-research-and-learning/\">surveillance-capitalism sense</a>.</p><p>A local solution in Latin America for this has been to have independent and self-sustainable organizations that not only publish research results but also fill a role in offering infrastructure and innovation options, training to improve research publishing and dissemination practices, allowing local communities to operate according to the state of the art in scholarly communications, such as SciELO (established in 1998 and <a href=\"https://25.scielo.org/\">celebrating its 25th anniversary with an international conference this year</a>), Redalyc (2002), La Referencia (2010).</p><p>These types of initiatives are usually built with government funding, whether that’s directly or indirectly. In the end, one of their main contributions is to enable scaling, ensuring resilience and independence from economically exploitative practices — more importantly it’s about putting local communities and networks in the center and giving them control of the knowledge they produce.</p><p>In the end, open goes beyond access and  it’s indispensable for our community to question and rethink the ownership and diversity of research infrastructure. There is an urgent need to reclaim scholarly infrastructure if we want to pursue the benefit of the majority instead of the profit of few. There are many ways to play a more proactive role in steering research infrastructure: (choosing and) using open community-led infrastructure and services, through institutional membership, sharing use cases and feedback for improvement, participating in governance and working groups and more. </p><p>Within this framework we want to introduce a series of interviews to showcase Latin American actors driving non-commercial community-driven infrastructure for the region. Stay tuned!</p><hr><p><em>DISCLAIMER: the authors of this interview series work at DataCite and SciELO, respectively, the opinions expressed in this post are their own and don’t necessarily represent those of their employers.</em></p> "}