{"id":"https://doi.org/10.54900/c490m3r-r45gr6m","title":"Preprints and open preprint review: a workshop on innovations in scholarly publishing","link":"https://doi.org/10.54900/c490m3r-r45gr6m","published":"2022-10-25T16:21:22.000+00:00","description":"Researchers, librarians, policy makers, and practitioners often complain about the scholarly publishing system, but the system also offers exciting opportunities to contribute to innovations in the way...","isPermalink":true,"tags":["News","Meetings"],"authors":[{"name":"Bianca Kramer","url":"https://orcid.org/0000-0002-5965-6560"},{"name":"Ludo Waltman","url":"https://orcid.org/0000-0001-8249-1752"},{"name":"Jeroen Sondervan","url":null},{"name":"Jeroen Bosman","url":null}],"image":"https://upstream.force11.org/content/images/2022/10/Overview-preprint-servers.png","modified":"2023-03-16T18:57:34.000+00:00","contentHtml":" <!--kg-card-begin: html--><p class='u-drop-cap-large'>Researchers, librarians, policy makers, and practitioners often complain about the scholarly publishing system, but the system also offers exciting opportunities to contribute to innovations in the way academic findings are disseminated and evaluated. At the Dutch <a href=\"https://opensciencefestival.nl/programme-2022/\" target=\"_blank\">Open Science Festival</a>, which took place at the Vrije Universiteit Amsterdam on September 1st 2022, we organized one of the ‘community-led’ workshops to discuss some of these developments, focusing on preprints and open preprint review. Participants discussed the opportunities offered by these innovations, and reflected on ways in which these innovations may complement, or perhaps even replace, traditional journal publishing practices.</p><!--kg-card-end: html--><h2 id=\"preprints\">Preprints</h2><!--kg-card-begin: markdown--><p>An important development in scholarly publishing is the increasing adoption of preprints as a way to accelerate the dissemination of academic findings^1^. Preprinting is a fairly established practice in fields such as physics, mathematics and computing science (e.g. <a href=\"https://arxiv.org/\">arXiv</a>), and also in the form of working papers in some fields, such as economics. In recent years it has also gained significant popularity in biomedical fields (e.g. <a href=\"https://www.biorxiv.org/\">bioRxiv</a> and <a href=\"https://www.medrxiv.org/\">medRxiv</a>) and in the social and behavioral sciences (e.g. <a href=\"https://osf.io/preprints/socarxiv\">SocArXiv</a> and <a href=\"https://psyarxiv.com/\">PsyArXiv</a>). In addition to discipline-specific preprint servers, discipline-independent servers (e.g. <a href=\"https://osf.io/preprints/\">OSF Preprints</a>, <a href=\"https://www.preprints.org/\">preprints.org</a>, <a href=\"https://www.researchsquare.com/\">Research Square</a>, and <a href=\"https://www.ssrn.com/\">SSRN</a>) are also increasingly being used. Some of these servers are non-profit, while others are owned by commercial publishers.</p>\n<!--kg-card-end: markdown--><!--kg-card-begin: markdown--><p>To set the stage, we started by discussing the main characteristics of preprints. Definitions can vary, especially amongst disciplines. But in general, preprints (or “working papers”) are an early version of a paper, chapter or other publication, before formal peer review. They are published online on a preprint server either before or upon submission for more ‘formal’ publication, typically in a peer-reviewed journal. Preprints can have updated/corrected versions, e.g., based on comments from peers or community feedback. Nowadays, almost all journals and publishers allow authors to publish their work as a preprint^2^.</p>\n<!--kg-card-end: markdown--><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img src=\"https://lh4.googleusercontent.com/p7VdfVYXdyZnjt5jZxzr7sXDcnbDz21l9M2-Ar60pbnugfdvQCSKhz72UJJ6CeTGx4m44RV-_OnQbLV0kFoLsjtVGjpO4T1TqlXa4Nd9cK5OvfAVZcMX1oEHQf-tcp68-Q9MHUNHQFU2IkKHCe_1C8dro2sCExIc1Ww1OibONHL9no3-Nb1qf8wLSQ\" class=\"kg-image\" alt loading=\"lazy\"><figcaption>Uptake of COVID-19 preprints per month starting from February/March 2020.<span class=\"-mobiledoc-kit__atom\">‌ ‌</span>(source: <a href=\"https://github.com/nicholasmfraser/covid19_preprints\">https://github.com/nicholasmfraser/covid19_preprints</a>)</figcaption></figure><!--kg-card-begin: markdown--><p>Preprints are used quite widely, and can be positively disruptive to a slow and intransparent scientific communication system. Nevertheless, in many academic fields preprinting is not yet practiced by the majority, despite the ‘Corona-boost’ (see figure), and practices and norms around preprinting are therefore still in development. As a result, there may be uncertainty about the status and acceptable usage of preprints vis-à-vis peer-reviewed articles in journals. Also, the financial sustainability of preprint servers still represents a significant challenge^3^. In addition, while many institutions, funders, and societies are promoting or mandating open access publishing, they usually do not actively encourage preprinting, which may explain the relatively slow uptake of preprints. And last but not least, despite the sanity checks performed by preprint servers, there is a risk of dissemination of pseudoscience. While most preprints present solid research, there are also preprints that report on lower-quality work and that may make unsubstantiated claims.</p>\n<!--kg-card-end: markdown--><h2 id=\"preprint-peer-review\">Preprint peer review</h2><p>Unlike articles published in scholarly journals, preprints typically have not been peer reviewed. A recent development is the emergence of platforms for open peer review of preprints. These platforms complement the traditional closed journal peer review system. They typically aim to make peer review more transparent and more efficient. Examples of platforms for preprint peer review are <a href=\"https://peercommunityin.org/\">Peer Community In</a>, <a href=\"https://www.peerref.com/\">PeerRef</a>, <a href=\"https://prelights.biologists.com/\">preLights</a>, <a href=\"https://prereview.org/\">PREreview</a>, and <a href=\"https://www.reviewcommons.org/\">Review Commons</a>. A crucial characteristic of these peer review platforms is that they are all independent of journals and independent of the preprint platforms.</p><h2 id=\"future-developmentthree-scenarios\">Future development - three scenarios</h2><p>The growth in preprinting and the emergence of preprint peer review platforms raises interesting questions about the future development of the scholarly publishing system. While it is too early to make strong predictions, we did outline three scenarios in our workshop for the relation between preprints, journals and peer review.</p><h3 id=\"scenario-1-the-mixed-system\">Scenario 1: The mixed system</h3><!--kg-card-begin: markdown--><p>In this scenario, there is a mixed system in which journals, preprint servers, and peer review platforms co-exist in a loosely coupled way. Journals and preprint servers operate independently from each other, but there can be relations between them, for instance to enable authors to submit their work simultaneously to a journal and to a preprint server^4^. Likewise, there are initiatives for peer review where peer reviews are made available alongside a preprint, while also being used by journals for deciding whether to accept the preprinted article for publication in the journal. Peer review reports (of both journal articles and preprints) can also be published on dedicated platforms, both by journals and by individual reviewers, either invited by journals, by peer review services, by authors, or not invited at all.</p>\n<!--kg-card-end: markdown--><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img src=\"https://upstream.force11.org/content/images/2022/10/Mixed-model.png\" class=\"kg-image\" alt loading=\"lazy\" width=\"1102\" height=\"720\" srcset=\"https://upstream.force11.org/content/images/size/w600/2022/10/Mixed-model.png 600w, https://upstream.force11.org/content/images/size/w1000/2022/10/Mixed-model.png 1000w, https://upstream.force11.org/content/images/2022/10/Mixed-model.png 1102w\" sizes=\"(min-width: 720px) 720px\"><figcaption>Scenario 1: The mixed system</figcaption></figure><h3 id=\"scenario-2-the-extended-journal\"><br>Scenario 2: The extended journal</h3><p>In this scenario, journals broaden the services they offer to include preprinting and open peer review, leading to what may be referred to as the ‘extended journal’. Preprinting and open peer review become fully integrated elements in the workflows of journals. Scholarly publishing remains organized around journals, but journals start to perform functions that they did not perform traditionally.</p><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img src=\"https://upstream.force11.org/content/images/2022/10/Extended-journal-model.png\" class=\"kg-image\" alt loading=\"lazy\" width=\"1516\" height=\"294\" srcset=\"https://upstream.force11.org/content/images/size/w600/2022/10/Extended-journal-model.png 600w, https://upstream.force11.org/content/images/size/w1000/2022/10/Extended-journal-model.png 1000w, https://upstream.force11.org/content/images/2022/10/Extended-journal-model.png 1516w\" sizes=\"(min-width: 720px) 720px\"><figcaption>Scenario 2: The extended journal</figcaption></figure><p>Examples of this could be found at Copernicus Publications, with their <a href=\"https://publications.copernicus.org/services/public_peer_review.html\">Interactive Peer Review</a>, but also at the F1000 platforms, which are currently also whitelabeled and used by research funders (e.g. Wellcome Open Research and the European Commission’s Open Research Europe platform). The integration of SSRN and Research Square in the submission workflows of Elsevier and Springer Nature journals is another example of a development in the direction of the extended journal.</p><h3 id=\"scenario-3-moving-away-from-journal-based-publishing\">Scenario 3: Moving away from journal-based publishing</h3><p>In this scenario, the scientific community increasingly recognizes the value of preprint servers and peer review platforms. This leads to a situation that may be considered the opposite of the ‘extended journal’ scenario discussed above. Rather than taking on additional functions, journals choose to unbundle their services. The dissemination function of journals is going to be performed by preprint servers (although the term ‘preprint’ may no longer be appropriate), while the evaluation function is going to be performed by peer review platforms. In the most extreme variant of this scenario, journals completely cease to exist and scholarly publishing takes place entirely on preprint servers and peer review platforms.</p><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img src=\"https://upstream.force11.org/content/images/2022/10/No-journal-involved.png\" class=\"kg-image\" alt loading=\"lazy\" width=\"506\" height=\"735\"><figcaption><em>Scenario 3: Moving away from journal-based publishing</em></figcaption></figure><p>The <a href=\"https://elifesciences.org/inside-elife/e4638e4a/elife-latest-a-new-vision-for-transforming-research-communication\">‘publish, review, curate’ model</a> promoted by eLife, <a href=\"https://peercommunityin.org/\">Peer Community In</a> and the <a href=\"https://www.coar-repositories.org/notify/\">Notify-project</a> by the Confederation of Open Access Repositories (COAR) are important steps in this direction. An important issue that we did not address in the workshop is how such a system without journals performs the functions of disciplinary communities and topical filtering that journals currently have. By taking advantage of developments in filtering technologies, we expect that preprint servers and peer review platforms will increasingly be able to perform these functions.</p><h2 id=\"publish-your-reviews\">Publish Your Reviews</h2><p>At the end of our workshop, we presented the <a href=\"https://asapbio.org/publishyourreviews\">Publish Your Reviews</a> initiative, a new community-based initiative developed by one of us together with ASAPbio. Building on the above-mentioned developments, Publish Your Reviews encourages researchers to combine journal peer review with preprint peer review, aiming to increase the value of preprints and to make peer review more useful and more efficient. Supported by <a href=\"https://asapbio.org/publishyourreviews#supporters\">publishers and other organizations</a>, the initiative calls on researchers to publish the reviews they submit to journals and to link these reviews to the preprint version of the article under review. Researchers that support Publish Your Reviews are invited to <a href=\"https://asapbio.org/publishyourreviews#sign\">sign a pledge</a>.</p><figure class=\"kg-card kg-image-card\"><img src=\"https://lh4.googleusercontent.com/wuCipVHAGGCTETS9lL39tE2GQypcl7l_1BFIHFmd5Mg4Z03T_N6GGrJzRBjYe30QO9Fi-fui_7dw6roKPtWxuTVXHUhDJr-ct60KjEL-gVwsPwRMlU_PbtE6Da9o_jv7zric16G-8wWh0uIpRUYifHpZoEcCK22iY01CpvpCtp5ekYEHerqCQONTuw\" class=\"kg-image\" alt loading=\"lazy\"></figure><h2 id=\"next-steps\">Next steps</h2><p>The workshop participants showed a great interest in the above-mentioned developments. At the end of the workshop, many participants had a concrete plan for contributing to these developments. Some of them announced they are going to publish their own reviews, while others plan to promote preprinting and preprint peer review in their community. There were also participants that are going to consider how preprinting and preprint peer review can be given appropriate recognition in hiring and promotion policies.</p><p>Further support for innovating scholarly publishing was given at the end of the Open Science Festival, when Robert Dijkgraaf, Minister of Education, Culture and Science, <a href=\"https://www.scienceguide.nl/2022/09/dijkgraaf-wil-af-van-dom-publicatiesysteem/\">strongly criticized</a> the current publishing system. We hope the words of the minister will encourage everyone in the Dutch research community and beyond to support efforts to innovate scholarly publishing!<br></p><p>---</p><p>References:<br>1. See for example: Chiarelli, A. et al. (2019). Accelerating scholarly communication: The transformative role of preprints. Zenodo. <a href=\"https://doi.org/10.5281/zenodo.3357727\">https://doi.org/10.5281/zenodo.3357727</a> and Waltman, L., et al.  (2021). Scholarly communication in times of crisis: The response of the scholarly communication system to the COVID-19 pandemic (Version 1). Research on Research Institute. <a href=\"https://doi.org/10.6084/m9.figshare.17125394.v1\">https://doi.org/10.6084/m9.figshare.17125394.v1</a>.</p><p>2. The JISC service <a href=\"https://v2.sherpa.ac.uk/romeo/\">Sherpa Romeo</a> offers information about journals’ policies on posting different versions of a research article (preprint, postprint and Version of Record).</p><p>3. Penfold, N. (2022). The case for supporting open infrastructure for preprints: A preliminary investigation. Zenodo. <a href=\"https://doi.org/10.5281/zenodo.7152735\">https://doi.org/10.5281/zenodo.7152735</a></p><p>4. See for example the Direct Transfer Service offered by PLOS <a href=\"https://journals.plos.org/plosone/s/preprints\">https://journals.plos.org/plosone/s/preprints</a>.</p><p><br><br></p><p><br><br></p><p>For commenting, all slides are available <a href=\"https://docs.google.com/presentation/d/1R8dAvSvLnDFUcLVip0mHhEbWyDAbpzuIsibhNloXkl0/edit#slide=id.p\">here</a>.</p><p>For referencing, all slides are deposited here: <a href=\"https://doi.org/10.5281/zenodo.7040997\">https://doi.org/10.5281/zenodo.7040997</a>. <br></p> "}