{"id":"https://doi.org/10.54900/f121hft-tftvd9a","title":"The sustainability argument for open science? In conversation with the authors.","link":"https://doi.org/10.54900/f121hft-tftvd9a","published":"2022-08-16T07:00:27.000+00:00","description":"The climate crisis is affecting us all, and it seems like there is a role for open research to play. This year’s Open Access week stimulates us all to have more discussions on this topic with the theme “Open...","isPermalink":true,"tags":["Interviews"],"authors":[{"name":"Gisela Govaart","url":null},{"name":"Simon M. Hofmannn","url":null},{"name":"Chris Hartgerink","url":"https://orcid.org/0000-0003-1050-6809"}],"image":"https://images.unsplash.com/photo-1586596436497-8d6f8d1d921f?crop&#x3D;entropy&cs&#x3D;tinysrgb&fit&#x3D;max&fm&#x3D;jpg&ixid&#x3D;MnwxMTc3M3wwfDF8c2VhcmNofDUxfHxyZXNlYXJjaHxlbnwwfHx8fDE2NjAzMTI1MDA&ixlib&#x3D;rb-1.2.1&q&#x3D;80&w&#x3D;2000","modified":"2023-01-13T07:41:37.000+00:00","contentHtml":" <!--kg-card-begin: html--><p class='u-drop-cap-large'>The climate crisis is affecting us all, and it seems like there is a role for open research to play. This year’s Open Access week stimulates us all to have more discussions on this topic with the theme “Open for climate justice.”</p><!--kg-card-end: html--><p>Today we talk to <a href=\"https://twitter.com/GiselaGovaart\">Gisela Govaart</a> and <a href=\"https://twitter.com/HofmannZimon\">Simon Hofmann</a>, two authors of the paper <a href=\"https://doi.org/10.1525/collabra.35903\">“The Sustainability Argument for Open Science”</a> published in Collabra: Psychology (co-author <a href=\"https://twitter.com/EvelynMedawar\">Evelyn Medawar</a> was unavailable for this conversation). </p><figure class=\"kg-card kg-bookmark-card\"><a class=\"kg-bookmark-container\" href=\"https://doi.org/10.1525/collabra.35903\"><div class=\"kg-bookmark-content\"><div class=\"kg-bookmark-title\">The Sustainability Argument for Open Science</div><div class=\"kg-bookmark-description\">Ever-increasing anthropogenic greenhouse gas emissions narrow the timeframe for humanity to mitigate the climate crisis. Scientific research activities are resource demanding and, consequently, contribute to climate change; at the same time, scientists have a central role in advancing knowledge, als…</div><div class=\"kg-bookmark-metadata\"><img class=\"kg-bookmark-icon\" src=\"https://ucp.silverchair-cdn.com/Themes/Client/app/img/favicons/v-637926275942614749/apple-touch-icon.png\" alt=\"\"><span class=\"kg-bookmark-author\">University of California Press</span><span class=\"kg-bookmark-publisher\">Gisela H. Govaart</span></div></div><div class=\"kg-bookmark-thumbnail\"><img src=\"https://ucp.silverchair-cdn.com/Themes/Silver/app/img/generic-cover.png\" alt=\"\"></div></a></figure><hr><p><strong><u>Chris Hartgerink:</u></strong> Could you briefly summarize for the readers of Upstream what “the sustainability argument for open research” is?</p><p><strong><u>Gisela Govaart:</u></strong> The sustainability argument for open science is twofold: On the one hand, it is about how open science practices can help make research practices more sustainable, more environmentally friendly. On the other hand, it is about how open science practices can help improve science, in order to foster scientific progress, therefore hopefully making sure that we get to solutions for the climate crisis faster and better.</p><p><strong><u>Simon Hofmann:</u></strong> It’s two sides of the same coin: Making the scientific process more sustainable, but also more efficient.</p><p><strong><u>Chris Hartgerink:</u></strong> Because you focus on the ecological sustainability aspect, I wanted to ask you how you feel about economic and social sustainability, which are also very often discussed within sustainability? Are these also affected by this argument?</p><p><strong><u>Simon Hofmann:</u></strong> In the paper we take a broad definition of the term sustainability. For us, sustainability refers to saving natural, monetary, but also human resources that is their time, their personal investments, including their motivation. Moreover, we argue in the paper that sustainable research also means integrating people from different parts of the planet. Only this way, we can make results impactful around the globe and therefore more sustainable. Open science practices have great potential to integrate a wider spectrum of people into science, and to avoid wasting resources.</p><p><strong><u>Chris Hartgerink:</u> </strong>That's a good point to highlight. You developed this sustainability argument and it's difficult to find out your personal motivations about why you wrote this paper. We see a lot of scientists publicly worry about the climate crisis. We see people personally worried about the climate crisis. What were your motivations to develop this argument?</p><p><strong><u>Gisela Govaart:</u></strong> For me, being worried about the climate crisis is definitely part of it, this is what makes me think about the topic in the first place of course. But it is also this ideal that I have of the function of scientists in society, I think we should contribute something to society. I am doing fundamental research, which is definitely valuable for society, but I sometimes miss the engagement with important societal issues.</p><p>More practically, our motivation was that in our institute we have two grassroots initiatives: the Open Science Initiative and the Green Team (a sustainability initiative). Through conversations between these two groups we started asking ourselves the question of how these two concepts and initiatives could complement each other.</p><p><strong><u>Simon Hofmann:</u></strong> Already in my early school years, I thought that the most pressing topic of our society is climate change. And that is, sadly, already quite some time ago. The realization that very little is happening on a political and economic level over all these years, despite calls for actions on all levels, this change often must start from the bottom up. The grassroots movements at our institute, which Gisela mentioned, also reflects what we all started seeing on the streets with Fridays for Future and similar movements. This energy motivated - I think I can say - all of us to find solutions also in the sciences on an individual and systemic level.</p><p>Not only on the level of our institute but also in the whole Max Planck Society, we have a strong working group on open science, but also a very active sustainability network, in which our colleague Evelyn Medawar was involved. At a certain point we realized that open science and sustainability go hand in hand.</p><p><strong><u>Chris Hartgerink:</u></strong> That also might be a good segue to the next question. You propose the sustainability argument for open research and you say not enough is happening politically to prevent the climate crisis, to mitigate or reduce the impact that we’re having.</p><p>What role do you see for open research and for open researchers to strengthen the sustainability argument? What can researchers do to make their own work more ecologically sustainable?</p><p><strong><u>Gisela Govaart:</u></strong> That’s a good question to ask, which we also discuss a lot in our article. For all different stages of the research process, we discuss open science practices that can make researchers’ work more sustainable. For example, during study design, it is important to think about sample size, to make sure you don’t collect too little or too much data. This can for example be done with the help of power analyses and preregistrations. After the project is finished, a very fruitful way to improve the sustainability of your work is to share your data and code, such that this can be reused. </p><p>Making sure that your work is accessible is also an important point. We also discuss crowd science as a way to both increase and possibly diversify your sample. At the same time there is also an opportunity to communicate scientific facts to a bigger public, in such a way that it helps people understand the urgency of the climate crisis. This should however be done in such a way that people don't get what is called “eco anxiety.” We need to help people feel that they have agency, that they can do something. Either through individual actions or by pushing for policy changes.</p><p>Pushing for policy changes is also something that scientists can and should do. Because even though the actions of individual scientists are important, I think the real change will come from systemic change.We need to change academic incentives to make sure that people are rewarded for implementing open science practices that will make science more sustainable.</p><p><strong><u>Simon Hofmann:</u></strong> I would also stress the incentives. I think we would agree that people from all over the world can benefit, for instance, from publications being openly accessible, or when research code can be downloaded and reused. Too few researchers and institutions provide their materials, because the extra effort for opening research is often not rewarded.</p><p>Another way to strengthen the argument would be to get better information on the carbon footprint of  research projects, and to gain good estimates on how open science measures can help lower emissions. This would definitely help to convey the message on a political, systemic level to decision makers, who can make a big impact regarding the transition to more open and sustainable research.</p><p><strong><u>Chris Hartgerink:</u></strong> I hear your point that it isn't just the individual researchers — things like measuring the emission impact of a research project will help us understand that it is not just more efficient in terms of publications, but also more efficient in terms of resources. That's definitely a way to strengthen that argument.</p><p>This year’s Open Access Week theme is “Open for climate justice” (<a href=\"https://www.openaccessweek.org/\">October 24-30, 2022</a>). I wanted to ask both of you what do you hope to see or what would you like to see happen during this week?</p><p><strong><u>Gisela Govaart:</u></strong> In the theme of the Open Access Week, I see three terms: open access, climate, and justice. The justice part is an important topic for me, which I think could be highlighted more. </p><p>As an example, high Article Processing Charges (APCs) can be a huge burden for scientists from institutions that don't have the money to pay these costs, which actually makes scientific publishing more unjust. Sadly, most of the time these less privileged research groups are also often based in areas which are most affected by the climate crisis.</p><p>That would be something that I would like to see being discussed more, what are possible unintended negative side effects of open science policies, and how can they make academia more unjust. I think by critically examining our own proposals, we can make them better and more impactful for anyone in academia and not only for the lucky few like ourselves.</p><p><strong><u>Simon Hofmann:</u></strong> I think platforms such as the Open Access Week bring people together that are interested in the topic and are open to apply open science practices. It is important to improve the skill sets that people need to be open and sustainable in their research. How do I structure my experimental code to be useful for others? How can I share my research project? Where can I share its data? What are the corresponding privacy concerns? What else do I have to be aware of?</p><p>With an event like this, participants can advance these skills. But obviously, sharing this knowledge and the “how-to” material can have a lasting effect that propagates through the whole scientific community, enabling those who couldn’t join the event to participate in and benefit from open research.</p><p><strong><u>Gisela Govaart:</u> </strong>What I’d like to see during the Open Access week is that it also helps people gain knowledge about the climate crisis. But in such a way that they don't get what is called “eco anxiety.” How can we help people to feel that they have agency, that they can do something. That they can have an impact. I think that's also something that falls within open research.</p><hr><p>Thanks for reading this Upstream interview with the authors on the “<a href=\"https://doi.org/10.1525/collabra.35903\">Sustainability argument for open research</a>”.</p><p>Do you have ideas or plans for Open Access week on “Open for climate justice”? Send us an email at <a href=\"mailto:upstream@force11.org\" rel=\"noopener noreferrer\">upstream@force11.org</a> - we’d love to hear from you!</p> "}