{"id":"https://doi.org/10.54900/dpfcg6r-r1phx24","title":"Hot memo summer: How OSTP’s recommendations will lead to a large-scale transformation of the research ecosystem","link":"https://doi.org/10.54900/dpfcg6r-r1phx24","published":"2022-09-20T08:32:48.000+00:00","description":"Since 2015 I’ve been steeped in the world of open access, academic publishing, and funder policies. This is a blip of time compared to many other experts and advocates in this space. I’ve often sardonically...","isPermalink":true,"tags":["Thought Pieces"],"authors":[{"name":"Ashley Farley","url":"https://orcid.org/0000-0001-9310-6944"}],"image":"https://images.unsplash.com/photo-1578048421563-9aa187e12baf?crop&#x3D;entropy&cs&#x3D;tinysrgb&fit&#x3D;max&fm&#x3D;jpg&ixid&#x3D;MnwxMTc3M3wwfDF8c2VhcmNofDR8fHRyYW5zZm9ybWF0aW9ufGVufDB8fHx8MTY2MzQyNDUwMw&ixlib&#x3D;rb-1.2.1&q&#x3D;80&w&#x3D;2000","modified":"2023-01-12T19:27:52.000+00:00","contentHtml":" <p>Since 2015 I’ve been steeped in the world of open access, academic publishing, and funder policies. This is a blip of time compared to many other experts and advocates in this space. I’ve often sardonically joked that if I had received a dollar for every time I’ve heard that open access will become the norm once the United States changes its policy I could retire early.  I remember attending a funder convening at the Office of Science and Technology Policy (OSTP) in 2018 feeling both the urgency for systemic change and the weight of publisher lobbying to protect the status quo. It’s certainly something I never thought would happen in my career. Thus, I was elated to see the <a href=\"https://www.whitehouse.gov/ostp/news-updates/2022/08/25/ostp-issues-guidance-to-make-federally-funded-research-freely-available-without-delay/\">announcement</a> that the OSTP is updating its guidance to make federally funded research freely available without embargo. This feels like an important and needed tipping point for the United States. It’s a chance to catch up with other parts of the world (Europe, Australia, Netherlands, Latin America, etc.) that have been prioritizing and delivering on open science for many years now. <br></p><p>One reason this announcement is so important is that it confirms the conviction of many who have taken risks and pushed against the status quo with the inherent belief that change is necessary. This is a proof point that the work and sacrifices made are creating momentum and advancements. I want to take the time to thank the funders and academic institutions that have implemented and enforced strong policies with the goal of adapting the behaviors of their communities. This is never a fun endeavor, and no matter how carefully one constructs policy you are inconveniencing or creating conflict for someone. I’ve been proud that the Bill & Melinda Gates Foundation joined <a href=\"https://www.coalition-s.org/\">cOAlition S </a>early on and has been actualizing Plan S principles. It hasn’t been easy, and I will be the first to acknowledge when criticisms of <a href=\"https://www.coalition-s.org/why-plan-s/\">Plan S</a> are well-founded. We can and should always strive to do better. And I believe we have throughout the years. However, it’s not easy to set policy as a funder as there are pressures coming from all sides: grantee authors are concerned about career advancement and don’t want to alter their publishing habits, while on the other side you have publishers pushing back on and resisting policy. Oftentimes authors and publishers align in a semi-parasitic symbiotic relationship where authors strive to publish in a journal with the highest reward potential for their career and publishers benefit from this competitive nature. In the hierarchy of needs, authors will place future career advancement over funder policy compliance. And the publishers don't have the incentive to be flexible to meet those policy requirements. What gets lost in all of this is ensuring that knowledge is openly and easily shared globally to solve problems. <br></p><p>Sharing knowledge really shouldn’t be this hard. Yet, I recognize it’s complex to change a system that is still stymied by its print-based origin. While funder policies have been criticized as adding further complexity, they do lead to a stronger awareness of the issues and inspire potential transformation. This is why, to me, the OSTP announcement feels like a tipping point in this transformation. That others have led the way and advocated so that this is possible should not go unacknowledged. Even with the pitfalls of transition to open access (high Article Processing Charges (APCs), “transformative” agreements or journals, arguments over rights retention) authors are considering these issues more now than ever. And I would make a bet that many publishers, especially the for-profit commercial ones, rely on and benefit from authors moving through the publishing system without question, signing away their rights without consideration, and letting their research be locked up. Now, as authors work through the nuances of open access policy more attention is being paid (pun intended) and the true value-add of the publishers is being scrutinized. Are we at the precipice of the utopia of open-access publishing that we’ve dreamt of? No. Not at all. But are we closer? I would argue, yes, and with the OSTP we can move forward with more collective action power. This can transform the open access movement into true action. <br></p><p>Are there going to be mistakes along the way? Of course. Should we push as hard as possible to achieve the vision of all open movements beginning with the <a href=\"https://www.budapestopenaccessinitiative.org/\">Budapest Open Access Initiative</a>? Definitely. Staying still or turning back isn’t an option. For publishers, the ideal move would be to immediately drop any embargos to allow for immediate, CC-BY sharing. This certainly shouldn’t come as a surprise to publishers, and I push back on any rhetoric that publishers have not been consulted. There have been decades of discourse and lobbying, and at some point, the response is inherently known. I don’t expect (especially for-profit) publishers not to prioritize profit and business, but I do expect funding institutions to place the public good above the wants of businesses. Funders have given publishers years, if not decades, to innovate and find better models to make open access the norm. And we’ve seen publishers make grandiose statements regarding their commitments to open science. The time to act on these statements is now. Either we all continue to kick the can down the road, or we pick it up and recycle it to transform it into something better and usable. <br></p><p>If publishers don’t adjust their policies, then a strong <a href=\"https://www.coalition-s.org/rights-retention-strategy/\">Rights Retention</a> policy needs to be enacted. I have a hard time seeing where the money to support APCs for federally funded research will come from. The conversation of equity of APCs is heating up as it should. I work at a privileged organization, and yearly we spend approximately 6 million in APCs each year. While it’s great to release articles from being held hostage behind paywalls and restrictive licensing - I’m not sure the impact is much larger than that. The larger impact will only happen when much more of the world’s content is open, has robust metadata, and is machine-readable. I would like to see a massive uptake of green open access or self-archiving to achieve this.  Now, the systems and the underpinning open infrastructures are stronger and continue to develop to best support open access, open metadata, and open science. Through this researchers have more power to share their research on their terms than they have in decades. We can deprioritize the prevalence of APCs. Then we could see actual innovation in knowledge curation. This innovation isn’t going to be driven by the large corporate publishers, and we shouldn’t wait for it to happen.<br></p><p>The foundation’s open access policy will continue to evolve as the ecosystem does the same. In my opinion, a successful policy is one that adapts to put pressure on the cracks in the current system. I predict that funder policies will continue to strengthen rights retention, include a cap on the amount of money that can be spent on publishing, shift away from reliance on the version of record, and build more support for open science (focusing less on articles and more on all knowledge outputs). <br></p><p>I often grow weary of how persistent the above discourse is when it isn’t married to action. Thus, I would like to close with recommended actions for each stakeholder in academic publishing. These may be very lofty, difficult, scary actions but now is the time to be <strong>bold</strong>. </p><div class=\"kg-card kg-callout-card kg-callout-card-grey\"><div class=\"kg-callout-emoji\">💡</div><div class=\"kg-callout-text\"><strong>Authors:</strong> Pay attention to and heed your funder’s policies regarding publishing and data sharing. There is a strong intentionality to these policies. Become an advocate for change that is needed to make this easier for those who follow you. Retain your rights. There is no reason to give exclusive rights to anyone for the purpose of knowledge dissemination.</div></div><div class=\"kg-card kg-callout-card kg-callout-card-grey\"><div class=\"kg-callout-emoji\">💡</div><div class=\"kg-callout-text\"><strong>Funders: </strong>Join other funders in implementing strong sharing policies. The more this becomes a standard requirement for funding and conducting research, the more the system will change for the better.</div></div><div class=\"kg-card kg-callout-card kg-callout-card-grey\"><div class=\"kg-callout-emoji\">💡</div><div class=\"kg-callout-text\"><strong>Librarians</strong>: I am heartened to see a shift in vendor engagement and library spending becoming more values-driven. Librarians need to push back harder on publisher antics and strive for actual transformation.</div></div><div class=\"kg-card kg-callout-card kg-callout-card-grey\"><div class=\"kg-callout-emoji\">💡</div><div class=\"kg-callout-text\"><strong>Publishers*:</strong> Get rid of embargos. Embrace rights retention. Improve your metadata. Work WITH the rest of the ecosystem to solve publishing problems.</div></div><div class=\"kg-card kg-callout-card kg-callout-card-grey\"><div class=\"kg-callout-emoji\">💡</div><div class=\"kg-callout-text\"><strong>Institutions:</strong> Change those academic career incentives to prioritize openness, sharing, and collaboration now. Be involved in the discourse.&nbsp;</div></div><div class=\"kg-card kg-callout-card kg-callout-card-grey\"><div class=\"kg-callout-emoji\">💡</div><div class=\"kg-callout-text\"><strong>Advocates</strong>: Keep it up! You should enjoy this win and use the momentum to keep advocating. Practice self-care - it’s taken this long to get to this point, so the marathon continues.&nbsp;</div></div><p><em>*I can over-generalize when using the term “publishers”. I am often talking about the oligopoly of the top 5 for-profit publishers.</em></p> "}