{"version":"https://jsonfeed.org/version/1.1","id":"8epr274","title":"Journal of Open Source Software Blog","description":"Blog for the Journal of Open Source Software • <a href='https://joss.theoj.org'>https://joss.theoj.org</a>","language":"en","license":"https://creativecommons.org/licenses/by/4.0/legalcode","category":"Engineering and Technology","homePageUrl":"https://blog.joss.theoj.org/","feedUrl":"https://blog.joss.theoj.org/feed.xml","favicon":null,"generator":"Jekyll v3.9.2","items":[{"id":"https://blog.joss.theoj.org/2022/12/call-for-editors","title":"Call for editors","link":"https://blog.joss.theoj.org/2022/12/call-for-editors","published":"Thu, 08 Dec 2022 00:00:00 +0000","description":"Once again, we’re looking to grow our editorial team at JOSS! Since our launch in May 2016, our existing editorial team has handled over 2000 submissions (1838 published at the time of writing, 215 under...","isPermalink":false,"tags":["announcements"],"authors":[{"name":null,"url":null}],"image":null,"modified":null,"contentHtml":"<p>Once again, we’re looking to grow our editorial team at JOSS!</p>\n\n<p>Since our launch in <a href=\"https://www.arfon.org/announcing-the-journal-of-open-source-software\">May 2016</a>, our <a href=\"http://joss.theoj.org/about#editorial_board\">existing editorial team</a> has handled over 2000 submissions (1838 published at the time of writing, 215 under review) and the demand from the community continues to be strong. JOSS now consistently publishes a little over one paper per day, and we see no sign of this demand dropping.</p>\n\n<p>New editors at JOSS are asked to make a minimum 1-year commitment, with additional years possible by mutual consent. As some of our existing editorial team are reaching the end of their term with JOSS, the time is right to bring on another cohort of editors.</p>\n\n<h3 id=\"background-on-joss\">Background on JOSS</h3>\n\n<p>If you think you might be interested, take a look at our <a href=\"https://joss.readthedocs.io/en/latest/editing.html\">editorial guide</a>, which describes the editorial workflow at JOSS, and also some of the reviews for <a href=\"https://github.com/openjournals/joss-reviews/issues?utf8=%E2%9C%93&amp;q=is%3Aclosed+label%3Aaccepted+\">recently accepted papers</a>. Between these two, you should be able to get a good overview of what editing for JOSS looks like.</p>\n\n<p>Further background about JOSS can be found in our <a href=\"https://peerj.com/articles/cs-147/\">PeerJ CS paper</a>, which summarizes our first year, and our Editor-in-Chief’s <a href=\"https://www.arfon.org/announcing-the-journal-of-open-source-software\">original blog post</a>, which announced the journal and describes some of our core motivations for starting the journal.</p>\n\n<p>More recently we’ve also written in detail about <a href=\"https://blog.joss.theoj.org/2019/06/cost-models-for-running-an-online-open-journal\">the costs related with running JOSS</a>, <a href=\"https://blog.joss.theoj.org/2019/07/scaling\">scaling our editorial processes</a>, and <a href=\"https://www.youtube.com/watch?v=niRiyaErqwQ\">talked about the collaborative peer review that JOSS promotes</a>.</p>\n\n<h2 id=\"how-to-apply\">How to apply</h2>\n\n<p>Firstly, we especially welcome applications from prospective editors who will contribute to the diversity (ethnic, gender, disciplinary, and geographical) of our board.</p>\n\n<p>✨✨✨ If you’re interested in applying please fill in this <a href=\"https://forms.gle/cqpUEZTN6vqNXrbm9\">short form</a> by 22nd December 2022. ✨✨✨</p>\n\n<h2 id=\"who-can-apply\">Who can apply</h2>\n\n<p>We welcome applications from potential editors with significant experience in one or more of the following areas: open source software, open science, software engineering, peer-review.</p>\n\n<p>The JOSS editorial team has a diverse background and there is no requirement for JOSS editors to be working in academia. Unfortunately individuals enrolled in a PhD program are not eligible to serve on the JOSS editorial team.</p>\n\n<h3 id=\"selection-process\">Selection process</h3>\n\n<p>The <a href=\"http://joss.theoj.org/about#editorial_board\">JOSS editorial team</a> will review your applications and make their recommendations. Highly-ranked candidates will then have a short (~30 minute) phone call/video conference interview with the editor(s)-in-chief. Successful candidates will then join the JOSS editorial team for a probational period of 3 months before becoming a full member of the editorial team. You will get an onboarding “buddy” from the experienced editors to help you out during that time.</p>\n\n<p><em>Dan Foreman-Mackey, Olivia Guest, Daniel S. Katz, Kevin M. Moerman, Kyle E. Niemeyer, Arfon M. Smith, George K. Thiruvathukal, Kristen Thyng</em></p>"},{"id":"https://blog.joss.theoj.org/2022/07/call-for-editors-astro","title":"Call for editors: Astronomy & Astrophysics","link":"https://blog.joss.theoj.org/2022/07/call-for-editors-astro","published":"Tue, 12 Jul 2022 00:00:00 +0000","description":"JOSS is continuing to grow, and we are looking to add more editors with expertise in the area of astronomy &amp; astrophysics. Since our launch in May 2016, our existing editorial team has handled nearly...","isPermalink":false,"tags":["announcements"],"authors":[{"name":null,"url":null}],"image":null,"modified":null,"contentHtml":"<p>JOSS is continuing to grow, and we are looking to add more editors with expertise in the area of astronomy &amp; astrophysics.</p>\n\n<p>Since our launch in <a href=\"https://www.arfon.org/announcing-the-journal-of-open-source-software\">May 2016</a>, our <a href=\"http://joss.theoj.org/about#editorial_board\">existing editorial team</a> has handled nearly 1900 submissions (1684 published at the time of writing, 205 under review) and the demand from the community continues to grow. In particular, we have seen an increase in the number of astronomy &amp; astrophysics submissions, beyond the capacity of our current editorial team.</p>\n\n<p>Editors at JOSS make a minimum 1-year commitment, with additional years possible by mutual consent. With some of our existing editorial team reaching the end of their terms with JOSS and this increase in submissions, the time is right to bring new editors on board.</p>\n\n<h3 id=\"background-on-joss\">Background on JOSS</h3>\n\n<p>If you think you might be interested, take a look at our <a href=\"https://joss.readthedocs.io/en/latest/editing.html\">editorial guide</a>, which describes the editorial workflow at JOSS, and also some of the reviews for <a href=\"https://github.com/openjournals/joss-reviews/issues?utf8=✓&amp;q=is%3Aclosed+label%3Aaccepted+\">recently accepted papers</a>. Between these two, you should be able to get a good overview of what editing for JOSS looks like.</p>\n\n<p>Further background about JOSS can be found in our <a href=\"https://peerj.com/articles/cs-147/\">PeerJ CS paper</a>, which summarizes our first year, and our Editor-in-Chief’s <a href=\"https://www.arfon.org/announcing-the-journal-of-open-source-software\">original blog post</a>, which announced the journal and describes some of our core motivations for starting the journal.</p>\n\n<p>More recently we’ve also written in detail about our commitment to the <a href=\"https://blog.joss.theoj.org/2021/02/JOSS-POSI\">Principles of Open Scholarly Infrastructure</a> the <a href=\"https://blog.joss.theoj.org/2019/06/cost-models-for-running-an-online-open-journal\">costs related with running JOSS</a>, <a href=\"https://blog.joss.theoj.org/2019/07/scaling\">scaling our editorial processes</a>, and talked about the <a href=\"https://www.youtube.com/watch?v=niRiyaErqwQ\">collaborative peer review that JOSS promotes</a>.</p>\n\n<p>Of specific interest to this call, we also have <a href=\"https://blog.joss.theoj.org/2018/12/a-new-collaboration-with-aas-publishing\">a collaboration with the American Astronomical Society (AAS) Journals</a> to provide a parallel review for submissions with a significant software component.</p>\n\n<h2 id=\"who-can-apply\">Who can apply</h2>\n\n<p>We welcome applications from potential editors with research experience in astronomy and astrophysics, including but not limited to, open source software development for astrophysical simulations, data reduction, or statistical methods.</p>\n\n<p>Members of the JOSS editorial team have diverse backgrounds, and we welcome JOSS editors from academia, government, and industry. We especially welcome applications from prospective editors who will contribute to the diversity (ethnic, gender, disciplinary, and geographical) of our board. We also value having a range of junior and senior editors.</p>\n\n<h3 id=\"how-to-apply\">How to apply</h3>\n\n<p>✨✨✨ To apply please fill in this <a href=\"https://forms.gle/Zjz8HuPJRGQFVurW9\">short form</a> by 31 July 2022. ✨✨✨</p>\n\n<h3 id=\"selection-process\">Selection process</h3>\n\n<p>The <a href=\"http://joss.theoj.org/about#editorial_board\">JOSS editorial team</a> will review your applications and make recommendations. Highly-ranked candidates will then have a short (~30 minute) phone call/video conference interview with a current editor. Successful candidates will then join the JOSS editorial team for a probationary period of 3 months before becoming a full member of the editorial team. You will get an onboarding “buddy” from the experienced editors to help you out during that time.</p>\n\n<p><em>Dan Foreman-Mackey, Topic Editor for Astrophysics, Journal of Open Source Software.</em></p>"},{"id":"https://blog.joss.theoj.org/2021/03/call-for-editors","title":"Call for editors","link":"https://blog.joss.theoj.org/2021/03/call-for-editors","published":"Tue, 30 Mar 2021 00:00:00 +0000","description":"JOSS is continuing to grow, and we are looking to add more editors again. We’re especially interested in recruiting editors with expertise in bioinformatics, neuroinformatics/neuroimaging, material science,...","isPermalink":false,"tags":["announcements"],"authors":[{"name":null,"url":null}],"image":null,"modified":null,"contentHtml":"<p>JOSS is continuing to grow, and we are looking to add more editors again. We’re especially interested in recruiting editors with expertise in bioinformatics, neuroinformatics/neuroimaging, material science, ecology, machine learning &amp; data science, and the social sciences.</p>\n\n<p>Since our launch in <a href=\"https://www.arfon.org/announcing-the-journal-of-open-source-software\">May 2016</a>, our <a href=\"http://joss.theoj.org/about#editorial_board\">existing editorial team</a> has handled over 1800 submissions (1200 published at the time of writing, 170 under review) and the demand from the community continues to grow. The last three months have been our busiest yet, with JOSS publishing more than one paper per day, and we see no sign of this demand dropping.</p>\n\n<p>Editors at JOSS make a minimum 1-year commitment, with additional years possible by mutual consent. With some of our existing editorial team reaching the end of their terms with JOSS and this increase in submissions, the time is right to bring on another cohort of editors.</p>\n\n<h3 id=\"editing-for-a-journal-during-a-pandemic\">Editing for a journal during a pandemic</h3>\n\n<p>After a pause on submissions in early 2020, JOSS has been open for submissions during most of the pandemic. We recognize that making time for volunteer commitments such as JOSS is especially challenging at this time and are <a href=\"https://blog.joss.theoj.org/2020/05/reopening-joss\">taking steps</a> to reduce the load on authors, editors, and reviewers and continually striving to find the right balance between accommodating the very real challenges many of us now face in our daily lives, and providing a service to the research software community.</p>\n\n<p>Editing for JOSS is a regular task, but not one that takes a huge amount of time. JOSS editors are most effective if they are able to check in on their submissions a couple of times per week. Our goal is that a JOSS editor handles about three submissions at any one time making for about 25 submissions per year.</p>\n\n<h3 id=\"background-on-joss\">Background on JOSS</h3>\n\n<p>If you think you might be interested, take a look at our <a href=\"https://joss.readthedocs.io/en/latest/editing.html\">editorial guide</a>, which describes the editorial workflow at JOSS, and also some of the reviews for <a href=\"https://github.com/openjournals/joss-reviews/issues?utf8=✓&amp;q=is%3Aclosed+label%3Aaccepted+\">recently accepted papers</a>. Between these two, you should be able to get a good overview of what editing for JOSS looks like.</p>\n\n<p>Further background about JOSS can be found in our <a href=\"https://peerj.com/articles/cs-147/\">PeerJ CS paper</a>, which summarizes our first year, and our Editor-in-Chief’s <a href=\"https://www.arfon.org/announcing-the-journal-of-open-source-software\">original blog post</a>, which announced the journal and describes some of our core motivations for starting the journal.</p>\n\n<p>More recently we’ve also written in detail about our commitment to the <a href=\"https://blog.joss.theoj.org/2021/02/JOSS-POSI\">Principles of Open Scholarly Infrastructure</a> the <a href=\"https://blog.joss.theoj.org/2019/06/cost-models-for-running-an-online-open-journal\">costs related with running JOSS</a>, <a href=\"https://blog.joss.theoj.org/2019/07/scaling\">scaling our editorial processes</a>, and talked about the <a href=\"https://www.youtube.com/watch?v=niRiyaErqwQ\">collaborative peer review that JOSS promotes</a>.</p>\n\n<h2 id=\"who-can-apply\">Who can apply</h2>\n\n<p>We welcome applications from potential editors with significant experience in one or more of the following areas: open source software, open science, software engineering, peer-review, noting again that editors with expertise in bioinformatics, neuroinformatics/neuroimaging, material science, ecology, machine learning &amp; data science, and the social sciences are most needed.</p>\n\n<p>Members of the JOSS editorial team have diverse backgrounds and we welcome JOSS editors from academia, government, and industry. We especially welcome applications from prospective editors who will contribute to the diversity (ethnic, gender, disciplinary, and geographical) of our board. We also value having a range of junior and senior editors.</p>\n\n<h3 id=\"how-to-apply\">How to apply</h3>\n\n<p>✨✨✨ To apply please fill in this <a href=\"https://forms.gle/c9gis9KKbfemA4gM6\">short form</a> by 23 April 2021. ✨✨✨</p>\n\n<h3 id=\"selection-process\">Selection process</h3>\n\n<p>The <a href=\"http://joss.theoj.org/about#editorial_board\">JOSS editorial team</a> will review your applications and make recommendations. Highly-ranked candidates will then have a short (~30 minute) phone call/video conference interview with the editor(s)-in-chief. Successful candidates will then join the JOSS editorial team for a probationary period of 3 months before becoming a full member of the editorial team. You will get an onboarding “buddy” from the experienced editors to help you out during that time.</p>\n\n<h3 id=\"thanks-to-our-editors-who-are-stepping-down\">Thanks to our editors who are stepping down</h3>\n\n<p>A few of our editors are completing terms and stepping down from editorial duties at JOSS. Lorena A Barba (@labarba), Kathryn Huff (@katyhuff), Karthik Ram (@karthik), and Bruce E. Wilson (@usethedata) have been amazing editors to have on the team and we will miss them very much!</p>\n\n<p><em>Arfon Smith, Editor-in-Chief, Journal of Open Source Software.</em></p>"},{"id":"https://blog.joss.theoj.org/2021/02/JOSS-POSI","title":"JOSS's Commitment to the Principles of Open Scholarly Infrastructure","link":"https://blog.joss.theoj.org/2021/02/JOSS-POSI","published":"Sun, 14 Feb 2021 00:00:00 +0000","description":"The Journal of Open Source Software (JOSS) is committed to the Principles of Open Scholarly Infrastructure, and here we summarize our status in doing so, followed by a more detailed discussion of how we do...","isPermalink":false,"tags":["announcements"],"authors":[{"name":null,"url":null}],"image":null,"modified":null,"contentHtml":"<p>The <a href=\"https://joss.theoj.org/\">Journal of Open Source Software (JOSS)</a> is committed to the <a href=\"http://openscholarlyinfrastructure.org/\">Principles of Open Scholarly Infrastructure</a>, and here we summarize our status in doing so, followed by a more detailed discussion of how we do so, as well as explaining some when we do not, and some work in progress.</p>\n\n<p>This document was assembled by Daniel S. Katz, Arfon Smith, Kyle E. Niemeyer, Kathryn D. Huff, and Lorena A. Barba, and reviewed and approved by the active JOSS <a href=\"https://joss.theoj.org/about#editorial_board\">editorial board</a> and <a href=\"https://joss.theoj.org/about#topic_editors\">topic editors</a>, and the <a href=\"https://github.com/openjournals/governance/blob/master/people.md\">Open Journals Steering Council</a>.</p>\n\n<h2 id=\"summary\">Summary</h2>\n\n<p><strong>Governance</strong><br />\n💛 Coverage across the research enterprise<br />\n💛 Stakeholder Governed<br />\n💚 Non-discriminatory membership<br />\n💚 Transparent operations<br />\n💚 Cannot lobby<br />\n💛 Living will<br />\n💚 Formal incentives to fulfil mission &amp; wind-down</p>\n\n<p><strong>Sustainability</strong><br />\n💚 Time-limited funds are used only for time-limited activities<br />\n💛 Goal to generate surplus<br />\n💛 Goal to create contingency fund to support operations for 12 months<br />\n💚 Mission-consistent revenue generation<br />\n💚 Revenue based on services, not data</p>\n\n<p><strong>Insurance</strong><br />\n💚 Open source<br />\n💚 Open data (within constraints of privacy laws)<br />\n💚 Available data (within constraints of privacy laws)<br />\n💚 Patent non-assertion</p>\n\n<p>(💚 = good, 💛 = less good)</p>\n\n<h2 id=\"discussion\">Discussion</h2>\n\n<h3 id=\"governance\">Governance</h3>\n\n<p>💛 Coverage across the research enterprise</p>\n\n<ul>\n  <li>It is increasingly clear that research transcends disciplines, geography, institutions and stakeholders. The infrastructure that supports it needs to do the same.</li>\n</ul>\n\n<p>Research software is essential to all types of research, and in response, JOSS’s coverage includes research software in any discipline, from any place, and from any institution.</p>\n\n<p>The scope of what we publish is only limited by a few guidelines. JOSS publications must be research software of sufficient scholarly effort, which means that some software essential to research is excluded because it is either not research software, (e.g., a C compiler) or too small (e.g., a few hundred lines of Python that implement an existing tool or that provides a wrapper to access a fine-grained data source.)</p>\n\n<p>JOSS strives for broad coverage of research disciplines in its editorial board, to better serve a broad community of authors.</p>\n\n<p>💛 Stakeholder Governed</p>\n\n<ul>\n  <li>A board-governed organisation drawn from the stakeholder community builds more confidence that the organisation will take decisions driven by community consensus and consideration of different interests.</li>\n</ul>\n\n<p>Open Journals is fiscally sponsored by NumFOCUS, and has a documented governance structure. The steering council, being a small group, is limited in its representation, in terms of geographic, ethnic, gender, and organizational diversity. The editorial board members mostly represent North America and Europe, are mostly white, are mostly male, and are mostly hands-on researchers, primarily from universities and national laboratories.</p>\n\n<p>💚 Non-discriminatory membership</p>\n\n<ul>\n  <li>We see the best option as an “opt-in” approach with a principle of non-discrimination where any stakeholder group may express an interest and should be welcome. The process of representation in day to day governance must also be inclusive with governance that reflects the demographics of the membership.</li>\n</ul>\n\n<p>Additions to the editorial board, which is the first layer of governance, are made via selections from responses to open calls and are non-discriminatory.</p>\n\n<p>💚 Transparent operations</p>\n\n<ul>\n  <li>Achieving trust in the selection of representatives to governance groups will be best achieved through transparent processes and operations in general (within the constraints of privacy laws).</li>\n</ul>\n\n<p>JOSS is publicly transparent, much more so than most other journals. Few issues are not publicly open, but these are generally open to all editors, including initial discussions about potential changes to the journal and discussions about the scope of submissions that may or may not be accepted for review. Even though some of these discussions may not occur in the open, we do publish the decisions themselves, along with an explanation.</p>\n\n<p>💚 Cannot lobby</p>\n\n<ul>\n  <li>The community, not infrastructure organisations, should collectively drive regulatory change. An infrastructure organisation’s role is to provide a base for others to work on and should depend on its community to support the creation of a legislative environment that affects it.</li>\n</ul>\n\n<p>The vast majority of time and effort used at JOSS is operational, with improvements of JOSS next, and finally some publicity about JOSS, which could be considered lobbying. However, this lobbying is mostly done by the JOSS editors because they think it is important to them, not to JOSS. The fact that they are also JOSS editors is a consequence of their feelings about the importance of recognizing contributions to research software, which also leads them to talk about this with others.</p>\n\n<p>💛 Living will</p>\n\n<ul>\n  <li>A powerful way to create trust is to publicly describe a plan addressing the condition under which an organisation would be wound down, how this would happen, and how any ongoing assets could be archived and preserved when passed to a successor organisation. Any such organisation would need to honour this same set of principles.</li>\n</ul>\n\n<p>As discussed below, there are circumstances in which we would consider the mission of JOSS fulfilled and the journal no-longer necessary. While we have not documented a plan for winding down JOSS, we believe that the core assets associated with the journal (software, article metadata, papers) are appropriately preserved as part of our ongoing operations. The articles published in JOSS are persistently archived such that an end of the journal will not affect the scholarly record.</p>\n\n<p>💚 Formal incentives to fulfil mission &amp; wind-down</p>\n\n<ul>\n  <li>Infrastructures exist for a specific purpose and that purpose can be radically simplified or even rendered unnecessary by technological or social change. If it is possible the organisation (and staff) should have direct incentives to deliver on the mission and wind down.</li>\n</ul>\n\n<p>JOSS views itself as a temporary solution to provide a means for software developers and maintainers to receive credit for their work, and to have this work (research software) improved by the process of open peer review. We look forward to a time when software papers are not needed, when software is directly recognized and cited, and when software peer review (potentially using a future version of our criteria and processes) is more widespread. JOSS is volunteer-run as a service to the community, and most of the volunteers will be happy when a solution like JOSS is no longer needed, because software has found a more direct avenue to be valued and counted in the scholarly record.</p>\n\n<h3 id=\"sustainability\">Sustainability</h3>\n\n<p>💚 Time-limited funds are used only for time-limited activities</p>\n\n<ul>\n  <li>Day to day operations should be supported by day to day sustainable revenue sources. Grant dependency for funding operations makes them fragile and more easily distracted from building core infrastructure.</li>\n</ul>\n\n<p>JOSS does not depend on grants for regular operations, but has attracted grant funding for specific activities to improve the tooling that facilitates running JOSS. We make effective use of time-limited funds such as grants to support enhancements to our services.</p>\n\n<p>💛 Goal to generate surplus</p>\n\n<ul>\n  <li>Organisations which define sustainability based merely on recovering costs are brittle and stagnant. It is not enough to merely survive, it has to be able to adapt and change. To weather economic, social and technological volatility, they need financial resources beyond immediate operating costs.</li>\n</ul>\n\n<p>As described in our blog post on the topic, our operational costs are deliberately very low. We currently do not generate a surplus and have no plans to. We also do not employ any staff and so “economic, social and technological volatility” would be expected to have limited impact on JOSS.</p>\n\n<p>💛 Goal to create contingency fund to support operations for 12 months</p>\n\n<ul>\n  <li>A high priority should be generating a contingency fund that can support a complete, orderly wind down (12 months in most cases). This fund should be separate from those allocated to covering operating risk and investment in development.</li>\n</ul>\n\n<p>We have sufficient funds available today to support our operations for substantially longer than 12 months. Allocating some of these to a formal contingency fund is something we are considering but have not yet done. As a fiscally sponsored project of NumFOCUS, JOSS can receive donations from individuals, and we can kick off a fund-raising campaign at short notice. JOSS can also apply for NumFOCUS Small Development Grants, which are awarded several times per year.</p>\n\n<p>💚 Mission-consistent revenue generation</p>\n\n<ul>\n  <li>Potential revenue sources should be considered for consistency with the organisational mission and not run counter to the aims of the organisation. For instance…</li>\n</ul>\n\n<p>JOSS revenue comes from three sources: a small amount from donations, a small amount from the American Astronomical Society (AAS) as fees for reviews of the software linked to AAS publications, and a larger amount from grants to the journal related to demonstrating its effectiveness, promoting the importance of research software, and recognizing research software’s contributors. These sources of revenue are fully consistent with the mission of JOSS.</p>\n\n<p>💚 Revenue based on services, not data</p>\n\n<ul>\n  <li>Data related to the running of the research enterprise should be a community property. Appropriate revenue sources might include value-added services, consulting, API Service Level Agreements or membership fees.</li>\n</ul>\n\n<p>JOSS receives no revenue for its data, which is completely open, but rather receives revenue for its services and for its community impact.</p>\n\n<h3 id=\"insurance\">Insurance</h3>\n\n<p>💚 Open source</p>\n\n<ul>\n  <li>All software required to run the infrastructure should be available under an open source license. This does not include other software that may be involved with running the organisation.</li>\n</ul>\n\n<p>All of JOSS’ tools are open source and available on GitHub under the Open Journals organization. This includes the JOSS website, our editorial bot Whedon, and the document production toolchain. Some of the collaboration tools we use as an editorial team are not open (e.g., GitHub, Slack, Google Docs), but these are not critical to the functioning of the journal and could be replaced by open alternatives.</p>\n\n<p>💚 Open data (within constraints of privacy laws)</p>\n\n<ul>\n  <li>For an infrastructure to be forked it will be necessary to replicate all relevant data. The CC0 waiver is best practice in making data legally available. Privacy and data protection laws will limit the extent to which this is possible</li>\n</ul>\n\n<p>Our papers and the (Crossref DOI) metadata associated with them are available on GitHub, with an open license. We deposit open citations with Crossref, and archive papers and our reviews with Portico.</p>\n\n<p>💚 Available data (within constraints of privacy laws)</p>\n\n<ul>\n  <li>It is not enough that the data be made “open” if there is not a practical way to actually obtain it. Underlying data should be made easily available via periodic data dumps.</li>\n</ul>\n\n<p>Our papers and the (Crossref DOI) metadata associated with them are available on GitHub, with an open license. These data are easily accessible to all motivated to make use of them.</p>\n\n<p>We could potentially create data exports of the JOSS web application database; however this would just be an alternative representation of the data already available.</p>\n\n<p>💚 Patent non-assertion</p>\n\n<ul>\n  <li>The organisation should commit to a patent non-assertion covenant. The organisation may obtain patents to protect its own operations, but not use them to prevent the community from replicating the infrastructure.</li>\n</ul>\n\n<p>JOSS has no interest in patents, other than resisting the creation of patents that might prevent us from operating freely.</p>"},{"id":"https://blog.joss.theoj.org/2020/08/1000-papers-published-in-joss","title":"1000 papers published in JOSS","link":"https://blog.joss.theoj.org/2020/08/1000-papers-published-in-joss","published":"Mon, 31 Aug 2020 00:00:00 +0000","description":"Today we reached a huge milestone at JOSS – we published our 1000th paper! JOSS is a developer friendly, free-to-publish, open-access journal for research software packages. Publishing 1000 papers (and...","isPermalink":false,"tags":["announcements"],"authors":[{"name":null,"url":null}],"image":null,"modified":null,"contentHtml":"<p>Today we reached a huge milestone at JOSS – we published our <a href=\"https://doi.org/10.21105/joss.02260\">1000<sup>th</sup> paper</a>! JOSS is a developer friendly, free-to-publish, open-access journal for research software packages. Publishing 1000 papers (and reviewing the corresponding 1000 software packages) over the past ~4 years has been no small feat. This achievement has been possible thanks to the efforts of our journal team and community of reviewers who have all given their time to make JOSS a success. We take this opportunity to review some of what we’ve learnt over the past four years and outline some plans for the future.</p>\n\n<h2 id=\"a-brief-recap\">A brief recap</h2>\n\n<p>Much has been written<sup id=\"fnref:1\" role=\"doc-noteref\"><a href=\"#fn:1\" class=\"footnote\" rel=\"footnote\">1</a></sup> on the topic of research software, and the challenges that individuals face receiving credit for their work. Software is critical for modern research, yet people who invest time in writing high-quality tools often aren’t well rewarded for it. The scholarly metrics of the “impact” of a researcher’s work do a poor job of supporting software (and more).</p>\n\n<p>JOSS was created as a workaround to some of the challenges for supporting software development in academia. Launched in <a href=\"https://www.arfon.org/announcing-the-journal-of-open-source-software\">May 2016</a>, JOSS provides a simple, reliable process for receiving academic career credit (through citation of software papers) for writing open source research software. Authors write and submit a short article (usually under 1000 words) about their software, and JOSS reviews the paper <em>and the software<sup id=\"fnref:2\" role=\"doc-noteref\"><a href=\"#fn:2\" class=\"footnote\" rel=\"footnote\">2</a></sup></em>, <a href=\"https://joss.readthedocs.io/en/latest/reviewer_guidelines.html\">reviewing it for a variety of qualities</a> including function, (re)usability, documentation<sup id=\"fnref:3\" role=\"doc-noteref\"><a href=\"#fn:3\" class=\"footnote\" rel=\"footnote\">3</a></sup>.</p>\n\n<p>In establishing JOSS, we wanted the editorial experience to be very different from a traditional journal, and <em>developer friendly</em> – short papers authored in Markdown, review process <a href=\"https://github.com/openjournals/joss-reviews/issues\">on GitHub</a>, open process and documentation – while at the same time following best practices in publishing depositing first-class metadata and open citations with Crossref, archiving papers and reviews with Portico, leaving <a href=\"https://joss.theoj.org/about#content_license\">copyright for the JOSS papers with authors</a> and more.</p>\n\n<p>We describe the journal this way: JOSS is an open access (<a href=\"https://en.wikipedia.org/wiki/Open_access#Diamond/platinum_OA\">Diamond OA</a>) journal for reviewing open source research software. With a heavy focus on automation, our open and collaborative peer review process is designed to improve the quality of the software submitted and happens in the open on GitHub.</p>\n\n<h2 id=\"some-lessons-learned-publishing-our-first-1000-papers\">Some lessons learned publishing our first 1000 papers</h2>\n\n<h3 id=\"joss-is-meeting-a-need-of-the-research-community\">JOSS is meeting a need of the research community</h3>\n\n<p>Something unclear when starting JOSS was whether demand from the research community would be sufficient. A few years in, we can safely conclude that JOSS is meeting a real need of the academic community.</p>\n\n<p>It has taken us a little over four years to publish 1000 papers and before pausing submissions for two months starting in early March 2020 (to give relief to our volunteers during the pandemic), we were projecting to reach this milestone sometime in June this year. It took us a little under a year to publish our <a href=\"https://joss.theoj.org/papers/10.21105/joss.00248\">100th paper</a>, and an additional 8 months to reach our 200th. In that time we’ve grown our editorial board from an <a href=\"https://peerj.com/articles/cs-147/#p-2\">initial group of 10</a> to <a href=\"https://joss.theoj.org/about#editorial_board\">more than 50 today</a>.</p>\n\n<p><img width=\"961\" alt=\"Screen Shot 2020-08-31 at 19 17 49\" src=\"https://user-images.githubusercontent.com/4483/91752725-ad2de080-ebbe-11ea-8f42-1e880fd8b2b2.png\" /></p>\n\n<h3 id=\"people-are-reading-and-citing-joss-papers\">People are reading and citing JOSS papers</h3>\n\n<p>Well over half of all JOSS papers have been cited, and many have been cited <a href=\"https://scholar.google.com/scholar?hl=en&amp;as_sdt=0,38&amp;q=source:%22Journal+of+Open+Source+Software%22\">hundreds of times</a>.</p>\n\n<p>While not designed for it, JOSS is proving a useful resource for people interested in new research software: JOSS currently receives ~10,000 monthly visitors to the journal website and provides language (e.g., <a href=\"https://joss.theoj.org/papers/in/Python\">https://joss.theoj.org/papers/in/Python</a>) and topic-based (e.g., <a href=\"https://joss.theoj.org/papers/tagged/Exoplanets\">https://joss.theoj.org/papers/tagged/Exoplanets</a>) search filters and feeds.</p>\n\n<h3 id=\"people-are-key\">People are key</h3>\n\n<p>Every journal relies upon the expertise, knowledge, and time of their reviewers and JOSS is no different. <em>935</em> individuals have contributed reviews for our first 1000 papers, <a href=\"https://gist.github.com/arfon/dfa38f0bbf89617160b350de8bc9f3c4#file-reviewers-md\">many having reviewed multiple times</a>.</p>\n\n<center>\n💖💖💖 THANK YOU 💖💖💖\n</center>\n\n<p>Like many journals, as the number of submissions grows, JOSS has had to scale its <a href=\"https://blog.joss.theoj.org/2019/07/scaling\">human processes</a>. Over the past few years we’ve added many more editors and <a href=\"https://blog.joss.theoj.org/2018/12/call-for-editors#introducing-our-three-new-associate-editors-in-chief\">associate editors-in-chief</a> to enable papers to be handled efficiently by the editorial team. Simultaneously, we’ve developed our editorial robot <a href=\"https://github.com/openjournals/whedon-api\"><em>Whedon</em></a> from being an occasional assistant during the review process to being the backbone of the whole JOSS editorial process.</p>\n\n<h3 id=\"automation-is-important\">Automation is important</h3>\n\n<p>A big part of keeping our costs low is automating common editorial tasks where at all possible. The primary interface for editors managing JOSS submissions is a GitHub issue with the assistance of our <a href=\"https://github.com/openjournals/whedon-api\">Whedon bot</a> who supports a <a href=\"https://joss.readthedocs.io/en/latest/whedon.html\">broad collection of common editorial tasks</a>. Other than having reviewers, editors and authors read papers, Pandoc-generated proofs <em>are the final version</em>, and no additional copy editing is done before a paper is published. PDF proofs and Crossref metadata are <a href=\"https://github.com/openjournals/joss-reviews/issues/2180#issuecomment-646568350\">generated automatically</a> by Whedon, and when the time comes, deposited with Crossref and published <a href=\"https://github.com/openjournals/joss-reviews/issues/2180#issuecomment-646569439\">automatically too</a>.</p>\n\n<p><img width=\"966\" alt=\"Screen Shot 2020-08-24 at 08 50 57\" src=\"https://user-images.githubusercontent.com/4483/91291776-75bdcf00-e78d-11ea-9f96-cad8c501e758.png\" /></p>\n\n<p>When starting JOSS, we thought that automation could be a big part of how things would work if the journal became successful. 1000 papers in, we believe it has been an absolutely critical part of our operations. We call this <a href=\"https://www.arfon.org/chatops-driven-publishing\">chatops-driven publishing</a>.</p>\n\n<h3 id=\"financial-support\">Financial support</h3>\n\n<p>JOSS is committed to providing a high-quality service to the community at no cost for authors or readers (<a href=\"https://en.wikipedia.org/wiki/Open_access#Diamond/platinum_OA\">Diamond/Platinum Open Access</a>). We’re transparent <a href=\"https://joss.theoj.org/about#costs\">about our operating costs</a> and have written about <a href=\"https://blog.joss.theoj.org/2019/06/cost-models-for-running-an-online-open-journal\">cost models for operating an online open journal</a>.</p>\n\n<p>While JOSS’ operating costs are modest, we’ve benefited from the support of a number of organizations including <a href=\"http://numfocus.org\">NumFOCUS</a> (the ‘<a href=\"https://github.com/openjournals/governance\">Open Journals</a>’ organization is a sponsored project of NumFOCUS), the <a href=\"https://moore.org\">Gordon and Betty Moore Foundation</a>, and the <a href=\"https://sloan.org\">Alfred P. Sloan Foundation</a>. It’s also possible to <a href=\"https://numfocus.org/donate-to-joss\">donate to JOSS</a> if you would like to support us financially.</p>\n\n<h2 id=\"to-the-future\">To the future!</h2>\n\n<p>With 1000 papers published and a further ~170 papers <a href=\"https://github.com/openjournals/joss-reviews/issues\">under review</a> JOSS is <em>busier than ever</em> and there’s little sign of demand from the community slowing.</p>\n\n<p>Over the next year or so, we’re going to be investing resources in a number of key areas to enable JOSS to scale further, improve the experience for all parties, and help others reuse the infrastructure we’ve developed for JOSS. We’ve captured much of what we want to achieve in this <a href=\"https://github.com/openjournals/joss/blob/master/ROADMAP.md\">public roadmap</a>. All of this will be possible thanks to a new grant from the <a href=\"https://sloan.org\">Alfred P. Sloan Foundation</a>, some highlights include:</p>\n\n<p><strong>Smarter reviewer assignment and management:</strong> Finding reviewers for a JOSS submission is still one of the most time-intensive aspects of the JOSS editorial process (though a large fraction of those we ask to review tend to accept, as they are excited by our mission). We think there’s lots of opportunity for substantially improving the success rate of finding potential reviewers through automation. Making sure we’re not overloading our best reviewers will also be an important aspect of this work.</p>\n\n<p><strong>A major refactor of our editorial bot Whedon:</strong> Whedon is a critical part of our infrastructure but has become hard to maintain, and almost impossible for other projects to reuse. We’re planning to rework Whedon into a <a href=\"https://github.com/openjournals/buffy\">general framework</a> with a set of reusable modules for common editorial tasks.</p>\n\n<p><strong>Investments in open source:</strong> JOSS relies upon a small number of open source projects such as Pandoc and pandoc-citeproc to produce scholarly manuscripts (PDFs) and metadata outputs (e.g., Crossref and JATS). We’re going to work with the Pandoc core team to generalize some of the work we’ve done for JOSS into Pandoc core.</p>\n\n<p>For many of us on the editorial team JOSS is a labor of love, and it has been quite a ride growing JOSS from an experimental new journal to a venue that is publishing more close to 500 papers per year. For those of you who have helped us on this journey by submitting a paper to JOSS or <a href=\"https://joss.theoj.org/reviewer-signup.html\">volunteering to review</a>, <em>thank you</em> ⚡🚀💥.</p>\n\n<p><em>The JOSS editorial team.</em></p>\n\n<div class=\"footnotes\" role=\"doc-endnotes\">\n  <ol>\n    <li id=\"fn:1\" role=\"doc-endnote\">\n      <p>For example: <a href=\"https://doi.org/10.12688/f1000research.11407.1\">https://doi.org/10.12688/f1000research.11407.1</a> · <a href=\"https://doi.org/10.1109/MS.2020.2973362\">https://doi.org/10.1109/MS.2020.2973362</a> · <a href=\"http://doi.org/10.5334/jors.242\">http://doi.org/10.5334/jors.242</a> <a href=\"#fnref:1\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>\n    </li>\n    <li id=\"fn:2\" role=\"doc-endnote\">\n      <p>Something hardly any other journals do. <a href=\"#fnref:2\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>\n    </li>\n    <li id=\"fn:3\" role=\"doc-endnote\">\n      <p>The JOSS review structure was originally derived from the process developed by the <a href=\"https://ropensci.org\">rOpenSci</a> community for their software review. <a href=\"#fnref:3\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>\n    </li>\n  </ol>\n</div>"},{"id":"https://blog.joss.theoj.org/2020/07/minimum-publishable-unit","title":"Minimum publishable unit","link":"https://blog.joss.theoj.org/2020/07/minimum-publishable-unit","published":"Tue, 07 Jul 2020 00:00:00 +0000","description":"tl;dr – JOSS is introducing new submission criteria whereby submissions under 1000 lines of code will automatically be flagged as potentially being out of scope, and those under 300 lines desk-rejected. This...","isPermalink":false,"tags":["announcements"],"authors":[{"name":null,"url":null}],"image":null,"modified":null,"contentHtml":"<blockquote>\n  <p>tl;dr – JOSS is introducing new submission criteria whereby submissions under 1000 lines of code will automatically be flagged as potentially being out of scope, and those under 300 lines desk-rejected. This blog post describes some of the motivations behind this decision.</p>\n</blockquote>\n\n<p>Sometime in 2020, JOSS will publish its 1000<sup>th</sup> paper – an incredible achievement by a volunteer team of editors and reviewers.</p>\n\n<p>Since its inception a little over four years ago, the primary goal of JOSS has always been to provide credit for authors of research software. Quoting from the <a href=\"https://www.arfon.org/announcing-the-journal-of-open-source-software\">original blog post</a> announcing JOSS:</p>\n\n<blockquote>\n  <p>The primary purpose of a JOSS paper is to enable citation credit to be given to authors of research software.</p>\n</blockquote>\n\n<p>One challenge we’ve always struggled with as an editorial team is defining clear guidelines for submissions allowed (and not allowed) in JOSS. Our current submission criteria are <a href=\"https://joss.readthedocs.io/en/latest/submitting.html\">available online</a> and include language about software having to be a <em>significant contribution</em>, <em>feature complete</em>, and having an <em>obvious research application</em>. In these criteria we also explicitly exclude a category of software we generally call “minor utilities”.</p>\n\n<h3 id=\"the-challenge-of-defining-a-unit-of-publication-credit\">The challenge of defining a unit of publication credit</h3>\n\n<p>We think of JOSS essentially granting “1 publication credit” for each software package that is reviewed and published in the journal. In empirical research, a publication is often the result of years of work. In engineering research, rarely does a paper represent less than one year of work. Other fields may vary, but let’s say that a scientific paper resulting from work measured in just months is rare or exceptional.</p>\n\n<p>Since the earliest days of the journal, there has been a range of views within the editorial team on what level of effort we should require from authors for a submission to be allowed in JOSS – some JOSS editors feeling that every useful piece of software should be considered, others believing that the “bar” for publishing in JOSS should be higher than it currently is.</p>\n\n<h3 id=\"building-trust-in-joss\">Building trust in JOSS</h3>\n\n<p>As an editorial team we want JOSS papers to count the same as any other publication in the CV of researchers who write software. With career credit the <a href=\"https://www.arfon.org/announcing-the-journal-of-open-source-software\">stated primary reason</a> for starting JOSS, if this isn’t true then the mission of the journal is at risk.</p>\n\n<p>In reality this means that our editorial policy requires us to balance two competing needs:</p>\n\n<ol>\n  <li>Providing an excellent service to authors by offering peer-review of their software and the opportunity to receive career credit for their work.</li>\n  <li>Building the trust of an existing academic culture to accept a JOSS paper as equal to any peer-reviewed journal paper.</li>\n</ol>\n\n<p>These two aspects are in tension with each other because while we would dearly love to publish <em>any and all</em> research software in JOSS regardless of size/scale and level of effort to implement, part of building and maintaining that trust with the community relies on us ensuring that our published authors can continue to expect JOSS papers to “count” in their future merit reviews and promotions.</p>\n\n<h3 id=\"updates-to-our-submission-requirements-and-scope-checking-procedures\">Updates to our submission requirements and scope-checking procedures</h3>\n\n<p>Over the past couple of years, as the number of submissions to JOSS has grown, we’ve found that our existing <a href=\"https://joss.readthedocs.io/en/latest/submitting.html\">submission criteria</a> and <a href=\"https://joss.readthedocs.io/en/latest/editing.html#rejecting-a-paper\">protocol for rejecting papers as out of scope</a> have been taking a significant fraction of our editorial team time. With a volunteer team of editors, it’s essential that we use their time carefully and an update to our procedures for handling scope assessments is long overdue.</p>\n\n<p>Going forward we’re going to adopt the following new process:</p>\n\n<p><strong>Automatically flagging small submissions</strong></p>\n\n<p>As part of the <a href=\"https://github.com/openjournals/joss-reviews/issues?q=is%3Aissue+is%3Aopen+label%3Apre-review\"><code class=\"language-plaintext highlighter-rouge\">pre-review</code></a> process, incoming submissions that are under 1000 lines of code<sup id=\"fnref:1\" role=\"doc-noteref\"><a href=\"#fn:1\" class=\"footnote\" rel=\"footnote\">1</a></sup> (LOC) will be automatically flagged as potentially out of scope by the EiC on rotation.</p>\n\n<p>Submissions under 300 lines<sup id=\"fnref:2\" role=\"doc-noteref\"><a href=\"#fn:2\" class=\"footnote\" rel=\"footnote\">2</a></sup> of code will be desk rejected with no further review.</p>\n\n<p><strong>Mandatory “Statement of need” section in JOSS papers</strong></p>\n\n<p>While this has always been preferred, a clear <em>Statement of need</em> section in the JOSS paper is usually extremely valuable in helping the editorial team understand the rationale for the development of the software.</p>\n\n<p><strong>Gauging the scholarly content of the software as part of the review</strong></p>\n\n<p>Reviewers will be asked if the software under review is a <a href=\"https://joss.readthedocs.io/en/latest/submitting.html#substantial-scholarly-effort\">“substantial scholarly effort”</a> and guidelines will be provided on how they can make that assessment.</p>\n\n<p><strong>A streamlined editorial review process</strong></p>\n\n<p>Rather than each paper that is potentially out-of-scope being discussed in a separate thread on our editorial mailing list, JOSS is going to move to a weekly review of such papers by our editorial team. Topic editors will be asked to review papers flagged as potentially out of scope in their area and help the EiC team make a decision.</p>\n\n<p><em>Arfon M. Smith on behalf of the JOSS editorial team</em></p>\n\n<div class=\"footnotes\" role=\"doc-endnotes\">\n  <ol>\n    <li id=\"fn:1\" role=\"doc-endnote\">\n      <p>In a high-level language such as Python or R. More verbose languages such as Java, C++, Fortran etc. will require more LOC. <a href=\"#fnref:1\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>\n    </li>\n    <li id=\"fn:2\" role=\"doc-endnote\">\n      <p>We realize that introducing numerical thresholds may encourage some authors to unnecessarily “pad” their submissions with additional lines of code to meet our thresholds. As reviewers are already asked to judge the standard of the implementation as part of their review we expect that situations like these will usually be flagged during the review. <a href=\"#fnref:2\" class=\"reversefootnote\" role=\"doc-backlink\">&#8617;</a></p>\n    </li>\n  </ol>\n</div>"},{"id":"https://blog.joss.theoj.org/2020/05/reopening-joss","title":"Reopening JOSS","link":"https://blog.joss.theoj.org/2020/05/reopening-joss","published":"Mon, 18 May 2020 00:00:00 +0000","description":"On March 12th of this year, we suspended new submissions to JOSS in order to reduce the load on our volunteer team of editors and reviewers. We revisited this suspension in early April and decided to continue...","isPermalink":false,"tags":["announcements"],"authors":[{"name":null,"url":null}],"image":null,"modified":null,"contentHtml":"<p>On March 12th of this year, we suspended new submissions to JOSS in order to reduce the load on our volunteer team of editors and reviewers. We revisited this suspension in early April and decided to continue the pause on new submissions for at least another month. Over the past two weeks, we’ve been reviewing our current status and discussing what it might look like to reopen JOSS.</p>\n\n<p>After collecting inputs from the whole JOSS editorial team about their respective availabilities and discussing what to do next <strong>we’ve decided to reopen JOSS in a “reduced service mode” from May 20th, 2020</strong>.</p>\n\n<h3 id=\"reduced-service-mode\">Reduced service mode</h3>\n\n<p>So what does a “reduced service mode” mean exactly? Essentially this is about adjusting our editorial processes to give authors, editors, and reviewers more time to carry out their activities during the JOSS review process.</p>\n\n<p>We expect that JOSS will be operating in this mode for the foreseeable future with the following new editorial processes:</p>\n\n<p><strong>Revised (extended) review time:</strong> Before the suspension, we encouraged reviewers to complete their reviews in two weeks. In this reduced service mode, we’re asking that reviewers try to complete their reviews in six weeks. Reviewers are of course welcome to complete their reviews faster than this and given the iterative nature of JOSS reviews we still encourage everyone to start their review as soon as possible.</p>\n\n<p><strong>Reduced paper throughput:</strong> As we reopen JOSS, we plan to limit the number of incoming submissions that will be assigned to a handling editor (and therefore go out for review). In these first few weeks we’re planning on a limit of five papers per week, with papers after this held in a first come, first served <code class=\"language-plaintext highlighter-rouge\">waitlist</code> pre-review issue on GitHub.</p>\n\n<p><strong>Re-assign the submissions with unavailable editors:</strong> A small number of our editors are currently completely unable to edit due to other commitments. As we reopen JOSS, those papers will be reassigned to a new handling editor.</p>\n\n<p><strong>Growing our editorial team:</strong> Back on February, we issued a <a href=\"https://blog.joss.theoj.org/2020/02/call-for-editors\">call for new editors</a> which received an excellent response. Over the coming weeks we will begin on-boarding new editors to help grow the capacity of JOSS.</p>\n\n<h3 id=\"what-this-means-for-joss\">What this means for JOSS</h3>\n\n<p>During the pause on submissions, we’ve managed to publish 37 papers from the existing backlog which is an amazing feat in itself 💖. Since instigating the pause however, activity across all of JOSS had been markedly reduced.</p>\n\n<p><img src=\"https://user-images.githubusercontent.com/4483/82119417-62da3e00-974c-11ea-91a5-a9b3efa3e6a6.png\" alt=\"\" /></p>\n\n<p>JOSS relies upon editors and reviewers volunteering their time to help authors improve their research software in an iterative, open review process. For many of us, JOSS is a labor of love, and an opportunity to give back to the communities we work in.</p>\n\n<p>While we can never know exactly how the COVID-19 pandemic is affecting every JOSS author, editor, and reviewer, we hope that with these changes to our editorial processes we have found the right balance between accommodating the very real challenges many of us now face in our daily lives, and providing a service to the research software community.</p>\n\n<p><em>Arfon M. Smith on behalf of the JOSS editorial team</em></p>"},{"id":"https://blog.joss.theoj.org/2020/02/call-for-editors","title":"Call for editors","link":"https://blog.joss.theoj.org/2020/02/call-for-editors","published":"Mon, 10 Feb 2020 00:00:00 +0000","description":"Once again we’re looking to grow our editorial team at JOSS. We’re especially interested in recruiting editors with expertise in bioinformatics, material science, physics, R/statistics, and the social...","isPermalink":false,"tags":["announcements"],"authors":[{"name":null,"url":null}],"image":null,"modified":null,"contentHtml":"<p>Once again we’re looking to grow our editorial team at JOSS. We’re especially interested in recruiting editors with expertise in bioinformatics, material science, physics, R/statistics, and the social sciences.</p>\n\n<p>Since our launch in <a href=\"https://www.arfon.org/announcing-the-journal-of-open-source-software\">May 2016</a>, our <a href=\"http://joss.theoj.org/about#editorial_board\">existing editorial team</a> has handled over 800 submissions (830 published at the time of writing, 119 under review) and the demand from the community continues to grow. The last three months have been our busiest yet, with JOSS publishing a little over one paper per day, and we see no sign of this demand dropping.</p>\n\n<p>New editors at JOSS are asked to make a minimum 1-year commitment, with additional years possible by mutual consent. As some of our existing editorial team are reaching the end of their term with JOSS, the time is right to bring on another cohort of editors.</p>\n\n<h3 id=\"background-on-joss\">Background on JOSS</h3>\n\n<p>If you think you might be interested, take a look at our <a href=\"https://joss.readthedocs.io/en/latest/editing.html\">editorial guide</a>, which describes the editorial workflow at JOSS, and also some of the reviews for <a href=\"https://github.com/openjournals/joss-reviews/issues?utf8=%E2%9C%93&amp;q=is%3Aclosed+label%3Aaccepted+\">recently accepted papers</a>. Between these two, you should be able to get a good overview of what editing for JOSS looks like.</p>\n\n<p>Further background about JOSS can be found in our <a href=\"https://peerj.com/articles/cs-147/\">PeerJ CS paper</a>, which summarizes our first year, and our Editor-in-Chief’s <a href=\"https://www.arfon.org/announcing-the-journal-of-open-source-software\">original blog post</a>, which announced the journal and describes some of our core motivations for starting the journal.</p>\n\n<p>More recently we’ve also written in detail about <a href=\"https://blog.joss.theoj.org/2019/06/cost-models-for-running-an-online-open-journal\">the costs related with running JOSS</a>, <a href=\"https://blog.joss.theoj.org/2019/07/scaling\">scaling our editorial processes</a>, and <a href=\"https://www.youtube.com/watch?v=niRiyaErqwQ\">talked about the collaborative peer review that JOSS promotes</a>.</p>\n\n<h2 id=\"how-to-apply\">How to apply</h2>\n\n<p>Firstly, we especially welcome applications from prospective editors who will contribute to the diversity (ethnic, gender, disciplinary, and geographical) of our board.</p>\n\n<p>✨✨✨ If you’re interested in applying please fill in this <a href=\"https://forms.gle/JhHQWbnJCkPrnEeG6\">short form</a> by 4th March 2020. ✨✨✨</p>\n\n<h2 id=\"who-can-apply\">Who can apply</h2>\n\n<p>We welcome applications from potential editors with significant experience in one or more of the following areas: open source software, open science, software engineering, peer-review, noting again that editors with expertise in bioinformatics, material science, physics, R/statistics, and the social science are most neded.</p>\n\n<p>The JOSS editorial team has a diverse background and there is no requirement for JOSS editors to be working in academia. Unfortunately individuals enrolled in a PhD program are not eligible to serve on the JOSS editorial team.</p>\n\n<h3 id=\"selection-process\">Selection process</h3>\n\n<p>The <a href=\"http://joss.theoj.org/about#editorial_board\">JOSS editorial team</a> will review your applications and make their recommendations. Highly-ranked candidates will then have a short (~30 minute) phone call/video conference interview with the editor(s)-in-chief. Successful candidates will then join the JOSS editorial team for a probational period of 3 months before becoming a full member of the editorial team. You will get an onboarding “buddy” from the experienced editors to help you out during that time.</p>\n\n<p><em>Lorena A. Barba, Daniel S. Katz, Kevin M. Moerman, Kyle E. Niemeyer, Kristen Thyng, Arfon M. Smith</em></p>"},{"id":"https://blog.joss.theoj.org/2019/11/new-editors-in-2019","title":"New editors in 2019","link":"https://blog.joss.theoj.org/2019/11/new-editors-in-2019","published":"Thu, 07 Nov 2019 00:00:00 +0000","description":"2019 has been a big year for JOSS: This year, we’ve already published 300 papers and are on target to reach ~360 papers by the end of the calendar year. We’ve substantially improved our website and made a...","isPermalink":false,"tags":["announcements"],"authors":[{"name":null,"url":null}],"image":null,"modified":null,"contentHtml":"<p>2019 has been a big year for JOSS: This year, we’ve already published 300 papers and are on target to reach ~360 papers by the end of the calendar year. We’ve substantially improved <a href=\"https://joss.theoj.org\">our website</a> and made a number of important changes to our editorial team to help us scale further.</p>\n\n<p>In the last 12 months we’ve issued two calls for new editors (one in <a href=\"https://blog.joss.theoj.org/2018/12/call-for-editors\">December 2018</a> and one in <a href=\"https://blog.joss.theoj.org/2019/08/call-for-editors\">August 2019</a>), and we’ve not done a very good job of announcing when new editors join the team so let’s fix that…</p>\n\n<h2 id=\"two-new-associate-editors-in-chief\">Two new associate editors in chief</h2>\n\n<p>In the last few months, we’ve added two associate-editors-in-chief with <a href=\"https://kevinmoerman.org/\">Kevin M. Moerman</a> and <a href=\"http://kristenthyng.com/\">Kristen Thyng</a> stepping into these new roles ⚡.</p>\n\n<h2 id=\"new-editors-joining-the-joss-team\">New editors joining the JOSS team</h2>\n\n<p>Twenty one(!) new editors have joined the JOSS editorial team thus far in 2019. Ordered by the date they joined they are:</p>\n\n<p><a href=\"https://www.lri.fr/~pons/en/\"><strong>Viviane Pons</strong></a>: <em>Mathematics, Computer Science</em><br />\nAssociate professor at Université Paris-Sud. Mathematician, computer scientist and strong defender of open-source and open science in general. Contributor and user of the SageMath software. Member of the OpenDreamKit European project for open-source development in Mathematics.</p>\n\n<p><a href=\"https://hodgestar.com/\"><strong>Jack Poulson</strong></a>: <em>Numerical optimization, numerical linear algebra, PDEs, high-performance computing, lattice reduction</em><br />\nIndependent computational scientist running Tech Inquiry and Hodge Star Scientific Computing. Previously, research scientist at Google and assistant professor of mathematics at Stanford. His research interests: software engineering of high-performance mathematical libraries (e.g., conic optimization, lattice reduction, determinantal point processes, numerical PDEs), their connections to pure mathematics (e.g., differential geometry, conic analysis, representation theory).</p>\n\n<p><a href=\"https://luc.edu/cs/people/ftfaculty/gkt.shtml\"><strong>George K. Thiruvathukal</strong></a>: <em>HPC, software engineering, programming languages, systems, computational science, digital humanities</em><br />\nProfessor of computer science at Loyola University, Chicago, and visiting faculty at the Argonne National Laboratory Leadership Computing Facility. Research interests: high-performance &amp; distributed computing, cyber-physical systems, software engineering, programming languages and systems, history of computing, computational and data science, computing education, and ethical/legal/social issues in computing. Past editor-in-chief of IEEE Computing in Science and Engineering.</p>\n\n<p><a href=\"https://lpantano.github.io/\"><strong>Lorena Pantano</strong></a>: <em>Small RNAseq, RNAseq, miRNA, isomiRs, visualization, genomics, transcriptomic, non-codingRNA, data integration</em><br />\nResearch scientist at Harvard T.H. Chan School of Public Health. Focused on genomic regulation and data integration, with more than a decade of experience in biological data analysis and contributing to novel algorithms to improve the quantification and visualization of genomic data.</p>\n\n<p><a href=\"http://juanjobazan.com/\"><strong>Juanjo Bazán</strong></a>: <em>Astrophysics, Mathematics</em><br />\nAstrophysics researcher at CIEMAT, mathematician and software engineer currently developing chemical evolution models for galaxies. Juanjo has worked as advisor on open source policies and contributed code to many popular libraries like Rails and Astropy. He is member of the founder team of Consul, the most widely used open sourced citizen participation software.</p>\n\n<p><a href=\"https://www.ornl.gov/staff-profile/bruce-e-wilson\"><strong>Bruce E. Wilson</strong></a>: <em>Ecology, remote sensing, information sciences, material sciences</em><br />\nManager for the Oak Ridge National Laboratory Distributed Active Archive Center for Biogeochemical Dynamics (ORNL DAAC) and Adjunct Professor of Information Sciences at the University of Tennessee, Knoxville. Originally trained as a chemist and statistician. Spent a few years as an Enterprise Architect. Research interests in citations, linked data, reproducible science, identity, cybersecurity, data reuse, and long-term data preservation.</p>\n\n<p><a href=\"https://www.leouieda.com/\"><strong>Leonardo Uieda</strong></a>: <em>Geoscience, Geophysics, Data Visualization</em><br />\nGeophysicist researching methods for determining the inner structure of the Earth from geophysical observations, mainly disturbances in the Earth’s gravity and magnetic fields. Developer of open-source software for processing, modeling, and visualizing geophysical data. Currently Visiting Research Scholar at the University of Hawai’i at Mānoa working on Generic Mapping Tools.</p>\n\n<p><a href=\"http://alex-hanna.com/\"><strong>Alex Hanna</strong></a>: <em>Social sciences, politics</em><br />\nAlex Hanna is a computational social scientist working on machine learning curriculum at Google. She received her PhD in sociology from the University of Wisconsin-Madison. Her research has focused on how new and social media has changed social movement mobilization and political participation. More recently, she has been interested in issues of fairness, accountability, and transparency in sociotechnical systems.</p>\n\n<p><a href=\"http://csoneson.github.io/\"><strong>Charlotte Soneson</strong></a>: <em>Bioinformatics, data visualization, transcriptomics, reproducible research</em><br />\nResearch Associate at the Friedrich Miescher Institute for Biomedical Research in Basel, Switzerland, with a research background mainly in development and evaluation of analysis methods for transcriptomics data. Developer and maintainer of several open-source R packages for analysis, quality assessment and interactive visualization of high-throughput biological data.</p>\n\n<p><a href=\"http://stanford.edu/~mbobra\"><strong>Monica Bobra</strong></a>: <em>Heliophysics, Data Science</em><br />\nResearch scientist at Stanford University in the W. W. Hansen Experimental Physics Laboratory who studies the Sun and space weather as a member of the NASA Solar Dynamics Observatory science team and contributes to Heliopython and SunPy.</p>\n\n<p><a href=\"https://terrytangyuan.github.io/about/\"><strong>Yuan Tang</strong></a>: <em>Machine Learning, Distributed Systems, Cloud Computing</em><br />\nSenior software engineer at Ant Financial, building AI infrastructure and AutoML platform. He’s a committer of TensorFlow, XGBoost, and Apache MXNet, maintainer of several Kubeflow projects, and author of numerous open source software projects. He’s also the author of the best-selling book TensorFlow in Practice, which is the first book teaching TensorFlow in Chinese and has been translated to several other languages such as traditional Chinese and Korean.</p>\n\n<p><a href=\"http://oliviaguest.com/\"><strong>Olivia Guest</strong></a>: <em>Computational cognitive modeling, cognitive science, cognitive neuroscience</em><br />\nOlivia Guest is a computational modeler in cognitive science and neuroscience. She creates and evaluates computational accounts for categorization and conceptual representation in healthy adults, patient groups, infants, and animals. She is also interested in using computational modeling and data science broadly in theoretical as well as applied contexts.</p>\n\n<p><a href=\"http://marierognes.org/\"><strong>Marie E. Rognes</strong></a>: <em>Applied mathematics, PDEs, numerical methods, biomechanics</em><br />\nMarie E. Rognes is Chief Research Scientist at Simula Research Laboratory, Oslo, Norway. Her research focuses on numerical methods for partial differential equations, software for scientific computing, with applications in biomechanics and neuroscience. She is a core member of the FEniCS and Dolfin-adjoint Projects.</p>\n\n<p><a href=\"https://vknight.org/\"><strong>Vincent Knight</strong></a>: <em>Mathematics, Applied mathematics, Game Theory, Stochastic processes, Pedagogy, Python</em><br />\nVince is a mathematician at Cardiff University. He is a maintainer and contributor to a number of open source software packages and a contributor to the UK Python community. His research interests are in the field of game theory and stochastic processes and he also has a keen interest in pedagogy. Vince is a fellow of the Software Sustainability Institute and is interested in reproducibility and sustainability of scientific/mathematical research.</p>\n\n<p><a href=\"http://noddle.io/\"><strong>Matthew Sottile</strong></a>: <em>Computer science, programming languages, applied mathematics</em><br />\nResearch scientist working on program synthesis tools for high performance computing at Noddle.io, and adjunct faculty at the Washington State University Department of Mathematics and Statistics. His PhD work in computer engineering focused on measurement and analysis methods for performance analysis of high performance systems. He believes that open and reproducible research software artifacts are critical to the advancement of computational science.</p>\n\n<p><a href=\"https://orcid.org/0000-0001-5215-101X\"><strong>Mark A. Jensen</strong></a>: <em>Bioinformatics and Computational Biology, Cancer Genomics, Population and Evolutionary Biology, Databases and Data Architecture, Software Development Lifecycle Management</em><br />\nDirector of Data Management and Interoperability at the Frederick National Laboratory for Cancer Research, he leads efforts to design, build, and maintain scientist-friendly research data systems that integrate clinical and multiomic data across thousands of cancer patient-donors. He is active in open source software development and a supporter of the FAIR (Findable, Accessible, Interoperable, Reusable) movement in scientific data management. A molecular evolutionary biologist by training, he served as an Associate Editor for the Journal of Molecular Evolution from 2008-2013.</p>\n\n<p><a href=\"http://mtm.ufsc.br/~melissa\"><strong>Melissa Weber Mendonça</strong></a>: <em>Applied Math, Numerical Optimization, Numerical Linear Algebra, Fortran, Python, MATLAB, Julia, Teaching</em><br />\nApplied mathematician, working with numerical optimization and numerical linear algebra at the Federal University of Santa Catarina, in Brazil. Interested in open science, open research, and teaching practices in mathematics and computer science.</p>\n\n<p><a href=\"https://github.com/kbarnhart\"><strong>Katy Barnhart</strong></a>: <em>Geology, Geophysics, Earth Surface Dynamics, Terrain Analysis</em><br />\nResearch scientist in Earth surface dynamics at the University of Colorado Department of Geological Sciences and Cooperative Institute for Research in Environmental Sciences. Her research focuses on integrating observations, model development, and model analysis to understand the evolution of the Earth’s surface. She is a core developer of the Landlab toolkit.</p>\n\n<p><a href=\"http://willrowe.net/\"><strong>William Rowe</strong></a>: <em>Bioinformatics, genomics</em><br />\nBioinformatician working at the University of Birmingham, UK. Research areas include data sketching for genomics, variation graphs, and metagenome profiling. Currently working on long-read sequencing applications for real-time genomic epidemiology.</p>\n\n<p><a href=\"https://dfm.io/\"><strong>Dan Foreman-Mackey</strong></a>: <em>Astrophysics, probabilistic programming, data science, python</em><br />\nDan Foreman-Mackey is an Associate Research Scientist at the Flatiron Institute in the Center for Computational Astrophysics. His research program focuses on the development and application of probabilistic data analysis techniques to make novel discoveries and solve fundamental problems in astrophysics.</p>\n\n<p><a href=\"https://marcosvital.github.io/\"><strong>Marcos Vital</strong></a>: <em>R, biostatistics, data visualization, open science, quantitative ecology, evolutionary biology, conservation biology, teaching</em><br />\nBiologist, quantitative ecologist and open science enthusiast at Universidade Federal de Alagoas, Brazil, where he coordinates the Quantitative Ecology Lab. He is interested in a wide range of topics related to evolutionary ecology and conservation biology, but also in other fields such as active learning methods and digital games in education.</p>\n\n<h2 id=\"editors-retiring-from-the-team\">Editors retiring from the team</h2>\n\n<p>In 2019, a few of our editors have stepped down from editorial duties at JOSS: <a href=\"http://www.jasonclark.info/\">Jason Clark</a>, <a href=\"http://thebird.nl/\">Pjotr Prins</a>, and <a href=\"http://yo-yehudi.com/\">Yo Yehudi</a> have already retired from the JOSS editorial team and <a href=\"http://twitter.com/braincode\">Roman Valls Guimera</a>, <a href=\"http://gymreklab.com/\">Melissa Gymrek</a>, and <a href=\"http://lindseyjh.ca/\">Lindsey Heagy</a> will be retiring from the team soon. JOSS only works because of the volunteer efforts from our editors and reviewers and we’re deeply indebted to them 💖.</p>\n\n<p>We thanks Jason, Pj, Yo, Roman, Melissa, and Lindsey for all of their contributions to JOSS!</p>\n\n<p><em>Arfon Smith, Editor-in-Chief, Journal of Open Source Software.</em></p>"},{"id":"https://blog.joss.theoj.org/2019/08/call-for-editors","title":"Call for editors","link":"https://blog.joss.theoj.org/2019/08/call-for-editors","published":"Tue, 20 Aug 2019 00:00:00 +0000","description":"Following our call for editors late last year, once again we’re looking to grow our editorial team. Over the past ~40 months, our existing editorial team has handled close to 800 submissions (665 accepted at...","isPermalink":false,"tags":["announcements"],"authors":[{"name":null,"url":null}],"image":null,"modified":null,"contentHtml":"<p>Following our <a href=\"https://blog.joss.theoj.org/2018/12/call-for-editors\">call for editors</a> late last year, once again we’re looking to grow our editorial team.</p>\n\n<p>Over the past ~40 months, our <a href=\"http://joss.theoj.org/about#editorial_board\">existing editorial team</a> has handled close to 800 submissions (665 accepted at the time of writing, 101 under review) and the demand from the community continues to grow. The last three months have been our busiest yet, with JOSS publishing a little over one paper every day, and we see no sign of this demand dropping.</p>\n\n<p>In order for JOSS to be able to continues to thrive, we think the time is right to bring on another cohort of editors.</p>\n\n<h3 id=\"background-on-joss\">Background on JOSS</h3>\n\n<p>If you think you might be interested, take a look at our <a href=\"https://joss.readthedocs.io/en/latest/editing.html\">editorial guide</a> which describes the editorial workflow at JOSS and also some of the reviews for <a href=\"https://github.com/openjournals/joss-reviews/issues?utf8=%E2%9C%93&amp;q=is%3Aclosed+label%3Aaccepted+\">recently accepted papers</a>. Between these two, you should be able to get a good overview of what editing for JOSS looks like.</p>\n\n<p>Further background about JOSS can be found in our <a href=\"https://peerj.com/articles/cs-147/\">PeerJ paper</a> which summarizes our first year and our Editor-in-Chief’s <a href=\"http://arfon.org/announcing-the-journal-of-open-source-software/index.html\">original blog post</a> announcing the journal describes some of the core motivations for starting the journal.</p>\n\n<p>More recently we’ve also written in detail about <a href=\"https://blog.joss.theoj.org/2019/06/cost-models-for-running-an-online-open-journal\">the costs related with running JOSS</a> and <a href=\"https://blog.joss.theoj.org/2019/07/scaling\">scaling our editorial processes</a>.</p>\n\n<h2 id=\"how-to-apply\">How to apply</h2>\n\n<p>Firstly, we especially welcome applications from prospective editors who will contribute to the diversity (ethnic, gender, and geographical) of our board.</p>\n\n<p>We’re especially interested in growing our editorial team in the following subject areas although all are welcome to apply:</p>\n\n<ul>\n  <li>Applied mathematics</li>\n  <li>Bioinformatics</li>\n  <li>Computational chemistry</li>\n  <li>Ecology</li>\n  <li>Geoscience/earth sciences</li>\n  <li>Material science</li>\n  <li>R/stats</li>\n</ul>\n\n<p>✨✨✨ If you’re interested in applying please fill in this <a href=\"https://forms.gle/RtqeU7z9tq8LaiEz9\">short form</a> by 4th September 2019. ✨✨✨</p>\n\n<h3 id=\"selection-process\">Selection process</h3>\n\n<p>The <a href=\"http://joss.theoj.org/about#editorial_board\">JOSS editorial team</a> will review your applications and make their recommendations. Candidates ranking highly will then have a short (~30 minute) phone call/video conference interview with the editor-in-chief(s). Successful candidates will then join the JOSS editorial team for a probational period of 3 months before becoming a full member of the editorial team. You will get an onboarding “buddy” from the experienced editors to help you out during that time.</p>\n\n<p><em>Lorena A. Barba, Daniel S. Katz, Kyle E. Niemeyer, Arfon M. Smith</em></p>"}]}