{"version":"https://jsonfeed.org/version/1.1","id":"4425y27","title":"Technology and language","description":"by Angus Grieve-Smith","language":"en-US","license":"https://creativecommons.org/licenses/by/4.0/legalcode","category":"Social Sciences","homePageUrl":"https://grieve-smith.com/blog","feedUrl":"https://grieve-smith.com/blog/feed/","favicon":null,"generator":"https://wordpress.org/?v=6.1.1","items":[{"id":"https://grieve-smith.com/blog/?p=1442","title":"That is not your voice","link":"https://grieve-smith.com/blog/2022/12/that-is-not-your-voice/","published":"Sun, 25 Dec 2022 06:23:41 +0000","description":"This is the fifth post in a series inspired by Lake Bell&#8217;s audiobook chapter &#8220;Sexy Baby Voice.&#8221; In previous posts I&#8217;ve covered the three key features she uses to define this vocal...","isPermalink":false,"tags":["Language politics","Phonetics","Sexy Baby Voice","Variation"],"authors":[{"name":"grvsmth","url":null}],"image":null,"modified":null,"contentHtml":"<p>This is the fifth post in a series inspired by Lake Bell&#8217;s audiobook chapter &#8220;<a href=\"https://omny.fm/shows/revisionist-history/from-inside-voice-lake-bell-and-the-sexy-baby-voic\" rel=\"noopener\" target=\"_blank\">Sexy Baby Voice</a>.&#8221;  In previous posts I&#8217;ve covered the three key features she uses to define this vocal style &#8211; <a href=\"https://grieve-smith.com/blog/2022/11/listen-to-the-voices-of-the-sexy-babies/\">bright resonance</a> (which Bell refers to as &#8220;high pitch&#8221;), <a href=\"https://grieve-smith.com/blog/2022/12/youth-authority-gender-and-creaky-voice/\">creaky voice</a> (&#8220;vocal fry&#8221;) and <a href=\"https://grieve-smith.com/blog/2022/12/slurring-sexy-babies/\">legato articulation</a> (&#8220;slurring&#8221;), and discussed the various ways that <a href=\"https://grieve-smith.com/blog/2022/12/controlling-the-brightness-of-the-voice/\">we can manipulate our vocal tract</a>s to create or amplify bright or dark resonances.  Now I want to talk about your voice.</p>\n<p>Not <em>your</em> voice, but what people mean when they say &#8220;your voice.&#8221;  A friend who&#8217;s a vocal coach and read my earlier posts sent me <a href=\"https://www.youtube.com/watch?v=EPYPkfCRO0U\" rel=\"noopener\" target=\"_blank\">a not-very-funny opening scene</a> from a sitcom called <em>Loudermilk</em>, where the title character (played by Ron Livingstone of <em>Office Space</em>) mocks and insults a young woman who takes his order at a coffee bar.  The salesclerk is friendly, prompt and thorough; Loudermilk has no cause for complaint.  His abuse is entirely based on his dislike for the sound of her voice.</p>\n<p>Anyone who&#8217;s read this series or listened to the &#8220;Sexy Baby Voice&#8221; chapter will recognize three particular features of salesclerk&#8217;s voice: bright resonance, creaky voice, legato articulation.  The Loudermilk scene could have been inspired by the scenes about &#8220;sexy baby voice&#8221; in Lake Bell&#8217;s 2013 film about the voice-over industry, <em>In a World&#8230;</em></p>\n<p>Loudermilk mocks the salesclerk&#8217;s creaky voice by using creaky voice in his own responses, and the salesclerk asks &#8220;why are you talking like that?&#8221;  Loudermilk responds, &#8220;This is my voice,&#8221; and she says, &#8220;No, it&#8217;s not.&#8221;  After mocking her voice more and ranting a bit, he says, &#8220;just stop doing that.&#8221;  Her response mirrors the earlier exchange: &#8220;I can&#8217;t help it, this is my voice,&#8221; to which he responds, &#8220;No, it&#8217;s not.&#8221;</p>\n<p>As Loudermilk receives his coffee and leaves, the salesclerk, infuriated by his abuse, shouts at his back, &#8220;You&#8217;re a total dick!&#8221;  Surprise!  She doesn&#8217;t use legato articulation or creaky voice &#8211; because it&#8217;s really fucking hard to shout with either of those features.  He turns back and says, &#8220;There, there you go, you&#8217;re talking!&#8221; as though she&#8217;d proven his point.</p>\n<p>Loudermilk&#8217;s insistence that the salesclerk&#8217;s use of creaky voice is not &#8220;your voice&#8221; echoes a deleted scene from <em>In a World&#8230;</em> that Lake Bell includes in the audiobook chapter.  In the scene, Bell&#8217;s character conducts &#8220;a vocal experiment&#8221; on another character who habitually uses &#8220;sexy baby voice.&#8221;  She asks the other character to count to ten, alternating &#8220;the lowest point in your register&#8221; (i.e. with dark resonance) on odd numbers with &#8220;the highest point in your register&#8221; (bright resonance) on even numbers, and then say &#8220;Here&#8217;s my voice.&#8221;</p>\n<p>Of course, &#8220;Here&#8217;s my voice&#8221; is the eleventh utterance in the sequence.  As an odd-numbered utterance, Bell&#8217;s character pronounces it with relatively dark resonance, and the other character follows suit.  As with the Loudermilk scene, we&#8217;re meant to marvel at the transformation: this woman&#8217;s True Voice, stripped of all that sexy baby junk!  The message of both scenes is the same: that &#8220;sexy baby voice&#8221; is fake and women only use it because they&#8217;re insecure, but maybe they can be tricked into experiencing the power of their True Voices.</p>\n<p>I don&#8217;t know about you, but when I first heard the deleted scene with the &#8220;vocal experiment,&#8221; the first thing I thought of was Elizabeth Holmes, the business executive who is currently in prison for selling a fake technology to investors.  In addition to amassing wealth and power through lies and hype, Holmes is famous for having an unusually low voice for a woman &#8211; not just dark resonances, but when she speaks publicly, her fundamental frequency is in the range more typically used by American men.</p>\n<p>During the height of Holmes&#8217;s success, several people felt that her claims were too good to be true, and they suspected her voice of being fake too.  When recordings surfaced of <a href=\"https://www.youtube.com/watch?v=ymXePUOTnOs\" rel=\"noopener\" target=\"_blank\">Holmes speaking in a more typical pitch range for an American woman</a>, that was presented as casting doubt on her honesty in general.  Is her voice as big a fraud as her company?</p>\n<p>I&#8217;ll have more to say about the notion of &#8220;your voice&#8221; and what it means to accuse someone of habitually using a fake voice, but astute observers may note that this double bind &#8211; don&#8217;t talk too &#8220;high-pitched,&#8221; but don&#8217;t talk too low-pitched either! &#8211; is an echo to the double-binds put on women in all kinds of areas &#8211; be assertive but not bossy! be attractive but not slutty!</p>\n"},{"id":"https://grieve-smith.com/blog/?p=1436","title":"Slurring sexy babies","link":"https://grieve-smith.com/blog/2022/12/slurring-sexy-babies/","published":"Sat, 17 Dec 2022 04:26:30 +0000","description":"Recently I&#8217;ve written a few posts in response to the notion of &#8220;sexy baby voice&#8221; in Lake Bell&#8217;s latest audiobook. Bell identifies &#8220;sexy baby voice&#8221; with three...","isPermalink":false,"tags":["Language politics","Phonetics","Sexy Baby Voice","Variation"],"authors":[{"name":"grvsmth","url":null}],"image":null,"modified":null,"contentHtml":"<p>Recently I&#8217;ve written a few posts in response to the notion of &#8220;sexy baby voice&#8221; in Lake Bell&#8217;s latest audiobook.  Bell identifies &#8220;sexy baby voice&#8221; with three characteristic features: &#8220;high pitch&#8221; (which I argue <a href=\"https://grieve-smith.com/blog/2022/11/listen-to-the-voices-of-the-sexy-babies/\">is actually bright resonance</a>), &#8220;vocal fry&#8221; (what phoneticians call creaky voice) and &#8220;slurring.&#8221;  I&#8217;ve argued that while bright resonance <a href=\"https://grieve-smith.com/blog/2022/12/controlling-the-brightness-of-the-voice/\">can be controlled to some degree</a>, it is <a href=\"https://grieve-smith.com/blog/2022/12/youth-authority-gender-and-creaky-voice/\">characteristic of youth and femininity</a>, and that creaky voice is the only way that some young woman can add darker resonance (and hence a bit of gravitas) without sounding tomboyish or fussy.</p>\n<p>I wanted to write a quick post about Bell&#8217;s third criterion, &#8220;slurring,&#8221; which Gladwell summaries as &#8220;running some words together,&#8221; and &#8220;sentences without spaces.&#8221;  Bell&#8217;s caricature of slurring gets to the point where she sounds like she&#8217;s doing an impression of a drunk sorority girl, but in moderation this is a well-documented pattern of speech variation: some people are noted for short, quick transitions from one speech segment to the next and from one intonational pitch to the next, known as &#8220;staccato&#8221; articulation, while others take these transitions more gradually, designated by the Italian word &#8220;legato.&#8221;</p>\n<p>Guess what the legato vs. staccato articulation patterns are associated with?  Gender.  I learned it from my voice teachers, Kristy Bissell and Erin Carney, as part of lessons on developing gender expression in the voice.  I&#8217;m not familiar with research on this in phonetics, if any has been done.</p>\n<p>Basically, staccato articulation is stereotypically associated with men barking orders, while legato articulation is associated with women discussing things in soft, flowing ways.  Yes, these are stereotypes, and we can all think of women who bark orders and men with soft, legato articulation.  But those women are perceived as acting masculine when they speak with staccato articulation, and men speaking legato are perceived as speaking in feminine ways.</p>\n<p>It&#8217;s understandable why the use of legato articulation bothers Lake Bell so much: it&#8217;s the antithesis of a particular voice-over style that she admires.  In her chapter she includes an audio clip of a film she made in 2013, In a World&#8230;  Before listening to this chapter I had never heard of her or the film, but I discovered that it was seen by a fairly large number of people, and generally well appreciated.  That film introduced the general public to her idea of &#8220;sexy baby voice,&#8221; and was discussed by Mark Liberman in a series of LanguageLog posts.</p>\n<p>The name of the film references the famous phrase &#8220;In a world&#8230;&#8221; used in voice-over tracks to introduce trailers for science-fiction action films.  In the film, Bell&#8217;s character is competing to be the first woman to voice these kinds of macho trailers.  The thesis of the film is that women are just as capable as men of delivering this punchy, aggressive style of speech, and are being held back from that success by what else?  &#8220;Sexy baby voice.&#8221;</p>\n<p>Even without going to the hypermasculine extent of action film voice-overs, Bell is implicitly endorsing the management-consultant approach to voice and gender that treats any bias against women&#8217;s speech as evidence of a deficiency in the women&#8217;s speech itself, a deficiency that can be remedied with enough courses in proper speaking.  This is extensively debunked by linguists like Deborah Cameron and Lisa Davidson in articles that I linked from previous posts.</p>\n<p>So there we have the three features of &#8220;sexy baby voice&#8221;: bright resonance, which is an indicator of youth and femininity; creaky voice, which is one of a handful of strategies available to young women to darken their resonance, and legato articulation, which is also an indicator of femininity.  If we find this in women who are actually young, it basically means that they want to get away from girlish voices without sounding like tomboys or fussy older women.  Judging young women for this strikes me as unfair and mean-spirited.</p>\n<p>I have to point out, however, that young women are not the main target of Bell&#8217;s &#8220;sexy baby voice&#8221; tirades.  Her ire is directed at older women who, she argues, have other ways of accessing dark resonance but use bright resonance with creaky voice anyway.  I&#8217;ll address that in another post!</p>\n"},{"id":"https://grieve-smith.com/blog/?p=1426","title":"Youth, authority, gender and creaky voice","link":"https://grieve-smith.com/blog/2022/12/youth-authority-gender-and-creaky-voice/","published":"Sat, 10 Dec 2022 04:00:15 +0000","description":"Recently I&#8217;ve written two posts about bright resonance in response to Lake Bell&#8217;s audiobook chapter, &#8220;Sexy Baby Voice.&#8221; Bell describes &#8220;sexy baby voice&#8221; as having three...","isPermalink":false,"tags":["Language politics","Phonetics","Sexy Baby Voice","Variation"],"authors":[{"name":"grvsmth","url":null}],"image":null,"modified":null,"contentHtml":"<p>Recently I&#8217;ve written two posts about bright resonance in response to Lake Bell&#8217;s audiobook chapter, &#8220;Sexy Baby Voice.&#8221;  Bell describes &#8220;sexy baby voice&#8221; as having three characteristic features: &#8220;high pitch&#8221;, &#8220;vocal fry&#8221; and &#8220;<a href=\"https://grieve-smith.com/blog/2022/12/slurring-sexy-babies/\">slurring</a>.&#8221;  <a href=\"https://grieve-smith.com/blog/2022/11/listen-to-the-voices-of-the-sexy-babies/\">My first post</a> supported Byron Ahn&#8217;s analysis that found that Bell&#8217;s &#8220;sexy baby voice&#8221; samples didn&#8217;t have reliably higher pitch than the non-&#8220;sexy baby voice&#8221; samples, and suggested that she&#8217;s probably talking about bright resonance.  <a href=\"https://grieve-smith.com/blog/2022/12/controlling-the-brightness-of-the-voice/\">My second post</a> drew on phonetic and pedagogical research to confirm Bell&#8217;s claim that while resonance is constrained by the size and shape of our vocal tracts, it can be consciously controlled to a certain degree.</p>\n<p>In this post I want to connect bright resonance (what Bell calls &#8220;high pitch&#8221;) with creaky voice (&#8220;vocal fry&#8221;).  The original reason they&#8217;re used together is youth.</p>\n<p>Bell&#8217;s argument is that &#8220;sexy baby voice&#8221; keeps women from being taken seriously, so let&#8217;s imagine a young woman who wants to be taken seriously when she talks.  Let&#8217;s say it&#8217;s 1990, and this woman is named Heather, and she has important things to say, whether it&#8217;s in a speech or in conversation.  And importantly for our purposes, Heather is trendy and feminine.</p>\n<p>On some level Heather is aware that dark resonance adds gravitas to speech.  But she&#8217;s young, she&#8217;s petite, she hasn&#8217;t given birth and she doesn&#8217;t smoke, so she has a relatively short vocal tract and thin vocal folds.  This means that without using any of the vocal habits I described in my last post, Heather&#8217;s voice will sound girlish, and will risk being prejudged as immature and unserious.</p>\n<p>Heather may try some of those habits and find them wanting.  She&#8217;s already avoiding twang and nasal resonance, which would make her voice sound even brighter.  She could try rounding and protruding her lips and using the furthest-back tongue articulations, the time-honored strategy of boys and tomboys.  But here&#8217;s the thing: she doesn&#8217;t want to sound too masculine.  She wants to be feminine, but taken seriously.  And maybe even sexy.</p>\n<p>Another strategy, lowering the larynx, also clashes with the style she wants.  It sounds too formal, too grand dame, too fussy.  Not at all trendy or stylish.</p>\n<p>Let&#8217;s imagine that after trying all these strategies, Heather&#8217;s a little tired and resigned.  She relaxes her voice and it drops into creak.  And it doesn&#8217;t sound fussy or tomboyish, but it has dark resonance.  Maybe it even sounds a bit fashionably blasé!</p>\n<p>And from a completely personal view, I just want to say that I do find creaky voice adds a bit of gravitas, and it can be very sexy.  When I hear a woman with creaky voice combined with bright overtones, I get an impression of smallness in bigness.  I think of creaky voice as the oversize sweater, boyfriend shirt or even mom jeans of the voice.</p>\n<p>So Heather starts using creak whenever she wants to be taken seriously.  And because she&#8217;s trendy, other young women imitate her.  Heather is Creaker Zero of late twentieth century &#8220;vocal fry.&#8221;</p>\n<p>Is that the way it actually happened?  I have no idea.  But it&#8217;s a possible scenario.  And the scorn that&#8217;s been heaped on &#8220;vocal fry&#8221; over the past thirty plus years has been a potent example of the double bind that women are placed in so many times.  Not enough dark resonance?  Girlish.  Rounded lips?  Transgressing gender.  Lowered larynx?  Fussy.  Creaky voice?  You&#8217;re destroying your voice!</p>\n<p>A lot of the politics of women&#8217;s voices has been covered by linguists I respect and admire, so for most of this I&#8217;ll just refer you to the responses of <a href=\"https://debuk.wordpress.com/2015/07/26/a-response-to-naomi-wolf/\" rel=\"noopener\" target=\"_blank\">Deborah Cameron</a>, <a href=\"https://www.nyu.edu/about/news-publications/news/2015/september/lisa-davidson-on-vocal-fry.html\" rel=\"noopener\" target=\"_blank\">Penny Eckert and Lisa Davidson</a> to the 2015 &#8220;vocal fry&#8221; panic, and radio producer <a href=\"https://medium.com/speak-louder/99-invisible-podcast-s-brilliant-response-to-criticism-of-women-s-voices-2d39f49a0569\" rel=\"noopener\" target=\"_blank\">Katie Mingle&#8217;s all-purpose response</a> to criticism of women&#8217;s voices.</p>\n<p>This is one area where Malcolm Gladwell failed in this chapter.  Gladwell is the producer of Bell&#8217;s audiobook and a friend of Bell, and in the chapter she turns to him for feedback.  His biggest strength is the ability to find experts and present their ideas in ways that engage a broader audience, but in this chapter he doesn&#8217;t talk to Cameron, Eckert, Davidson or even Mingle.  He just sits there and gives his own opinions, even conflating &#8220;high pitch&#8221; with &#8220;uptalk.&#8221;  In his defense, it is possible that he tried to refer Bell to experts, but we don&#8217;t hear about it.</p>\n"},{"id":"https://grieve-smith.com/blog/?p=1413","title":"Controlling the brightness of the voice","link":"https://grieve-smith.com/blog/2022/12/controlling-the-brightness-of-the-voice/","published":"Sat, 03 Dec 2022 18:48:37 +0000","description":"A few weeks ago I posted about &#8220;Sexy baby voice,&#8221; the topic of a chapter in Lake Bell&#8217;s audiobook about the culture and politics of voices. Bell identified three characteristics of...","isPermalink":false,"tags":["Language politics","Phonetics","Sexy Baby Voice","Variation"],"authors":[{"name":"grvsmth","url":null}],"image":null,"modified":null,"contentHtml":"<p>A few weeks ago <a href=\"https://grieve-smith.com/blog/2022/11/listen-to-the-voices-of-the-sexy-babies/\">I posted about &#8220;Sexy baby voice,&#8221;</a> the topic of <a href=\"https://omny.fm/shows/revisionist-history/from-inside-voice-lake-bell-and-the-sexy-baby-voic\" rel=\"noopener\" target=\"_blank\">a chapter in Lake Bell&#8217;s audiobook</a> about the culture and politics of voices.  Bell identified three characteristics of &#8220;sexy baby voice&#8221; in women: high pitch, &#8220;vocal fry&#8221; (creaky voice) and &#8220;<a href=\"https://grieve-smith.com/blog/2022/12/slurring-sexy-babies/\">slurring</a>.&#8221;</p>\n<p>In phonetics, &#8220;pitch&#8221; is generally understood to refer to the fundamental frequency of the speech signal, but on Twitter the phonetician <a href=\"https://twitter.com/ahnaphor/status/1588347842137305088\" rel=\"noopener\" target=\"_blank\">Byron Ahn posted</a> the results of a computer analysis of some of the examples Bell gave for &#8220;high pitch&#8221; and pointed out that their fundamental frequencies weren&#8217;t much higher than the examples she gave for &#8220;normal&#8221; speech.  In my post, I suggested that Bell is probably referring to the frequencies of harmonics in the speech, also called &#8220;resonance&#8221; or &#8220;formants.&#8221;  It sounds like the most salient feature of &#8220;sexy baby voice&#8221; is bright resonance.</p>\n<p>As I discussed in my post, bright resonance is generally associated with youth and femininity, because it&#8217;s usually caused by small vocal folds in small vocal tracts, and women and children tend to be smaller and have smaller vocal folds.  Even younger women tend to have brighter resonance than older women, primarily because of the affect of hormonal changes during childbirth and menopause.</p>\n<p>Of course, as Bell demonstrates repeatedly in her chapter, bright resonance can also be controlled, either consciously in the moment or subconsciously through habit and training.  I&#8217;ve learned about these ways over the years, as a linguistics doctoral student, as a transgender woman and as an amateur singer.  I&#8217;ll go through all the ways I know to do this.</p>\n<div id=\"attachment_1414\" style=\"width: 434px\" class=\"wp-caption aligncenter\"><a href=\"https://commons.wikimedia.org/wiki/File:Illu01_head_neck.jpg\" target=\"_blank\" rel=\"noopener\"><img aria-describedby=\"caption-attachment-1414\" decoding=\"async\" src=\"https://grieve-smith.com/blog/wp-content/uploads/2022/12/Illu01_head_neck.jpg\" alt=\"\" width=\"424\" height=\"430\" class=\"size-full wp-image-1414\" /></a><p id=\"caption-attachment-1414\" class=\"wp-caption-text\">Diagram of the vocal tract produced by the U.S. Centers for Disease Control and Prevention, and distributed by Wikimedia Commons.</p></div>\n<p>As with the previous post in this series, my knowledge comes from training, not reading, so I don&#8217;t know who to credit for figuring all this out about the vocal tract.  For now I will credit my primary teachers: the vocal coaches Kristy Bissell and Erin Carney, and the phoneticians Jacques Filliolet, Karen Landahl, Alex Francis and Doug Honorof.</p>\n<p>For people who haven&#8217;t studied the anatomy of the vocal tract, this will get a little technical.  In this blog post I&#8217;m going to use all the technical language, but if there&#8217;s a particular area that you feel could use more explanation for a general audience, please let me know.</p>\n<p>Let&#8217;s start with the larynx and move through the vocal tract with the breath.  The vocal folds generate sound through their vibration.  When closing completely they generate a relatively coherent sound wave, but they can add dark resonance by maintaining gaps of particular sizes to allow low-frequency vibrations, what we call <strong>creaky voice</strong> or &#8220;vocal fry.&#8221;  Similarly, they can add bright resonance by allowing turbulent air to flow through, causing <strong>breathy voice</strong>.</p>\n<p>Just above the larynx is a tube called the pharynx.  We can add bright resonance by <strong>constricting the pharynx</strong>, a practice that vocal coaches call &#8220;twang.&#8221;  The name confused me for a while, because I associate the word &#8220;twang&#8221; with the Southern vowel shift, but in this case it refers to the narrowing of the pharynx.</p>\n<p>The velum is a flap of muscle that we open to allow air to flow through the nose.  When we allow air to flow through the nose and mouth at the same time it produces nasal resonance, which adds brighter resonance.</p>\n<p>We use our tongues to produce consonants and vowels, raising a part of the tongue towards the roof of our mouths, so a /d/ sound is formed by touching the front of the mouth, and a /g/ sound by touching further back.  For each of these sounds there is a range of positions along the roof of our mouth.  When we <strong>raise our tongues further forward</strong> within the range for that sound, we generate brighter resonance.  We can also generate bright resonance by flattening the tongue, allowing it to be raised higher.  There is extensive research showing that women and gay men tend to have brighter resonance on their /s/ phonemes, and that people who make brighter /s/ sounds tend to be heard as women or gay men, even if they aren&#8217;t.</p>\n<p>The lips are the gates that release our voices to the air outside.  <strong>Rounded and protruded</strong> lips can produce darker resonance, and <strong>spread lips</strong> (in a smile or similar shape) can produce lighter resonance.  I remember hearing about a study showing that even before puberty, boys tend to round their lips to sound more masculine.</p>\n<p>One thing that makes this confusing is that all these vocal tract configurations have other functions.  Creaky voice can be a sign of fatigue.  Breathy voice can be a sign of relaxation.  Pharyngeal constriction, nasal resonance, place of articulation and lip rounding can each change one word into another word with a completely different meaning, in Arabic, French, English and other languages.</p>\n<p>These articulations can also interact with each other and with the fundamental frequency of the voice in different ways.  At low frequencies, breathy voice can sound sympathetic or sexy, but at high frequencies it can sound weak and vulnerable.  This may be what you want to project, or it may not.  Nasal resonance and pharyngeal constriction can sound forced or strident, obnoxious or insensitive.</p>\n<p>The bottom line is that these aspects of the voice are all under some degree of conscious control.  How much control a speaker has, and how conscious they are, depends on a lot of factors, but the takeaway for Bell&#8217;s chapter is that people with smaller vocal tracts can use these techniques to speak with darker resonance than they would without them, and people with larger vocal tracts can use them to speak with brighter resonance than they otherwise would.</p>\n<p>Note that I&#8217;m using the term &#8220;otherwise.&#8221;  The terms I want to avoid, for this post at least, are &#8220;natural,&#8221; &#8220;authentic,&#8221; &#8220;real&#8221; and &#8220;your/my/their voice.&#8221;  The tension between biological constraints, habit and conscious control is what makes resonance so fraught, politically, culturally and socially, which is why Bell and others have such intense feelings about it.  That&#8217;s for another post.</p>\n"},{"id":"https://grieve-smith.com/blog/?p=1407","title":"Dialogue and monologue in social media","link":"https://grieve-smith.com/blog/2022/11/dialogue-and-monologue-in-social-media/","published":"Mon, 28 Nov 2022 00:23:42 +0000","description":"I wrote most of this post in June 2022, before a lot of us decided to try out Mastodon. I didn&#8217;t publish it because I despaired of it making a difference. It felt like so many people were set in...","isPermalink":false,"tags":["Language politics","Software","Web","france"],"authors":[{"name":"grvsmth","url":null}],"image":null,"modified":null,"contentHtml":"<p>I wrote most of this post in June 2022, before a lot of us decided to try out Mastodon.  I didn&#8217;t publish it because I despaired of it making a difference.  It felt like so many people were set in particular practices, including not reading blog posts!  My experience on Mastodon has been so much better than the past several years on Twitter. I think this is connected with how Twitter and Mastodon handle threads.</p>\n<p>A few years ago I wrote <a href=\"https://grieve-smith.com/blog/2016/10/shelter-from-the-tweetstorm/\">a critique of Twitter threads</a>, tweetstorms, essays, and similar forms. I realize now that I didn&#8217;t actually talk much about what&#8217;s wrong with them. I focused on how difficult they are to read, but I didn&#8217;t realize how the native Twitter website and app actually makes them easier to read. So let me tell you some of the deeper problems with threads.</p>\n<p>In 2001 I visited some of the computational linguistics labs at Carnegie Mellon University. Unfortunately I don&#8217;t remember the researchers&#8217; names, but they described a set of experiments that has informed my thinking about language ever since. They were looking at the size of the input box in a communication app.</p>\n<p>These researchers did experiments where they asked people to communicate with each other using a custom application. They presented different users with input boxes of different sizes: some got only a single line, others got three or four, and maybe some got six or eight lines.</p>\n<p>What they found was that when someone was presented with a large blank space, as in an email application or the Google Docs application I&#8217;m writing this in, they tended to take their time and write long blocks of text, and edit them until they were satisfied. Only then did they hit send. Then the other user would do the same.</p>\n<p>When the Carnegie Mellon researchers presented users with only one line, as in a text message app, their behavior was much different. They wrote short messages and sent them off with minimal editing. The short turnaround time resulted in a dialogue that was much closer to the rhythm of spoken conversation.</p>\n<p>This echoed my own findings from a few years before. I was searching for features of French that I heard all over the streets of Paris, but had not been taught to me in school, in particular what linguists call right dislocation (&#8220;Ils sont fous, ces Romains&#8221;) and left dislocation (&#8220;L&#8217;état, c&#8217;est moi&#8221;).</p>\n<p>In 1998 the easiest place to look was USENET newsgroups, and I found that even casual newsgroups like fr.rec.animaux were heavy on the formal, carefully crafted types of messages I remembered from high school French class. I had already read some prior research on this kind of language variation, so I decided to try something with faster dialogue.</p>\n<p>In Internet Relay Chat (IRC) I hit the jackpot. On the <a rel=\"tag\" class=\"u-tag u-category\" href=\"https://grieve-smith.com/blog/tag/france/\">#france</a> IRC channel, left and right dislocations made up between 21% and 38% of all finite clauses. I noticed other features of conversational French like ne-dropping were common as well. I could even see IRC newbies adapting in real time: they would start off trying to write formal sentences the way they were taught in lycée, and soon give up and start writing the way they talked.</p>\n<p>At this point I have to say: I love dialogue. Don&#8217;t get me wrong: I can get into a nice well-crafted monologue or monograph. And anyone who knows me knows I enjoy telling a good story or tearing off on a rant about something. But dialogue keeps me honest, and it keeps other people honest too.</p>\n<p>Dialogue is not inherently or automatically good. On Twitter as in many other places, it is used to harass and intimidate. But when properly structured and regulated it can be a democratizing force. It&#8217;s important to remember how long our media has been dominated by monologues: newspapers, films, television. Even when these formats contain dialogues, they are often fictional dialogues written by a single author or team of authors to send a single message.</p>\n<p>One of my favorite things about the internet is that it has always favored dialogue. Before large numbers of people were on the internet there was a large gap between privileged media sources and independent ones. Those of us who disagreed with the monologues being thrust upon us by television and newspapers were often reduced to impotently talking back at those powerful media sources, in an empty room.</p>\n<p>USENET, email newsletters, personal websites and blogs were democratizing forces because they allowed anyone who could afford the hosting fees (sometimes with the help of advertisers) to command these monologic platforms. They were the equivalent of Speakers&#8217; Corner in London. They were like pamphlets or letters to the editor or cable access television, but they eliminated most of the barriers to entry. But they were focused on monologues.</p>\n<p>In the 1990s and early 2000s we had formats that encouraged dialogue, like mailing lists and bulletin boards, but they had large input boxes. As I saw on fr.rec.animaux in 1998, that encouraged long, edited messages.<br />\nWe did have forums with smaller input boxes, like IRC or the group chats on AOL Instant Messenger. As I found, those encouraged people to write short messages in dialog with each other. When I first heard about Twitter with its 140-character limit I immediately recognized it as a dialogic forum.</p>\n<p>But what sets Twitter apart from IRC or AOL Instant Messenger? Twitter is a broadcast platform. The fact that every tweet is public by default, searchable and assigned a unique URL, makes it a &#8220;microblog&#8221; site like some popular sites in China.</p>\n<p>If someone said something on IRC or AIM in 1999 it was very hard to share it outside that channel. I was able to compile my corpus by creating a &#8220;bot&#8221; that logged on to the <a rel=\"tag\" class=\"u-tag u-category\" href=\"https://grieve-smith.com/blog/tag/france/\">#france</a> channel every night and logged a copy of all the messages. What Twitter and the sites it copied like Weibo brought was the combination of permanent broadcast, low barrier to entry, and dialogue.</p>\n<p>This is why I&#8217;m bothered by Twitter threads, by screenshots of text, by the unending demands for an edit button. These are all attempts to overpower the dialogue on Twitter, to remove one of the key elements that make it special.</p>\n<p>Without the character limits, Twitter is just a blogging platform. Of course, there&#8217;s nothing wrong with blogs! I&#8217;ve done a lot of blogging, I&#8217;ve done a lot of commenting on blogs and I&#8217;ve tweeted a lot of links to blogs. But I want to choose when to follow those links and go read those blog posts or news articles or press releases.</p>\n<p>I want a feed full of dialogue or short statements. Threads and screenshots interrupt the dialogue. They aggressively claim the floor, crowding out other tweets. Screenshots interrupt the other tweets with large blocks of text, demanding to be read in their entirety. Threads take up even more of the timeline. The Twitter web app will show as many as three tweets of a thread, interrupting the flow of dialogue.</p>\n<p>The experience of threads is much worse on Twitter clients that don&#8217;t manipulate the timeline, like TweetDeck (which was bought by Twitter in 2011) and HootSuite. If it&#8217;s a long thread, your timeline is screwed, and you have to scroll endlessly to get past it.</p>\n<p>One of the things I love the most about Mastodon is the standard practice of making the first toot in a thread public, but publishing all the other toots as unlisted. That broadcasts the toot announcing the thread, and then gives readers the agency to decide whether they want to read the follow-up toots. It&#8217;s more or less the equivalent of including a link to a web page or blog post in a toot.</p>\n<p>There&#8217;s a lot more to say about dialogue and social media, but for now I&#8217;m hugely encouraged by the feeling of being on Mastodon, and I&#8217;m hoping it leads us in a better direction for dialogue, away from threads and screenshots.</p>\n"},{"id":"https://grieve-smith.com/blog/?p=1398","title":"Listen to the voices of the sexy babies","link":"https://grieve-smith.com/blog/2022/11/listen-to-the-voices-of-the-sexy-babies/","published":"Sun, 13 Nov 2022 21:16:21 +0000","description":"A few days ago, Byron Ahn drew our attention to an excerpt from a new, six-hour audiobook, Inside Voice by Lake Bell, credited as an &#8220;actress/writer/director/producer.&#8221; Bell is a friend of author...","isPermalink":false,"tags":["Language politics","Phonetics","Sexy Baby Voice","Variation"],"authors":[{"name":"grvsmth","url":null}],"image":null,"modified":null,"contentHtml":"<p>A few days ago, <a href=\"https://twitter.com/ahnaphor/status/1588347842137305088\" target=\"_blank\" rel=\"noopener\">Byron Ahn drew our attention</a> to <a href=\"https://omny.fm/shows/revisionist-history/from-inside-voice-lake-bell-and-the-sexy-baby-voic\" target=\"_blank\" rel=\"noopener\">an excerpt from a new, six-hour audiobook</a>, Inside Voice by Lake Bell, credited as an &#8220;actress/writer/director/producer.&#8221; Bell is a friend of author and podcaster Malcolm Gladwell, and Gladwell agreed to serve as a kind of sounding board for Bell&#8217;s ideas about something she calls &#8220;sexy baby voice,&#8221; pointing to the voices of Paris Hilton and Kim Kardashian as paradigm examples of it. Gladwell, whose company is publishing Inside Voice, also published this excerpt as a free bonus episode of his podcast Revisionist History, which I listen to regularly, although I&#8217;m almost two years behind.</p>\n<p>Bell argues for a few points: that what she calls &#8220;sexy baby voice&#8221; is a distinct speech style with specific audible features, that it is particularly inauthentic (she claims several times that it requires effort to speak that way, and describes a coaching technique for helping women to find their &#8220;true&#8221; voices) and that it makes them sound stupider than Bell knows them to be. She repeatedly assures us that she is not passing judgment, and then uses extremely judgmental language to describe &#8220;sexy baby voice,&#8221; which I interpret as an application of &#8220;love the sinner, hate the sin.&#8221;</p>\n<p>Ahn posted a series of Twitter threads about the excerpt. He notes that it&#8217;s problematic for Bell to criticize women as a self-identified feminist, but he focuses on the terminology that she uses to describe the features of &#8220;sexy baby voice,&#8221; particularly the word &#8220;pitch.&#8221; He concludes, &#8220;we should encourage public figures talking about voices to consult linguists who have the training.&#8221;</p>\n<p>I&#8217;ve got a lot of thoughts and feelings about this excerpt and Bell&#8217;s idea of &#8220;sexy baby voice.&#8221; I could probably write several blog posts on the practical, cultural and social angles to this. For this post I&#8217;m going to keep with Ahn&#8217;s focus on what &#8220;sexy baby voice&#8221; is, phonetically. <a href=\"https://twitter.com/grvsmth/status/1588351404577529858\" target=\"_blank\" rel=\"noopener\">I sketched some of this out</a> on Ahn&#8217;s Twitter thread, and I&#8217;ll synthesize and expand that here.</p>\n<p>Bell says that the primary feature that defines &#8220;sexy baby voice&#8221; is &#8220;pitch,&#8221; and as linguists, we&#8217;re trained to interpret &#8220;pitch&#8221; as the fundamental frequency of the voice &#8211; essentially, the lowest pitch produced by the voice at any given time. I&#8217;ve been taking singing lessons, and all the singers and singing teachers I&#8217;ve talked to use &#8220;pitch&#8221; in the same way.</p>\n<p>Ahn introduces his discussion of the &#8220;sexy baby voice&#8221; excerpt with a graph of the fundamental frequency of a segment of the recording &#8211; throughout the excerpt, Bell uses her own voice to demonstrate the &#8220;sexy baby voice&#8221; style, even though she says she does not use it in everyday conversation. In the graph he posts, the floor and ceiling of Bell&#8217;s fundamental frequency range are not particularly higher when she is using &#8220;sexy baby voice&#8221; than at other times.</p>\n<p>Bell mentions two other factors: &#8220;vocal fry&#8221; (the linguistic term is &#8220;creaky voice&#8221;) and &#8220;<a href=\"https://grieve-smith.com/blog/2022/12/slurring-sexy-babies/\">slurring</a>&#8221; speech. Ahn speculates that she may be picking up on other factors as well, like &#8220;SoCal vowels&#8221; or laryngeal constriction. He also acknowledges that &#8220;pitch&#8221; may refer to other pitch-related features besides fundamental frequency range, such as &#8220;uptalk,&#8221; a pattern of rising in fundamental frequency at the ends of phrases. Gladwell uses the word &#8220;uptalk&#8221; when echoing Bell&#8217;s explanations, but it&#8217;s not clear that he&#8217;s referring to phrase-final pitch rise.</p>\n<p>So here&#8217;s where I come in: my gender expression is fluid, so <a href=\"https://transblog.grieve-smith.com/2021/03/23/gender-expression-in-the-voice/\">I&#8217;ve been studying differences in vocal quality</a>. When I listen to the samples in the chapter of &#8220;sexy baby voice&#8221; and &#8230; not-sexy-baby-voice (that&#8217;s for another post!) given by Bell, both in recordings and her own mimicry, I hear some creaky voice (&#8220;vocal fry&#8221;), but the main difference I hear is resonance.</p>\n<p>This section is going to be a bit of a departure from my normal linguistics blogging, because I have not studied any of the literature on this. My understanding of it comes from practical training, so I don&#8217;t know who to cite or credit for any of this besides my teachers, Kristy Bissell and Erin Carney.  Of course, any inaccuracies are most likely due to my misunderstanding of what they&#8217;ve tried to teach me!</p>\n<p>Resonance is about the pitch of speech, but it&#8217;s not about the fundamental frequency. It&#8217;s about everything else: the harmonics that result from the way the tones from our vocal folds echo around our bodies and are filtered through different parts of our vocal tracts and nasal passages. Just as plucking a string on an acoustic guitar produces overtones from the guitar body, whenever we arrange our vocal folds to talk or sing we produce overtones: higher pitched frequencies that can harmonize or clash with the fundamental frequency.</p>\n<p>There are a ton of things you can do with resonance and it can get really complicated, so let&#8217;s focus on the primary resonance difference I&#8217;m hearing between Lake Bell&#8217;s &#8220;sexy baby voice&#8221; and the other examples. To me, the &#8220;sexy baby voice&#8221; examples sound brighter.</p>\n<p>Bright and dark are useful terms to evoke the quality of resonance while distinguishing it from fundamental frequency. Bright sounds are ones where we hear more of the higher-pitched harmonics, while in dark sounds the lower harmonics dominate.</p>\n<p>As I&#8217;ve learned from my teachers, and as Bell demonstrates, there&#8217;s a lot we can do with our voices to shift the balance of harmonics towards light or dark, but a substantial part of resonance comes form the structure of our bones, cartilage, muscles and fat. Higher-pitched harmonics tend to come from shorter vocal tracts, smaller nasal cavities, and in general, from smaller bodies. As a result, the voices of smaller people tend to sound brighter.</p>\n<p>Testosterone during the teenage years also changes the configuration of our vocal tracts: thickening the vocal folds, making the larynx larger and shifting it lower in the throat. This is why men&#8217;s and trans women&#8217;s voices tend to sound darker than those of women, girls and prepubescent boys, even when singing the same pitch.</p>\n<p>Bodies that see an increase in testosterone after puberty do not get larger or lower larynxes, but do tend to develop thicker vocal folds.  This is why many trans men&#8217;s voices change, but often sound different from typical men&#8217;s voices.  It is also, as Bell mentions, why women&#8217;s voices often change when they give birth or go through menopause.</p>\n<p>As you might have guessed, this is where the &#8220;baby&#8221; in &#8220;sexy baby voice&#8221; comes from. Children are smaller than adults and tend to have brighter resonances. It&#8217;s also why Bell sees &#8220;sexy baby voice&#8221; as an exaggerated expression of femininity: women tend to be smaller than men and therefore have brighter voices. Women who haven&#8217;t given birth or gone through menopause tend to have brighter voices. Bright resonance suggests youth, femininity and immaturity.</p>\n<p>As I mentioned above, there are several things that people can do, consciously or unconsciously, to shift their resonances, and <a href=\"https://grieve-smith.com/blog/2022/12/controlling-the-brightness-of-the-voice/\">I want to talk about them</a>. I would also love to get into a discussion of the sociopolitical issues that Bell identifies around &#8220;sexy baby voice&#8221; and women&#8217;s voices in general. But this is already pretty long for a blog post, so I&#8217;ll save those for another time.</p>\n"},{"id":"https://grieve-smith.com/blog/?p=1342","title":"Fonts for Stokoe notation","link":"https://grieve-smith.com/blog/2022/05/fonts-for-stokoe-notation/","published":"Sun, 08 May 2022 23:37:43 +0000","description":"You may be familiar with the International Phonetic Alphabet, the global standard for representing speech sounds, ideally independent of the way those speech sounds may be represented in a writing system. Did...","isPermalink":false,"tags":["Phonology","Sign languages","Software","Web"],"authors":[{"name":"grvsmth","url":null}],"image":null,"modified":null,"contentHtml":"<p>You may be familiar with the International Phonetic Alphabet, the global standard for representing speech sounds, ideally independent of the way those speech sounds may be represented in a writing system. Did you know that sign languages have similar standards for representing hand and body gestures?</p>\n<p>Unfortunately, we haven&#8217;t settled on a single notation system for sign languages the way linguists have mostly chosen the IPA for speech. There are compelling arguments that none of the existing systems are complete enough for all sign languages, and different systems have different strengths.</p>\n<p>Another difference is that signers, by and large, do not read and write their languages. Several writing systems have been developed and promoted, but to my knowledge, there is no community that sends written messages to each other in any sign language, or that writes works of fiction or nonfiction for other signers to read.</p>\n<p>One of the oldest and best-known notation system is the one developed by Gallaudet University professor William Stokoe (<span class=\"stokoe\">u5\"<sub>t</sub>x</span>) for his pioneering analysis of American Sign Language in the 1960s, which succeeded in convincing many people that ASL is, in ways that matter, a language like English or Japanese or Navajo. Among other things, with his co-authors Dorothy Casterline and Carl Cronenberg Stokoe used this system for the entries in their 1965 <a href=\"https://www.google.com/books/edition/A_Dictionary_of_American_Sign_Language_o/WjAFAQAAIAAJ\" target=\"_blank\" rel=\"noopener\">Dictionary of American Sign Language</a> (available from <a href=\"http://store.signmedia.com/1614.html\" target=\"_blank\" rel=\"noopener\">SignMedia</a>).  In the dictonary entry above, the sign <span class=\"stokoe\">C<sub>b</sub>C<sub>b</sub><sup>r~</sup></span> is given the English translation of &#8220;type.&#8221;</p>\n<p>Stokoe notation is incomplete in a number of ways. Chiefly, it is optimized for the lexical signs of American Sign Language. It does not account for the wide range of handshapes used in American fingerspelling, or the wide range of locations, orientations and movements used in ASL depicting gestures. It only describes what a signer&#8217;s hands are doing, with none of the face and body gestures that have come to be recognized as essential to the grammar of sign languages. Some researchers have produced modifications for other languages, but those are not always well-documented.</p>\n<p>Stokoe created a number of symbols, some of which bore a general resemblance to Roman letters, and some that didn&#8217;t. This made it impossible to type with existing technology; I believe all the transcriptions in the Dictionary of ASL were written by hand. In 1993 another linguist, Mark Mandel, developed <a href=\"https://web.archive.org/web/20110807080004/http://www.speakeasy.org/~mamandel/ASCII-Stokoe.html\" target=\"_blank\" rel=\"noopener\">a system for encoding Stokoe notation</a> into the American Standard Code for Information Interchange (ASCII) character set, which by then could be used on almost all American computers.</p>\n<p>In September 1995 I was in the middle of a year-long course in ASL at the ASL Institute in Manhattan. I used some Stokoe notation for my notes, but I wanted to be able to type it on the computer, not just using Mandel&#8217;s ASCII encoding. I also happened to be working as a trainer at Userfriendly, a small chain of computer labs with a variety of software available, including Altsys Fontographer, and as an employee I could use the workstations whenever customers weren&#8217;t paying for them.</p>\n<p>One day I sat down in a Userfriendly lab and started modifying an existing public domain TrueType font (<a href=\"https://www.fontspace.com/tempo-font-f1878\" target=\"_blank\" rel=\"noopener\">Tempo</a> by David Rakowski) to make the Stokoe symbols. The symbols were not in Unicode, and still are not, despite <a href=\"https://www.unicode.org/L2/L2012/12133-toward-stokoe.pdf\" target=\"_blank\" rel=\"noopener\">a proposal to that effect on file</a>. I arranged it so that the symbols used the ASCII-Stokoe mappings: if you typed something in ASCII-Stokoe and applied my font, the appropriate Stokoe symbols would appear. StokoeTempo was born. It wasn&#8217;t elegant, but it worked.</p>\n<p>I made the font available for download <a href=\"https://www.panix.com/~grvsmth/stokoe/\" target=\"_blank\" rel=\"noopener\">from my website</a>, where it&#8217;s been for the past 26-plus years. I wound up not using it for much, other than to create materials for the linguistics courses I taught at Saint John&#8217;s University, but others have downloaded it and put it to use. It is linked from <a href=\"https://en.wikipedia.org/wiki/Stokoe_notation\" target=\"_blank\" rel=\"noopener\">the Wikipedia article</a> on Stokoe notation.</p>\n<p>A few years later I developed SignSynth, a web-based prototype sign language synthesis application. At the time web browsers did not offer much flexibility in terms of fonts, so I could not use Stokoe symbols and had to rely on ASCII-Stokoe, and later Don Newkirk&#8217;s (1986) Literal Orthography, along with custom extensions for fingerspelling and nonmanual gestures.</p>\n<p>Recently, as part of a project to bring SignSynth (another project of mine) into the 21st Century I decided to explore using fonts on the Web. I discovered a free service, <a href=\"https://www.fontsquirrel.com/tools/webfont-generator\" target=\"_blank\" rel=\"noopener\">FontSquirrel</a>, that creates Web Open Font Format (WOFF and WOFF2) wrappers for TrueType fonts. I created WOFF and WOFF2 files for StokoeTempo and posted them on my site.</p>\n<p>I also discovered a different standard, Typeface.js, which actually uses a JSON format. This is of particular relevance to SignSynth, because it can be used with the 3D web library Three.js. There&#8217;s another free service, <a href=\"https://gero3.github.io/facetype.js/\" target=\"_blank\" rel=\"noopener\">Facetype.js</a>, that converts TrueType fonts to Typeface.js fonts.</p>\n<p><img decoding=\"async\" loading=\"lazy\" class=\"size-medium wp-image-1354\" src=\"https://grieve-smith.com/blog/wp-content/uploads/2022/05/CbCbN-1-500x62.png\" alt=\"(imit.: dez may be slightly bent spread 5) v type, N typewriter, typist with or without suffix -|| [/BB/v,.\" width=\"500\" height=\"62\" srcset=\"https://grieve-smith.com/blog/wp-content/uploads/2022/05/CbCbN-1-500x62.png 500w, https://grieve-smith.com/blog/wp-content/uploads/2022/05/CbCbN-1-1024x126.png 1024w, https://grieve-smith.com/blog/wp-content/uploads/2022/05/CbCbN-1-768x95.png 768w, https://grieve-smith.com/blog/wp-content/uploads/2022/05/CbCbN-1.png 1218w\" sizes=\"(max-width: 500px) 100vw, 500px\" /></p>\n<p>To demonstrate the use of StokoeTempo web fonts, above is a scan of the definition of <span class=\"stokoe\">C<sub>b</sub>C<sub>b</sub><sup>r~</sup></span> from page 51 of the <em>Dictionary of American Sign Language</em>. Below I have reproduced it using HTML and StokoeTempo:</p>\n<blockquote><p><span class=\"stokoe\">C<sub>b</sub>C<sub>b</sub><sup>r~</sup></span> (imit.: dez may be slightly bent spread <span class=\"stokoe\">5</span>) <span class=\"stokoe\">v</span> <i>type</i>, <span class=\"stokoe\">r</span> <i>typewriter, typist</i> with or without suffix _____ ?<span class=\"stokoe\">[BB<sup>v</sup></span>.</p></blockquote>\n<p>StokoeTempo is <a href=\"https://www.panix.com/~grvsmth/stokoe/\" target=\"_blank\" rel=\"noopener\">free to download</a> and use by individuals and educational institutions.</p>\n"},{"id":"https://grieve-smith.com/blog/?p=1333","title":"Imagining an alternate language service","link":"https://grieve-smith.com/blog/2022/04/alternate-language-service/","published":"Thu, 07 Apr 2022 03:20:27 +0000","description":"It&#8217;s well known that some languages have multiple national standards, to the point where you can take courses in either Brazilian or European Portuguese, for example. Most language instruction services...","isPermalink":false,"tags":["Language politics","Natural Language Generation","Software","Teaching","Web"],"authors":[{"name":"grvsmth","url":null}],"image":null,"modified":null,"contentHtml":"<p>It&#8217;s well known that some languages have multiple national standards, to the point where you can take courses in either Brazilian or European Portuguese, for example.  Most language instruction services seem to choose one variety per language: when I studied Portuguese at the University of Paris X-Nanterre it was the European variety, but the online service Duolingo only offers the Brazilian one.</p>\n</p>\n<p>I looked into some of Duolingo&#8217;s offerings for this post, because they&#8217;re the most talked about language instruction service these days.  I was surprised to discover that they use no recordings of human speakers; all their speech samples are synthesized using an Amazon speech synthesis service named Polly.  Interestingly, even though Duolingo only offers one variety of each language, Amazon Polly offers multiple varieties of English, Spanish, Portuguese and French.</p>\n<p>As an aside, when I first tried Duolingo years ago I had the thought, &#8220;Wait, is this synthesized?&#8221; but it just seemed too outrageous to think that someone would make a business out of teaching humans to talk like statistical models of corpus speech.  It turns out it wasn&#8217;t too outrageous, and I&#8217;m still thinking through the implications of that.</p>\n<p>Synthesized or not, it makes sense for a company with finite resources to focus on one variety.  But if that one company controls a commanding market share, or if there&#8217;s a significant amount of collusion or groupthink among language instruction services, they can wind up shutting out whole swathes of the world, even while claiming to be inclusive.</p>\n<p>This is one of the reasons I created <a href=\"https://grieve-smith.com/blog/languagelab/\" rel=\"noopener\" target=\"_blank\">an open LanguageLab platform</a>: to make it easier for people to build their own exercises and lessons, focusing on any variety they choose.  You can set up your own LanguageLab server with exercises exclusively based on recordings of the English spoken on Smith Island, Maryland (population 149), if you like.</p>\n<p>So what about excluded varieties with a few more speakers?  I made a table of all the Duolingo language offerings according to their number of English learners, along with the Amazon Polly dialect that is used on Duolingo.  If the variety is only vaguely specified, I made a guess.</p>\n<p>For each of these languages I picked another variety, one with a large number of speakers.  I tried to find the variety with the largest number of speakers, but these counts are always very imprecise.  The result is an imagined alternate language service, one that does not automatically privilege the speakers of the most influential variety.  Here are the top ten:</p>\n<table>\n<thead>\n<tr>\n<th>Language</th>\n<th>Duolingo dialect</th>\n<th>Alternate dialect</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>English</td>\n<td>Midwestern US</td>\n<td>India</td>\n</tr>\n<tr>\n<td>Spanish</td>\n<td>Mexico</td>\n<td>Argentina</td>\n</tr>\n<tr>\n<td>French</td>\n<td>Paris</td>\n<td>Quebec</td>\n</tr>\n<tr>\n<td>Japanese</td>\n<td>Tokyo</td>\n<td>Kagoshima</td>\n</tr>\n<tr>\n<td>German</td>\n<td>Berlin</td>\n<td>Bavarian</td>\n</tr>\n<tr>\n<td>Korean</td>\n<td>Seoul</td>\n<td>Pyongyang</td>\n</tr>\n<tr>\n<td>Italian</td>\n<td>Florence</td>\n<td>Rome</td>\n</tr>\n<tr>\n<td>Mandarin Chinese</td>\n<td>Beijing</td>\n<td>Taipei</td>\n</tr>\n<tr>\n<td>Hindi</td>\n<td>Delhi</td>\n<td>Chhatisgarhi</td>\n</tr>\n<tr>\n<td>Russian</td>\n<td>Moscow</td>\n<td>Almaty</td>\n</tr>\n</tbody>\n</table>\n<p>To show what could be done with a little volunteer work, I created a sample lesson for a language that I know, the third-most popular language on Duolingo, French.  After France, the country with the next largest number of French speakers is Canada.  Canadian French is distinct in pronunciation, vocabulary and to some degree grammar.</p>\n<p>Canadian French is stigmatized outside Canada, to the point where I&#8217;m not aware of any program in the US that teaches it, but it is omnipresent in all forms of media in Canada, and there is quite a bit of local pride.  These days at least, it would be as odd for a Canadian to speak French like a Parisian as for an American to speak English like a Londoner.  There are upper and lower class accents, but they all share certain features, notably the ranges of the nasal vowels.</p>\n<p>I chose a bestselling author and television anchor, Michel Jean, who has one grandmother from the indigenous Innu people and three presumably descended from white French settlers.  I took a small excerpt from <a href=\"https://www.youtube.com/watch?v=S9NPH8deB0o\" rel=\"noopener\" target=\"_blank\">an interview with Jean</a> about his latest novel where he responds spontaneously to the questions of a librarian, Josianne Binette.</p>\n<p>The sample lesson in Canadian French based on Michel Jean&#8217;s speech is available on <a href=\"https://languagelab.grieve-smith.com/static/client/\" rel=\"noopener\" target=\"_blank\">the LanguageLab demo site</a>.  You are welcome to try it!  Just log in with the username <b>demo</b> and the password <b>LanguageLab</b>.</p>\n"},{"id":"https://grieve-smith.com/blog/?p=1312","title":"Teaching intro sign phonetics","link":"https://grieve-smith.com/blog/2021/10/teaching-intro-sign-phonetics/","published":"Tue, 19 Oct 2021 03:17:27 +0000","description":"A few years ago I wrote about incorporating sign linguistics when I taught Introduction to Linguistics at Saint John&#8217;s University. The other course I taught most often was Introduction to Phonology....","isPermalink":false,"tags":["Phonetics","Sign languages","Teaching"],"authors":[{"name":"grvsmth","url":null}],"image":null,"modified":null,"contentHtml":"<p>A few years ago I wrote about <a href=\"https://grieve-smith.com/blog/2018/04/teaching-sign-linguistics-in-introductory-classes/\">incorporating sign linguistics</a> when I taught Introduction to Linguistics at Saint John&#8217;s University.  The other course I taught most often was Introduction to Phonology.  This course was required for our majors in Speech Pathology and Audiology, and they often filled up the class.  I never had a Deaf student, but almost all of my students expressed some level of interest in signed languages, and many had taken several semesters of American Sign Language.</p>\n<p>The texts I used tended to devote a chapter to sign linguistics here or there, but not present it systematically or include it in general discussions.  I always included those chapters, and any mention of signed languages was received enthusiastically by my students, so having a love of sign linguistics myself, I was happy to teach more.</p>\n<p>The first thing I did was to add sign phonetics.  I had previously found that I needed to start Introduction to Phonology with a comprehensive review of spoken phonetics, so I just followed that with a section on the systematic description of hand, face and upper body gestures.  A lot of the spoken phonetics review was focused on phonetic transcription, and the students needed some way to keep track of the gestures they were studying, so I taught them <a href=\"https://en.m.wikipedia.org/wiki/Stokoe_notation\" rel=\"noopener\" target=\"_blank\">Stokoe notation</a>.</p>\n<p><img decoding=\"async\" loading=\"lazy\" src=\"https://grieve-smith.com/blog/wp-content/uploads/2021/10/Screenshot-of-Stokoe-handshape-symbols-363x500.png\" alt=\"A list of Stokoe handshape symbols, with corresponding illustrations of the handshapes\" width=\"363\" height=\"500\" class=\"aligncenter size-medium wp-image-1320\" srcset=\"https://grieve-smith.com/blog/wp-content/uploads/2021/10/Screenshot-of-Stokoe-handshape-symbols-363x500.png 363w, https://grieve-smith.com/blog/wp-content/uploads/2021/10/Screenshot-of-Stokoe-handshape-symbols.png 546w\" sizes=\"(max-width: 363px) 100vw, 363px\" /></p>\n<p>Some of you may be remembering negative things you&#8217;ve read, or heard, or said, about Stokoe notation.  It&#8217;s not perfect.  But it&#8217;s granular enough for an intro phonology course, and it&#8217;s straightforward and relatively transparent.  My students had no problem with it.  Remember that the appropriate level of granularity <a href=\"https://grieve-smith.com/blog/2015/12/levels-of-phonetic-description/\">depends on what you&#8217;re trying to communicate</a> about the language.</p>\n<p><img decoding=\"async\" loading=\"lazy\" src=\"https://grieve-smith.com/blog/wp-content/uploads/2021/10/orientations2b-467x500.jpg\" alt=\"The orientation and movement symbols from Stokoe notation, mapped onto a chart depicting the right side of a human head and attached right shoulder\" width=\"467\" height=\"500\" class=\"aligncenter size-medium wp-image-1316\" srcset=\"https://grieve-smith.com/blog/wp-content/uploads/2021/10/orientations2b-467x500.jpg 467w, https://grieve-smith.com/blog/wp-content/uploads/2021/10/orientations2b.jpg 486w\" sizes=\"(max-width: 467px) 100vw, 467px\" /></p>\n<p>I developed charts for the Stokoe symbols for locations, orientations and movements (&#8220;tab&#8221; and &#8220;sig&#8221; in Stokoe&#8217;s terminology), corresponding to the <a href=\"https://grieve-smith.com/blog/2020/07/show-your-vowels-and-support-doctors-without-borders/\" rel=\"noopener\" target=\"_blank\">vowel quadrilateral charts</a> developed by Pierre Delattre and others for spoken languages.  To create the charts I used <a href=\"http://www.panix.com/~grvsmth/stokoe/\" rel=\"noopener\" target=\"_blank\">the StokoeTempo font</a> that I developed back in 1995.</p>\n<p><img decoding=\"async\" loading=\"lazy\" src=\"https://grieve-smith.com/blog/wp-content/uploads/2021/10/Additional-movements-of-ASL-500x399.png\" alt=\"A list of additional movements of ASL and their symbols in Stokoe notation\" width=\"500\" height=\"399\" class=\"size-medium aligncenter wp-image-1319\" srcset=\"https://grieve-smith.com/blog/wp-content/uploads/2021/10/Additional-movements-of-ASL-500x399.png 500w, https://grieve-smith.com/blog/wp-content/uploads/2021/10/Additional-movements-of-ASL.png 504w\" sizes=\"(max-width: 500px) 100vw, 500px\" /></p>\n<p>The next step was to find data for students to analyze.  I instructed my students to watch videos of jokes in American Sign Language posted to YouTube and Facebook by two Deaf storytellers and ASL teachers, Greg &#8220;<a href=\"https://www.youtube.com/user/NorthTrue\" rel=\"noopener\" target=\"_blank\">NorthTrue</a>&#8221; Eyben and <a href=\"https://www.facebook.com/joewheelerasl/videos\" rel=\"noopener\" target=\"_blank\">Joseph Wheeler</a>.</p>\n<div id=\"attachment_1322\" style=\"width: 510px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-1322\" decoding=\"async\" loading=\"lazy\" src=\"https://grieve-smith.com/blog/wp-content/uploads/2021/10/NorthTrue-mail-500x247.png\" alt=\"\" width=\"500\" height=\"247\" class=\"size-medium wp-image-1322\" srcset=\"https://grieve-smith.com/blog/wp-content/uploads/2021/10/NorthTrue-mail-500x247.png 500w, https://grieve-smith.com/blog/wp-content/uploads/2021/10/NorthTrue-mail-768x379.png 768w, https://grieve-smith.com/blog/wp-content/uploads/2021/10/NorthTrue-mail.png 825w\" sizes=\"(max-width: 500px) 100vw, 500px\" /><p id=\"caption-attachment-1322\" class=\"wp-caption-text\">Deaf YouTuber NorthTrue makes the ASL sign for &#8220;mail&#8221;</p></div>\n<p>The first exercise I gave my students was a scavenger hunt.  I had previously found them to be useful in studying spoken language features at all levels of analysis.  Here is a list of items I asked my students to find in one two-minute video:</p>\n<ul>\n<li>A lexical sign</li>\n<li>A point</li>\n<li>A gesture depicting movement or location</li>\n<li>An iconic gesture miming a person&#8217;s hand movement</li>\n<li>A nonmanual miming a person&#8217;s emotion</li>\n<li>A grammatical nonmanual indicating question, role shifting or topic</li>\n</ul>\n<p>The students did well on the exercises, whether in class, for homework or for exams.  Unfortunately that was pretty much all that I was able to develop during the years I taught Introduction to Phonology.</p>\n<p>There is one more exercise I created using sign phonology; I will write about that in a future post.</p>\n"},{"id":"https://grieve-smith.com/blog/?p=1293","title":"How to set up your own LanguageLab","link":"https://grieve-smith.com/blog/2021/03/how-to-set-up-your-own-languagelab/","published":"Wed, 24 Mar 2021 18:59:21 +0000","description":"I&#8217;ve got great news! I have now released LanguageLab, my free, open-source software for learning languages and music, to the public on GitHub. I wish I could tell you I&#8217;ve got a public site up...","isPermalink":false,"tags":["Phonetics","Software","Teaching"],"authors":[{"name":"grvsmth","url":null}],"image":null,"modified":null,"contentHtml":"<p>I&#8217;ve got great news!  I have now released LanguageLab, my <a href=\"https://grieve-smith.com/blog/2021/02/a-free-open-source-language-lab-app/\">free, open-source software</a> for learning languages and music, <a href=\"https://github.com/grvsmth/languagelab\" rel=\"noopener\" target=\"_blank\">to the public on GitHub</a>.</p>\n<p>I wish I could tell you I&#8217;ve got a public site up that you can all use for free.  Unfortunately, the features that would make LanguageLab easy for multiple users to share one server are later in <a href=\"https://github.com/grvsmth/languagelab/blob/master/roadmap.md\" rel=\"noopener\" target=\"_blank\">the roadmap</a>.  There are a few other issues that also stand in the way of a massive public service.  But you can set up your own server!</p>\n<p>I&#8217;ve documented the steps in the README file, but here&#8217;s an overview.  You don&#8217;t need to know how to program, but you will need to know how to set up web services, retrieve files from GitHub, edit configuration files, and run a few commands at a Linux/MacOS/DOS prompt.</p>\n<p>LanguageLab uses Django, one of the most popular web frameworks for Python, and React, one of the most popular frameworks for Javascript.  All you need is a server that can run Django and host some Javascript files!  I&#8217;ve been doing my development and testing on Pythonanywhere, but I&#8217;ve also set it up on Amazon Web Services, and you should be able to run it on Google Cloud, Microsoft Azure, a University web server or even your personal computer.</p>\n<p>There are guides online for setting up Django in all those environments.  Once you&#8217;ve got a basic Django setup installed, you&#8217;ll need to clone the LanguageLab repo from GitHub to a place where it can be read by your web server.  Then you&#8217;ll configure it to access the database, and configure the web server to load it.  You&#8217;ll use Pip and NPM to download the Python and Javascript libraries you need, like the Django REST Framework, React and the Open Iconic font.  Finally, you&#8217;ll copy all the files into the right places for the web server to read them and restart the server.</p>\n<p>Once you&#8217;ve got everything in place, you should be able to log in!  You can make multiple accounts, but keep in mind that at this point we do not have account-level access, so all accounts have full access to all the data.  You can then start building your library of languages, media, exercises and lessons.  LanguageLab comes with the most widely used languages, but it&#8217;s easy to set up new ones if yours are not on the list.</p>\n<p>Media can be a bit tricky, because LanguageLab is not a media server.  You can upload your media to another place on your server, or any other server &#8211; as long as it&#8217;s got an HTTPS URL you should be able to use it.  If the media you&#8217;re using is copyrighted you may want to set up some basic password protection to avoid any accusations of piracy.  I use a simple .htaccess password.  I have to log in every time, but it works.</p>\n<p>With the URL of your media file, you can create a media entry.  Just paste that URL into the form and add metadata to keep track of the file and what it can be used for.  You can then set up one or more exercises based on particular segments of that media file.  It may take a little trial and error to get the exercises right.</p>\n<p>You can then create one or more lessons to organize your exercises.  You can choose to have a lesson for all the exercises in a particular media file, or you can combine exercises from multiple media files in a lesson.  It&#8217;s up to you how to organize the lessons.  You can edit the queues for each lesson to reorder or remove exercises.</p>\n<p>Once you&#8217;ve got exercises, you can start practicing!  The principle is simple: listen to the model, repeat into the microphone, then listen to the model again, followed by your recording.  Set yourself a goal of a.certain number of repetitions per session.</p>\n<p>After you&#8217;ve created your language and media entries, exercises and lessons, you can export the data.  <em>Importing</em> the data is not yet implemented, but the data is exported to a human-readable JSON format that you can then recreate if necessary.</p>\n<p>In the near future I will <a href=\"https://www.twitch.tv/grvsmth/\" rel=\"noopener\" target=\"_blank\">go on Twitch</a> to demonstrate how to set up exercises and lessons, and how to practice with them.  I will also try to find time to demonstrate the installation process.  I will record each demonstration and <a href=\"https://www.youtube.com/user/grvsmth\" rel=\"noopener\" target=\"_blank\">put it on YouTube</a> for your future reference.  You can <a href=\"https://twitter.com/grvsmth\" rel=\"noopener\" target=\"_blank\">follow me on Twitter</a> to find out when I&#8217;m doing the demos and posting the videos.</p>\n<p>If you try setting up a LanguageLab, please let me know how it goes!  You can report bugs by creating incidents on GitHub, or you can send me an email.  I&#8217;m happy to hear about problems, but I&#8217;d also like to hear success stories!  And if you know some Python or Javascript, please consider writing a little code to help me add one of the features in the roadmap!</p>\n"}]}